<?php
$areaArr['140202']='山西省大同市城区';
$areaArr['140203']='山西省大同市矿区';
$areaArr['140211']='山西省大同市南郊区';
$areaArr['140212']='山西省大同市新荣区';
$areaArr['140221']='山西省大同市阳高县';
$areaArr['140222']='山西省大同市天镇县';
$areaArr['140223']='山西省大同市广灵县';
$areaArr['140224']='山西省大同市灵丘县';
$areaArr['140225']='山西省大同市浑源县';
$areaArr['140226']='山西省大同市左云县';
$areaArr['140227']='山西省大同市大同县';
$areaArr['140300']='山西省阳泉市';
$areaArr['140301']='山西省阳泉市';
$areaArr['140302']='山西省阳泉市城区';
$areaArr['140303']='山西省阳泉市矿区';
$areaArr['140311']='山西省阳泉市郊区';
$areaArr['140321']='山西省阳泉市平定县';
$areaArr['140322']='山西省阳泉市盂县';
$areaArr['140400']='山西省长治市';
$areaArr['140401']='山西省长治市';
$areaArr['140402']='山西省长治市城区';
$areaArr['140411']='山西省长治市郊区';
$areaArr['140421']='山西省长治市长治县';
$areaArr['140423']='山西省长治市襄垣县';
$areaArr['140424']='山西省长治市屯留县';
$areaArr['140425']='山西省长治市平顺县';
$areaArr['140426']='山西省长治市黎城县';
$areaArr['140427']='山西省长治市壶关县';
$areaArr['140428']='山西省长治市长子县';
$areaArr['140429']='山西省长治市武乡县';
$areaArr['140430']='山西省长治市沁县';
$areaArr['140431']='山西省长治市沁源县';
$areaArr['140481']='山西省长治市潞城市';
$areaArr['140500']='山西省晋城市';
$areaArr['140501']='山西省晋城市';
$areaArr['140502']='山西省晋城市城区';
$areaArr['140521']='山西省晋城市沁水县';
$areaArr['140522']='山西省晋城市阳城县';
$areaArr['140524']='山西省晋城市陵川县';
$areaArr['140525']='山西省晋城市泽州县';
$areaArr['140581']='山西省晋城市高平市';
$areaArr['140600']='山西省朔州市';
$areaArr['140601']='山西省朔州市';
$areaArr['140602']='山西省朔州市朔城区';
$areaArr['140603']='山西省朔州市平鲁区';
$areaArr['140621']='山西省朔州市山阴县';
$areaArr['140622']='山西省朔州市应县';
$areaArr['140623']='山西省朔州市右玉县';
$areaArr['140624']='山西省朔州市怀仁县';
$areaArr['140700']='山西省晋中市';
$areaArr['140701']='山西省晋中市';
$areaArr['140702']='山西省晋中市榆次区';
$areaArr['140721']='山西省晋中市榆社县';
$areaArr['140722']='山西省晋中市左权县';
$areaArr['140723']='山西省晋中市和顺县';
$areaArr['140724']='山西省晋中市昔阳县';
$areaArr['140725']='山西省晋中市寿阳县';
$areaArr['140726']='山西省晋中市太谷县';
$areaArr['140727']='山西省晋中市祁县';
$areaArr['140728']='山西省晋中市平遥县';
$areaArr['140729']='山西省晋中市灵石县';
$areaArr['140781']='山西省晋中市介休市';
$areaArr['140800']='山西省运城市';
$areaArr['130531']='河北省邢台市广宗县';
$areaArr['130532']='河北省邢台市平乡县';
$areaArr['130533']='河北省邢台市威县';
$areaArr['130534']='河北省邢台市清河县';
$areaArr['130535']='河北省邢台市临西县';
$areaArr['130581']='河北省邢台市南宫市';
$areaArr['130582']='河北省邢台市沙河市';
$areaArr['130600']='河北省保定市';
$areaArr['130601']='河北省保定市';
$areaArr['130602']='河北省保定市新市区';
$areaArr['130603']='河北省保定市北市区';
$areaArr['130604']='河北省保定市南市区';
$areaArr['130621']='河北省保定市满城县';
$areaArr['130622']='河北省保定市清苑县';
$areaArr['130623']='河北省保定市涞水县';
$areaArr['130624']='河北省保定市阜平县';
$areaArr['130625']='河北省保定市徐水县';
$areaArr['130626']='河北省保定市定兴县';
$areaArr['130627']='河北省保定市唐县';
$areaArr['130628']='河北省保定市高阳县';
$areaArr['130629']='河北省保定市容城县';
$areaArr['130630']='河北省保定市涞源县';
$areaArr['130631']='河北省保定市望都县';
$areaArr['130632']='河北省保定市安新县';
$areaArr['130633']='河北省保定市易县';
$areaArr['130634']='河北省保定市曲阳县';
$areaArr['130635']='河北省保定市蠡县';
$areaArr['130636']='河北省保定市顺平县';
$areaArr['130637']='河北省保定市博野县';
$areaArr['130638']='河北省保定市雄县';
$areaArr['130681']='河北省保定市涿州市';
$areaArr['130682']='河北省保定市定州市';
$areaArr['130683']='河北省保定市安国市';
$areaArr['130684']='河北省保定市高碑店市';
$areaArr['130700']='河北省张家口市';
$areaArr['130701']='河北省张家口市';
$areaArr['130702']='河北省张家口市桥东区';
$areaArr['130703']='河北省张家口市桥西区';
$areaArr['130705']='河北省张家口市宣化区';
$areaArr['130706']='河北省张家口市下花园区';
$areaArr['130721']='河北省张家口市宣化县';
$areaArr['130722']='河北省张家口市张北县';
$areaArr['130723']='河北省张家口市康保县';
$areaArr['130724']='河北省张家口市沽源县';
$areaArr['130725']='河北省张家口市尚义县';
$areaArr['130726']='河北省张家口市蔚县';
$areaArr['130727']='河北省张家口市阳原县';
$areaArr['130728']='河北省张家口市怀安县';
$areaArr['130729']='河北省张家口市万全县';
$areaArr['130730']='河北省张家口市怀来县';
$areaArr['130731']='河北省张家口市涿鹿县';
$areaArr['130732']='河北省张家口市赤城县';
$areaArr['130733']='河北省张家口市崇礼县';
$areaArr['130800']='河北省承德市';
$areaArr['130801']='河北省承德市';
$areaArr['130802']='河北省承德市双桥区';
$areaArr['130803']='河北省承德市双滦区';
$areaArr['130804']='河北省承德市鹰手营子矿区';
$areaArr['130821']='河北省承德市承德县';
$areaArr['130822']='河北省承德市兴隆县';
$areaArr['130823']='河北省承德市平泉县';
$areaArr['130824']='河北省承德市滦平县';
$areaArr['110000']='北京市';
$areaArr['110100']='北京市';
$areaArr['110101']='北京市东城区';
$areaArr['110102']='北京市西城区';
$areaArr['110103']='北京市崇文区';
$areaArr['110104']='北京市宣武区';
$areaArr['110105']='北京市朝阳区';
$areaArr['110106']='北京市丰台区';
$areaArr['110107']='北京市石景山区';
$areaArr['110108']='北京市海淀区';
$areaArr['110109']='北京市门头沟区';
$areaArr['110111']='北京市房山区';
$areaArr['110112']='北京市通州区';
$areaArr['110113']='北京市顺义区';
$areaArr['110114']='北京市昌平区';
$areaArr['110115']='北京市大兴区';
$areaArr['110116']='北京市怀柔区';
$areaArr['110117']='北京市平谷区';
$areaArr['110200']='北京市';
$areaArr['110228']='北京市密云县';
$areaArr['110229']='北京市延庆县';
$areaArr['120000']='天津市';
$areaArr['120100']='天津市';
$areaArr['120101']='天津市和平区';
$areaArr['120102']='天津市河东区';
$areaArr['120103']='天津市河西区';
$areaArr['120104']='天津市南开区';
$areaArr['120105']='天津市河北区';
$areaArr['120106']='天津市红桥区';
$areaArr['120107']='天津市塘沽区';
$areaArr['120108']='天津市汉沽区';
$areaArr['120109']='天津市大港区';
$areaArr['120110']='天津市东丽区';
$areaArr['120111']='天津市西青区';
$areaArr['120112']='天津市津南区';
$areaArr['120113']='天津市北辰区';
$areaArr['120114']='天津市武清区';
$areaArr['120115']='天津市宝坻区';
$areaArr['120200']='天津市';
$areaArr['120221']='天津市宁河县';
$areaArr['120223']='天津市静海县';
$areaArr['120225']='天津市蓟县';
$areaArr['130000']='河北省';
$areaArr['130100']='河北省石家庄市';
$areaArr['130101']='河北省石家庄市';
$areaArr['130102']='河北省石家庄市长安区';
$areaArr['130103']='河北省石家庄市桥东区';
$areaArr['130104']='河北省石家庄市桥西区';
$areaArr['130105']='河北省石家庄市新华区';
$areaArr['130107']='河北省石家庄市井陉矿区';
$areaArr['130108']='河北省石家庄市裕华区';
$areaArr['130121']='河北省石家庄市井陉县';
$areaArr['130123']='河北省石家庄市正定县';
$areaArr['130124']='河北省石家庄市栾城县';
$areaArr['130125']='河北省石家庄市行唐县';
$areaArr['130126']='河北省石家庄市灵寿县';
$areaArr['130127']='河北省石家庄市高邑县';
$areaArr['130128']='河北省石家庄市深泽县';
$areaArr['130129']='河北省石家庄市赞皇县';
$areaArr['130130']='河北省石家庄市无极县';
$areaArr['130131']='河北省石家庄市平山县';
$areaArr['130132']='河北省石家庄市元氏县';
$areaArr['130133']='河北省石家庄市赵县';
$areaArr['130181']='河北省石家庄市辛集市';
$areaArr['130182']='河北省石家庄市藁城市';
$areaArr['130183']='河北省石家庄市晋州市';
$areaArr['130825']='河北省承德市隆化县';
$areaArr['130826']='河北省承德市丰宁满族自治县';
$areaArr['130827']='河北省承德市宽城满族自治县';
$areaArr['130828']='河北省承德市围场满族蒙古族自治县';
$areaArr['130900']='河北省沧州市';
$areaArr['130901']='河北省沧州市';
$areaArr['130902']='河北省沧州市新华区';
$areaArr['130903']='河北省沧州市运河区';
$areaArr['130921']='河北省沧州市沧县';
$areaArr['130922']='河北省沧州市青县';
$areaArr['130923']='河北省沧州市东光县';
$areaArr['130924']='河北省沧州市海兴县';
$areaArr['130925']='河北省沧州市盐山县';
$areaArr['130926']='河北省沧州市肃宁县';
$areaArr['130927']='河北省沧州市南皮县';
$areaArr['130928']='河北省沧州市吴桥县';
$areaArr['130929']='河北省沧州市献县';
$areaArr['130930']='河北省沧州市孟村回族自治县';
$areaArr['130981']='河北省沧州市泊头市';
$areaArr['130982']='河北省沧州市任丘市';
$areaArr['130983']='河北省沧州市黄骅市';
$areaArr['130984']='河北省沧州市河间市';
$areaArr['131000']='河北省廊坊市';
$areaArr['131001']='河北省廊坊市';
$areaArr['131002']='河北省廊坊市安次区';
$areaArr['131003']='河北省廊坊市广阳区';
$areaArr['131022']='河北省廊坊市固安县';
$areaArr['131023']='河北省廊坊市永清县';
$areaArr['131024']='河北省廊坊市香河县';
$areaArr['131025']='河北省廊坊市大城县';
$areaArr['131026']='河北省廊坊市文安县';
$areaArr['131028']='河北省廊坊市大厂回族自治县';
$areaArr['131081']='河北省廊坊市霸州市';
$areaArr['131082']='河北省廊坊市三河市';
$areaArr['131100']='河北省衡水市';
$areaArr['131101']='河北省衡水市';
$areaArr['131102']='河北省衡水市桃城区';
$areaArr['131121']='河北省衡水市枣强县';
$areaArr['131122']='河北省衡水市武邑县';
$areaArr['131123']='河北省衡水市武强县';
$areaArr['131124']='河北省衡水市饶阳县';
$areaArr['131125']='河北省衡水市安平县';
$areaArr['131126']='河北省衡水市故城县';
$areaArr['131127']='河北省衡水市景县';
$areaArr['131128']='河北省衡水市阜城县';
$areaArr['131181']='河北省衡水市冀州市';
$areaArr['131182']='河北省衡水市深州市';
$areaArr['140000']='山西省';
$areaArr['140100']='山西省太原市';
$areaArr['140101']='山西省太原市';
$areaArr['140105']='山西省太原市小店区';
$areaArr['140106']='山西省太原市迎泽区';
$areaArr['140107']='山西省太原市杏花岭区';
$areaArr['140108']='山西省太原市尖草坪区';
$areaArr['140109']='山西省太原市万柏林区';
$areaArr['140110']='山西省太原市晋源区';
$areaArr['140121']='山西省太原市清徐县';
$areaArr['140122']='山西省太原市阳曲县';
$areaArr['140123']='山西省太原市娄烦县';
$areaArr['140181']='山西省太原市古交市';
$areaArr['140200']='山西省大同市';
$areaArr['140201']='山西省大同市';
$areaArr['130184']='河北省石家庄市新乐市';
$areaArr['130185']='河北省石家庄市鹿泉市';
$areaArr['130200']='河北省唐山市';
$areaArr['130201']='河北省唐山市';
$areaArr['130202']='河北省唐山市路南区';
$areaArr['130203']='河北省唐山市路北区';
$areaArr['130204']='河北省唐山市古冶区';
$areaArr['130205']='河北省唐山市开平区';
$areaArr['130207']='河北省唐山市丰南区';
$areaArr['130208']='河北省唐山市丰润区';
$areaArr['130223']='河北省唐山市滦县';
$areaArr['130224']='河北省唐山市滦南县';
$areaArr['130225']='河北省唐山市乐亭县';
$areaArr['130227']='河北省唐山市迁西县';
$areaArr['130229']='河北省唐山市玉田县';
$areaArr['130230']='河北省唐山市唐海县';
$areaArr['130281']='河北省唐山市遵化市';
$areaArr['130283']='河北省唐山市迁安市';
$areaArr['130300']='河北省秦皇岛市';
$areaArr['130301']='河北省秦皇岛市';
$areaArr['130302']='河北省秦皇岛市海港区';
$areaArr['130303']='河北省秦皇岛市山海关区';
$areaArr['130304']='河北省秦皇岛市北戴河区';
$areaArr['130321']='河北省秦皇岛市青龙满族自治县';
$areaArr['130322']='河北省秦皇岛市昌黎县';
$areaArr['130323']='河北省秦皇岛市抚宁县';
$areaArr['130324']='河北省秦皇岛市卢龙县';
$areaArr['130400']='河北省邯郸市';
$areaArr['130401']='河北省邯郸市';
$areaArr['130402']='河北省邯郸市邯山区';
$areaArr['130403']='河北省邯郸市丛台区';
$areaArr['130404']='河北省邯郸市复兴区';
$areaArr['130406']='河北省邯郸市峰峰矿区';
$areaArr['130421']='河北省邯郸市邯郸县';
$areaArr['130423']='河北省邯郸市临漳县';
$areaArr['130424']='河北省邯郸市成安县';
$areaArr['130425']='河北省邯郸市大名县';
$areaArr['130426']='河北省邯郸市涉县';
$areaArr['130427']='河北省邯郸市磁县';
$areaArr['130428']='河北省邯郸市肥乡县';
$areaArr['130429']='河北省邯郸市永年县';
$areaArr['130430']='河北省邯郸市邱县';
$areaArr['130431']='河北省邯郸市鸡泽县';
$areaArr['130432']='河北省邯郸市广平县';
$areaArr['130433']='河北省邯郸市馆陶县';
$areaArr['130434']='河北省邯郸市魏县';
$areaArr['130435']='河北省邯郸市曲周县';
$areaArr['130481']='河北省邯郸市武安市';
$areaArr['130500']='河北省邢台市';
$areaArr['130501']='河北省邢台市';
$areaArr['130502']='河北省邢台市桥东区';
$areaArr['130503']='河北省邢台市桥西区';
$areaArr['130521']='河北省邢台市邢台县';
$areaArr['130522']='河北省邢台市临城县';
$areaArr['130523']='河北省邢台市内丘县';
$areaArr['130524']='河北省邢台市柏乡县';
$areaArr['130525']='河北省邢台市隆尧县';
$areaArr['130526']='河北省邢台市任县';
$areaArr['130527']='河北省邢台市南和县';
$areaArr['130528']='河北省邢台市宁晋县';
$areaArr['130529']='河北省邢台市巨鹿县';
$areaArr['130530']='河北省邢台市新河县';
$areaArr['230183']='黑龙江省哈尔滨市尚志市';
$areaArr['230184']='黑龙江省哈尔滨市五常市';
$areaArr['230200']='黑龙江省齐齐哈尔市';
$areaArr['230201']='黑龙江省齐齐哈尔市';
$areaArr['230202']='黑龙江省齐齐哈尔市龙沙区';
$areaArr['230203']='黑龙江省齐齐哈尔市建华区';
$areaArr['230204']='黑龙江省齐齐哈尔市铁锋区';
$areaArr['230205']='黑龙江省齐齐哈尔市昂昂溪区';
$areaArr['230206']='黑龙江省齐齐哈尔市富拉尔基区';
$areaArr['230207']='黑龙江省齐齐哈尔市碾子山区';
$areaArr['230208']='黑龙江省齐齐哈尔市梅里斯达斡尔族区';
$areaArr['230221']='黑龙江省齐齐哈尔市龙江县';
$areaArr['230223']='黑龙江省齐齐哈尔市依安县';
$areaArr['230224']='黑龙江省齐齐哈尔市泰来县';
$areaArr['230225']='黑龙江省齐齐哈尔市甘南县';
$areaArr['230227']='黑龙江省齐齐哈尔市富裕县';
$areaArr['230229']='黑龙江省齐齐哈尔市克山县';
$areaArr['230230']='黑龙江省齐齐哈尔市克东县';
$areaArr['230231']='黑龙江省齐齐哈尔市拜泉县';
$areaArr['230281']='黑龙江省齐齐哈尔市讷河市';
$areaArr['230300']='黑龙江省鸡西市';
$areaArr['230301']='黑龙江省鸡西市';
$areaArr['230302']='黑龙江省鸡西市鸡冠区';
$areaArr['230303']='黑龙江省鸡西市恒山区';
$areaArr['230304']='黑龙江省鸡西市滴道区';
$areaArr['230305']='黑龙江省鸡西市梨树区';
$areaArr['230306']='黑龙江省鸡西市城子河区';
$areaArr['230307']='黑龙江省鸡西市麻山区';
$areaArr['230321']='黑龙江省鸡西市鸡东县';
$areaArr['230381']='黑龙江省鸡西市虎林市';
$areaArr['230382']='黑龙江省鸡西市密山市';
$areaArr['230400']='黑龙江省鹤岗市';
$areaArr['230401']='黑龙江省鹤岗市';
$areaArr['230402']='黑龙江省鹤岗市向阳区';
$areaArr['230403']='黑龙江省鹤岗市工农区';
$areaArr['230404']='黑龙江省鹤岗市南山区';
$areaArr['230405']='黑龙江省鹤岗市兴安区';
$areaArr['230406']='黑龙江省鹤岗市东山区';
$areaArr['230407']='黑龙江省鹤岗市兴山区';
$areaArr['230421']='黑龙江省鹤岗市萝北县';
$areaArr['230422']='黑龙江省鹤岗市绥滨县';
$areaArr['230500']='黑龙江省双鸭山市';
$areaArr['230501']='黑龙江省双鸭山市';
$areaArr['230502']='黑龙江省双鸭山市尖山区';
$areaArr['230503']='黑龙江省双鸭山市岭东区';
$areaArr['230505']='黑龙江省双鸭山市四方台区';
$areaArr['230506']='黑龙江省双鸭山市宝山区';
$areaArr['230521']='黑龙江省双鸭山市集贤县';
$areaArr['230522']='黑龙江省双鸭山市友谊县';
$areaArr['230523']='黑龙江省双鸭山市宝清县';
$areaArr['230524']='黑龙江省双鸭山市饶河县';
$areaArr['230600']='黑龙江省大庆市';
$areaArr['230601']='黑龙江省大庆市';
$areaArr['230602']='黑龙江省大庆市萨尔图区';
$areaArr['150927']='内蒙古自治区乌兰察布市察哈尔右翼中旗';
$areaArr['150928']='内蒙古自治区乌兰察布市察哈尔右翼后旗';
$areaArr['150929']='内蒙古自治区乌兰察布市四子王旗';
$areaArr['150981']='内蒙古自治区乌兰察布市丰镇市';
$areaArr['152200']='内蒙古自治区兴安盟';
$areaArr['152201']='内蒙古自治区兴安盟乌兰浩特市';
$areaArr['152202']='内蒙古自治区兴安盟阿尔山市';
$areaArr['152221']='内蒙古自治区兴安盟科尔沁右翼前旗';
$areaArr['152222']='内蒙古自治区兴安盟科尔沁右翼中旗';
$areaArr['152223']='内蒙古自治区兴安盟扎赉特旗';
$areaArr['152224']='内蒙古自治区兴安盟突泉县';
$areaArr['152500']='内蒙古自治区锡林郭勒盟';
$areaArr['152501']='内蒙古自治区锡林郭勒盟二连浩特市';
$areaArr['152502']='内蒙古自治区锡林郭勒盟锡林浩特市';
$areaArr['152522']='内蒙古自治区锡林郭勒盟阿巴嘎旗';
$areaArr['211221']='辽宁省铁岭市铁岭县';
$areaArr['211223']='辽宁省铁岭市西丰县';
$areaArr['211224']='辽宁省铁岭市昌图县';
$areaArr['211281']='辽宁省铁岭市调兵山市';
$areaArr['211282']='辽宁省铁岭市开原市';
$areaArr['211300']='辽宁省朝阳市';
$areaArr['211301']='辽宁省朝阳市';
$areaArr['211302']='辽宁省朝阳市双塔区';
$areaArr['211303']='辽宁省朝阳市龙城区';
$areaArr['211321']='辽宁省朝阳市朝阳县';
$areaArr['211322']='辽宁省朝阳市建平县';
$areaArr['211324']='辽宁省朝阳市喀喇沁左翼蒙古族自治县';
$areaArr['211381']='辽宁省朝阳市北票市';
$areaArr['211382']='辽宁省朝阳市凌源市';
$areaArr['211400']='辽宁省葫芦岛市';
$areaArr['211401']='辽宁省葫芦岛市';
$areaArr['211402']='辽宁省葫芦岛市连山区';
$areaArr['211403']='辽宁省葫芦岛市龙港区';
$areaArr['211404']='辽宁省葫芦岛市南票区';
$areaArr['211421']='辽宁省葫芦岛市绥中县';
$areaArr['211422']='辽宁省葫芦岛市建昌县';
$areaArr['211481']='辽宁省葫芦岛市兴城市';
$areaArr['220000']='吉林省';
$areaArr['220100']='吉林省长春市';
$areaArr['220101']='吉林省长春市';
$areaArr['220102']='吉林省长春市南关区';
$areaArr['220103']='吉林省长春市宽城区';
$areaArr['220104']='吉林省长春市朝阳区';
$areaArr['220105']='吉林省长春市二道区';
$areaArr['220106']='吉林省长春市绿园区';
$areaArr['220112']='吉林省长春市双阳区';
$areaArr['220122']='吉林省长春市农安县';
$areaArr['220181']='吉林省长春市九台市';
$areaArr['220182']='吉林省长春市榆树市';
$areaArr['220183']='吉林省长春市德惠市';
$areaArr['220200']='吉林省吉林市';
$areaArr['220201']='吉林省吉林市';
$areaArr['220202']='吉林省吉林市昌邑区';
$areaArr['220203']='吉林省吉林市龙潭区';
$areaArr['220204']='吉林省吉林市船营区';
$areaArr['220211']='吉林省吉林市丰满区';
$areaArr['220221']='吉林省吉林市永吉县';
$areaArr['220281']='吉林省吉林市蛟河市';
$areaArr['220282']='吉林省吉林市桦甸市';
$areaArr['220283']='吉林省吉林市舒兰市';
$areaArr['220284']='吉林省吉林市磐石市';
$areaArr['220300']='吉林省四平市';
$areaArr['220301']='吉林省四平市';
$areaArr['220302']='吉林省四平市铁西区';
$areaArr['220303']='吉林省四平市铁东区';
$areaArr['220322']='吉林省四平市梨树县';
$areaArr['220323']='吉林省四平市伊通满族自治县';
$areaArr['220381']='吉林省四平市公主岭市';
$areaArr['220382']='吉林省四平市双辽市';
$areaArr['220400']='吉林省辽源市';
$areaArr['220401']='吉林省辽源市';
$areaArr['220402']='吉林省辽源市龙山区';
$areaArr['220403']='吉林省辽源市西安区';
$areaArr['220421']='吉林省辽源市东丰县';
$areaArr['220422']='吉林省辽源市东辽县';
$areaArr['220500']='吉林省通化市';
$areaArr['210500']='辽宁省本溪市';
$areaArr['150000']='内蒙古自治区';
$areaArr['150100']='内蒙古自治区呼和浩特市';
$areaArr['150101']='内蒙古自治区呼和浩特市';
$areaArr['150102']='内蒙古自治区呼和浩特市新城区';
$areaArr['150103']='内蒙古自治区呼和浩特市回民区';
$areaArr['150104']='内蒙古自治区呼和浩特市玉泉区';
$areaArr['150105']='内蒙古自治区呼和浩特市赛罕区';
$areaArr['150121']='内蒙古自治区呼和浩特市土默特左旗';
$areaArr['150122']='内蒙古自治区呼和浩特市托克托县';
$areaArr['150123']='内蒙古自治区呼和浩特市和林格尔县';
$areaArr['150124']='内蒙古自治区呼和浩特市清水河县';
$areaArr['150125']='内蒙古自治区呼和浩特市武川县';
$areaArr['150200']='内蒙古自治区包头市';
$areaArr['150201']='内蒙古自治区包头市';
$areaArr['150202']='内蒙古自治区包头市东河区';
$areaArr['150203']='内蒙古自治区包头市昆都仑区';
$areaArr['150204']='内蒙古自治区包头市青山区';
$areaArr['150205']='内蒙古自治区包头市石拐区';
$areaArr['150206']='内蒙古自治区包头市白云矿区';
$areaArr['150207']='内蒙古自治区包头市九原区';
$areaArr['150221']='内蒙古自治区包头市土默特右旗';
$areaArr['150222']='内蒙古自治区包头市固阳县';
$areaArr['150223']='内蒙古自治区包头市达尔罕茂明安联合旗';
$areaArr['150300']='内蒙古自治区乌海市';
$areaArr['150301']='内蒙古自治区乌海市';
$areaArr['150302']='内蒙古自治区乌海市海勃湾区';
$areaArr['150303']='内蒙古自治区乌海市海南区';
$areaArr['150304']='内蒙古自治区乌海市乌达区';
$areaArr['150400']='内蒙古自治区赤峰市';
$areaArr['150401']='内蒙古自治区赤峰市';
$areaArr['150402']='内蒙古自治区赤峰市红山区';
$areaArr['150403']='内蒙古自治区赤峰市元宝山区';
$areaArr['150404']='内蒙古自治区赤峰市松山区';
$areaArr['150421']='内蒙古自治区赤峰市阿鲁科尔沁旗';
$areaArr['150422']='内蒙古自治区赤峰市巴林左旗';
$areaArr['150423']='内蒙古自治区赤峰市巴林右旗';
$areaArr['150424']='内蒙古自治区赤峰市林西县';
$areaArr['150425']='内蒙古自治区赤峰市克什克腾旗';
$areaArr['150426']='内蒙古自治区赤峰市翁牛特旗';
$areaArr['150428']='内蒙古自治区赤峰市喀喇沁旗';
$areaArr['150429']='内蒙古自治区赤峰市宁城县';
$areaArr['150430']='内蒙古自治区赤峰市敖汉旗';
$areaArr['150500']='内蒙古自治区通辽市';
$areaArr['150501']='内蒙古自治区通辽市';
$areaArr['150502']='内蒙古自治区通辽市科尔沁区';
$areaArr['150521']='内蒙古自治区通辽市科尔沁左翼中旗';
$areaArr['150522']='内蒙古自治区通辽市科尔沁左翼后旗';
$areaArr['150523']='内蒙古自治区通辽市开鲁县';
$areaArr['150524']='内蒙古自治区通辽市库伦旗';
$areaArr['150525']='内蒙古自治区通辽市奈曼旗';
$areaArr['150526']='内蒙古自治区通辽市扎鲁特旗';
$areaArr['150581']='内蒙古自治区通辽市霍林郭勒市';
$areaArr['150600']='内蒙古自治区鄂尔多斯市';
$areaArr['150602']='内蒙古自治区鄂尔多斯市东胜区';
$areaArr['150621']='内蒙古自治区鄂尔多斯市达拉特旗';
$areaArr['330122']='浙江省杭州市桐庐县';
$areaArr['140801']='山西省运城市';
$areaArr['140802']='山西省运城市盐湖区';
$areaArr['140821']='山西省运城市临猗县';
$areaArr['140822']='山西省运城市万荣县';
$areaArr['140823']='山西省运城市闻喜县';
$areaArr['140824']='山西省运城市稷山县';
$areaArr['140825']='山西省运城市新绛县';
$areaArr['140826']='山西省运城市绛县';
$areaArr['140827']='山西省运城市垣曲县';
$areaArr['140828']='山西省运城市夏县';
$areaArr['140829']='山西省运城市平陆县';
$areaArr['140830']='山西省运城市芮城县';
$areaArr['140881']='山西省运城市永济市';
$areaArr['140882']='山西省运城市河津市';
$areaArr['140900']='山西省忻州市';
$areaArr['140901']='山西省忻州市';
$areaArr['140902']='山西省忻州市忻府区';
$areaArr['140921']='山西省忻州市定襄县';
$areaArr['140922']='山西省忻州市五台县';
$areaArr['140923']='山西省忻州市代县';
$areaArr['140924']='山西省忻州市繁峙县';
$areaArr['140925']='山西省忻州市宁武县';
$areaArr['140926']='山西省忻州市静乐县';
$areaArr['140927']='山西省忻州市神池县';
$areaArr['140928']='山西省忻州市五寨县';
$areaArr['140929']='山西省忻州市岢岚县';
$areaArr['140930']='山西省忻州市河曲县';
$areaArr['140931']='山西省忻州市保德县';
$areaArr['140932']='山西省忻州市偏关县';
$areaArr['140981']='山西省忻州市原平市';
$areaArr['141000']='山西省临汾市';
$areaArr['141001']='山西省临汾市';
$areaArr['141002']='山西省临汾市尧都区';
$areaArr['141021']='山西省临汾市曲沃县';
$areaArr['141022']='山西省临汾市翼城县';
$areaArr['141023']='山西省临汾市襄汾县';
$areaArr['141024']='山西省临汾市洪洞县';
$areaArr['141025']='山西省临汾市古县';
$areaArr['141026']='山西省临汾市安泽县';
$areaArr['141027']='山西省临汾市浮山县';
$areaArr['141028']='山西省临汾市吉县';
$areaArr['141029']='山西省临汾市乡宁县';
$areaArr['141030']='山西省临汾市大宁县';
$areaArr['141031']='山西省临汾市隰县';
$areaArr['141032']='山西省临汾市永和县';
$areaArr['141033']='山西省临汾市蒲县';
$areaArr['141034']='山西省临汾市汾西县';
$areaArr['141081']='山西省临汾市侯马市';
$areaArr['141082']='山西省临汾市霍州市';
$areaArr['141100']='山西省吕梁市';
$areaArr['141101']='山西省吕梁市';
$areaArr['141102']='山西省吕梁市离石区';
$areaArr['141121']='山西省吕梁市文水县';
$areaArr['141122']='山西省吕梁市交城县';
$areaArr['141123']='山西省吕梁市兴县';
$areaArr['141124']='山西省吕梁市临县';
$areaArr['141125']='山西省吕梁市柳林县';
$areaArr['141126']='山西省吕梁市石楼县';
$areaArr['141127']='山西省吕梁市岚县';
$areaArr['141128']='山西省吕梁市方山县';
$areaArr['141129']='山西省吕梁市中阳县';
$areaArr['141130']='山西省吕梁市交口县';
$areaArr['141181']='山西省吕梁市孝义市';
$areaArr['210501']='辽宁省本溪市';
$areaArr['210502']='辽宁省本溪市平山区';
$areaArr['210503']='辽宁省本溪市溪湖区';
$areaArr['210504']='辽宁省本溪市明山区';
$areaArr['210505']='辽宁省本溪市南芬区';
$areaArr['210521']='辽宁省本溪市本溪满族自治县';
$areaArr['210522']='辽宁省本溪市桓仁满族自治县';
$areaArr['210600']='辽宁省丹东市';
$areaArr['210601']='辽宁省丹东市';
$areaArr['210602']='辽宁省丹东市元宝区';
$areaArr['210603']='辽宁省丹东市振兴区';
$areaArr['210604']='辽宁省丹东市振安区';
$areaArr['210624']='辽宁省丹东市宽甸满族自治县';
$areaArr['210681']='辽宁省丹东市东港市';
$areaArr['210682']='辽宁省丹东市凤城市';
$areaArr['210700']='辽宁省锦州市';
$areaArr['210701']='辽宁省锦州市';
$areaArr['210702']='辽宁省锦州市古塔区';
$areaArr['210703']='辽宁省锦州市凌河区';
$areaArr['210711']='辽宁省锦州市太和区';
$areaArr['210726']='辽宁省锦州市黑山县';
$areaArr['210727']='辽宁省锦州市义县';
$areaArr['210781']='辽宁省锦州市凌海市';
$areaArr['210782']='辽宁省锦州市北宁市';
$areaArr['210800']='辽宁省营口市';
$areaArr['210801']='辽宁省营口市';
$areaArr['210802']='辽宁省营口市站前区';
$areaArr['210803']='辽宁省营口市西市区';
$areaArr['210804']='辽宁省营口市鲅鱼圈区';
$areaArr['210811']='辽宁省营口市老边区';
$areaArr['210881']='辽宁省营口市盖州市';
$areaArr['210882']='辽宁省营口市大石桥市';
$areaArr['210900']='辽宁省阜新市';
$areaArr['210901']='辽宁省阜新市';
$areaArr['210902']='辽宁省阜新市海州区';
$areaArr['210903']='辽宁省阜新市新邱区';
$areaArr['210904']='辽宁省阜新市太平区';
$areaArr['210905']='辽宁省阜新市清河门区';
$areaArr['210911']='辽宁省阜新市细河区';
$areaArr['210921']='辽宁省阜新市阜新蒙古族自治县';
$areaArr['210922']='辽宁省阜新市彰武县';
$areaArr['211000']='辽宁省辽阳市';
$areaArr['211001']='辽宁省辽阳市';
$areaArr['211002']='辽宁省辽阳市白塔区';
$areaArr['211003']='辽宁省辽阳市文圣区';
$areaArr['211004']='辽宁省辽阳市宏伟区';
$areaArr['211005']='辽宁省辽阳市弓长岭区';
$areaArr['211011']='辽宁省辽阳市太子河区';
$areaArr['211021']='辽宁省辽阳市辽阳县';
$areaArr['211081']='辽宁省辽阳市灯塔市';
$areaArr['211100']='辽宁省盘锦市';
$areaArr['211101']='辽宁省盘锦市';
$areaArr['211102']='辽宁省盘锦市双台子区';
$areaArr['211103']='辽宁省盘锦市兴隆台区';
$areaArr['211121']='辽宁省盘锦市大洼县';
$areaArr['211122']='辽宁省盘锦市盘山县';
$areaArr['211200']='辽宁省铁岭市';
$areaArr['211201']='辽宁省铁岭市';
$areaArr['150601']='内蒙古自治区鄂尔多斯市';
$areaArr['321300']='江苏省宿迁市';
$areaArr['321301']='江苏省宿迁市';
$areaArr['321302']='江苏省宿迁市宿城区';
$areaArr['321311']='江苏省宿迁市宿豫区';
$areaArr['321322']='江苏省宿迁市沭阳县';
$areaArr['321323']='江苏省宿迁市泗阳县';
$areaArr['321324']='江苏省宿迁市泗洪县';
$areaArr['330000']='浙江省';
$areaArr['330100']='浙江省杭州市';
$areaArr['330101']='浙江省杭州市';
$areaArr['330102']='浙江省杭州市上城区';
$areaArr['330103']='浙江省杭州市下城区';
$areaArr['330104']='浙江省杭州市江干区';
$areaArr['330105']='浙江省杭州市拱墅区';
$areaArr['330106']='浙江省杭州市西湖区';
$areaArr['330108']='浙江省杭州市滨江区';
$areaArr['330109']='浙江省杭州市萧山区';
$areaArr['330110']='浙江省杭州市余杭区';
$areaArr['340303']='安徽省蚌埠市蚌山区';
$areaArr['330782']='浙江省金华市义乌市';
$areaArr['330783']='浙江省金华市东阳市';
$areaArr['330784']='浙江省金华市永康市';
$areaArr['330800']='浙江省衢州市';
$areaArr['330801']='浙江省衢州市';
$areaArr['330802']='浙江省衢州市柯城区';
$areaArr['330803']='浙江省衢州市衢江区';
$areaArr['330822']='浙江省衢州市常山县';
$areaArr['330824']='浙江省衢州市开化县';
$areaArr['330825']='浙江省衢州市龙游县';
$areaArr['330881']='浙江省衢州市江山市';
$areaArr['330900']='浙江省舟山市';
$areaArr['330901']='浙江省舟山市';
$areaArr['330902']='浙江省舟山市定海区';
$areaArr['330903']='浙江省舟山市普陀区';
$areaArr['330921']='浙江省舟山市岱山县';
$areaArr['330922']='浙江省舟山市嵊泗县';
$areaArr['331000']='浙江省台州市';
$areaArr['331001']='浙江省台州市';
$areaArr['331002']='浙江省台州市椒江区';
$areaArr['331003']='浙江省台州市黄岩区';
$areaArr['331004']='浙江省台州市路桥区';
$areaArr['331021']='浙江省台州市玉环县';
$areaArr['331022']='浙江省台州市三门县';
$areaArr['331023']='浙江省台州市天台县';
$areaArr['331024']='浙江省台州市仙居县';
$areaArr['331081']='浙江省台州市温岭市';
$areaArr['331082']='浙江省台州市临海市';
$areaArr['331100']='浙江省丽水市';
$areaArr['331101']='浙江省丽水市';
$areaArr['331102']='浙江省丽水市莲都区';
$areaArr['331121']='浙江省丽水市青田县';
$areaArr['331122']='浙江省丽水市缙云县';
$areaArr['331123']='浙江省丽水市遂昌县';
$areaArr['331124']='浙江省丽水市松阳县';
$areaArr['331125']='浙江省丽水市云和县';
$areaArr['331126']='浙江省丽水市庆元县';
$areaArr['331127']='浙江省丽水市景宁畲族自治县';
$areaArr['331181']='浙江省丽水市龙泉市';
$areaArr['340000']='安徽省';
$areaArr['340100']='安徽省合肥市';
$areaArr['340101']='安徽省合肥市';
$areaArr['340102']='安徽省合肥市瑶海区';
$areaArr['340103']='安徽省合肥市庐阳区';
$areaArr['340104']='安徽省合肥市蜀山区';
$areaArr['340111']='安徽省合肥市包河区';
$areaArr['340121']='安徽省合肥市长丰县';
$areaArr['340122']='安徽省合肥市肥东县';
$areaArr['340123']='安徽省合肥市肥西县';
$areaArr['340200']='安徽省芜湖市';
$areaArr['340201']='安徽省芜湖市';
$areaArr['340202']='安徽省芜湖市镜湖区';
$areaArr['340203']='安徽省芜湖市马塘区';
$areaArr['340204']='安徽省芜湖市新芜区';
$areaArr['340207']='安徽省芜湖市鸠江区';
$areaArr['340221']='安徽省芜湖市芜湖县';
$areaArr['340222']='安徽省芜湖市繁昌县';
$areaArr['340223']='安徽省芜湖市南陵县';
$areaArr['340300']='安徽省蚌埠市';
$areaArr['340301']='安徽省蚌埠市';
$areaArr['340302']='安徽省蚌埠市龙子湖区';
$areaArr['320802']='江苏省淮安市清河区';
$areaArr['340304']='安徽省蚌埠市禹会区';
$areaArr['340311']='安徽省蚌埠市淮上区';
$areaArr['340321']='安徽省蚌埠市怀远县';
$areaArr['340322']='安徽省蚌埠市五河县';
$areaArr['340323']='安徽省蚌埠市固镇县';
$areaArr['340400']='安徽省淮南市';
$areaArr['340401']='安徽省淮南市';
$areaArr['340402']='安徽省淮南市大通区';
$areaArr['340403']='安徽省淮南市田家庵区';
$areaArr['340404']='安徽省淮南市谢家集区';
$areaArr['340405']='安徽省淮南市八公山区';
$areaArr['340406']='安徽省淮南市潘集区';
$areaArr['340421']='安徽省淮南市凤台县';
$areaArr['340500']='安徽省马鞍山市';
$areaArr['340501']='安徽省马鞍山市';
$areaArr['340502']='安徽省马鞍山市金家庄区';
$areaArr['340503']='安徽省马鞍山市花山区';
$areaArr['340504']='安徽省马鞍山市雨山区';
$areaArr['340521']='安徽省马鞍山市当涂县';
$areaArr['340600']='安徽省淮北市';
$areaArr['340601']='安徽省淮北市';
$areaArr['340602']='安徽省淮北市杜集区';
$areaArr['340603']='安徽省淮北市相山区';
$areaArr['340604']='安徽省淮北市烈山区';
$areaArr['340621']='安徽省淮北市濉溪县';
$areaArr['340700']='安徽省铜陵市';
$areaArr['340701']='安徽省铜陵市';
$areaArr['340702']='安徽省铜陵市铜官山区';
$areaArr['340703']='安徽省铜陵市狮子山区';
$areaArr['340711']='安徽省铜陵市郊区';
$areaArr['340721']='安徽省铜陵市铜陵县';
$areaArr['340800']='安徽省安庆市';
$areaArr['340801']='安徽省安庆市';
$areaArr['340802']='安徽省安庆市迎江区';
$areaArr['340803']='安徽省安庆市大观区';
$areaArr['340811']='安徽省安庆市郊区';
$areaArr['340822']='安徽省安庆市怀宁县';
$areaArr['340823']='安徽省安庆市枞阳县';
$areaArr['340824']='安徽省安庆市潜山县';
$areaArr['340825']='安徽省安庆市太湖县';
$areaArr['340826']='安徽省安庆市宿松县';
$areaArr['340827']='安徽省安庆市望江县';
$areaArr['340828']='安徽省安庆市岳西县';
$areaArr['340881']='安徽省安庆市桐城市';
$areaArr['341000']='安徽省黄山市';
$areaArr['341001']='安徽省黄山市';
$areaArr['341002']='安徽省黄山市屯溪区';
$areaArr['341003']='安徽省黄山市黄山区';
$areaArr['341004']='安徽省黄山市徽州区';
$areaArr['341021']='安徽省黄山市歙县';
$areaArr['341022']='安徽省黄山市休宁县';
$areaArr['341023']='安徽省黄山市黟县';
$areaArr['341024']='安徽省黄山市祁门县';
$areaArr['341100']='安徽省滁州市';
$areaArr['341101']='安徽省滁州市';
$areaArr['341102']='安徽省滁州市琅琊区';
$areaArr['341103']='安徽省滁州市南谯区';
$areaArr['341122']='安徽省滁州市来安县';
$areaArr['341124']='安徽省滁州市全椒县';
$areaArr['341125']='安徽省滁州市定远县';
$areaArr['341126']='安徽省滁州市凤阳县';
$areaArr['231123']='黑龙江省黑河市逊克县';
$areaArr['330127']='浙江省杭州市淳安县';
$areaArr['330182']='浙江省杭州市建德市';
$areaArr['330183']='浙江省杭州市富阳市';
$areaArr['330185']='浙江省杭州市临安市';
$areaArr['330200']='浙江省宁波市';
$areaArr['330201']='浙江省宁波市';
$areaArr['330203']='浙江省宁波市海曙区';
$areaArr['330204']='浙江省宁波市江东区';
$areaArr['330205']='浙江省宁波市江北区';
$areaArr['330206']='浙江省宁波市北仑区';
$areaArr['330211']='浙江省宁波市镇海区';
$areaArr['330212']='浙江省宁波市鄞州区';
$areaArr['330225']='浙江省宁波市象山县';
$areaArr['330226']='浙江省宁波市宁海县';
$areaArr['330281']='浙江省宁波市余姚市';
$areaArr['330282']='浙江省宁波市慈溪市';
$areaArr['330283']='浙江省宁波市奉化市';
$areaArr['330300']='浙江省温州市';
$areaArr['330301']='浙江省温州市';
$areaArr['330302']='浙江省温州市鹿城区';
$areaArr['330303']='浙江省温州市龙湾区';
$areaArr['330304']='浙江省温州市瓯海区';
$areaArr['330322']='浙江省温州市洞头县';
$areaArr['330324']='浙江省温州市永嘉县';
$areaArr['330326']='浙江省温州市平阳县';
$areaArr['330327']='浙江省温州市苍南县';
$areaArr['330328']='浙江省温州市文成县';
$areaArr['330329']='浙江省温州市泰顺县';
$areaArr['330381']='浙江省温州市瑞安市';
$areaArr['330382']='浙江省温州市乐清市';
$areaArr['330400']='浙江省嘉兴市';
$areaArr['330401']='浙江省嘉兴市';
$areaArr['330402']='浙江省嘉兴市秀城区';
$areaArr['330411']='浙江省嘉兴市秀洲区';
$areaArr['330421']='浙江省嘉兴市嘉善县';
$areaArr['330424']='浙江省嘉兴市海盐县';
$areaArr['330481']='浙江省嘉兴市海宁市';
$areaArr['330482']='浙江省嘉兴市平湖市';
$areaArr['330483']='浙江省嘉兴市桐乡市';
$areaArr['330500']='浙江省湖州市';
$areaArr['330501']='浙江省湖州市';
$areaArr['330502']='浙江省湖州市吴兴区';
$areaArr['330503']='浙江省湖州市南浔区';
$areaArr['330521']='浙江省湖州市德清县';
$areaArr['330522']='浙江省湖州市长兴县';
$areaArr['330523']='浙江省湖州市安吉县';
$areaArr['330600']='浙江省绍兴市';
$areaArr['330601']='浙江省绍兴市';
$areaArr['330602']='浙江省绍兴市越城区';
$areaArr['330621']='浙江省绍兴市绍兴县';
$areaArr['330624']='浙江省绍兴市新昌县';
$areaArr['330681']='浙江省绍兴市诸暨市';
$areaArr['330682']='浙江省绍兴市上虞市';
$areaArr['330683']='浙江省绍兴市嵊州市';
$areaArr['330700']='浙江省金华市';
$areaArr['330701']='浙江省金华市';
$areaArr['330702']='浙江省金华市婺城区';
$areaArr['330703']='浙江省金华市金东区';
$areaArr['330723']='浙江省金华市武义县';
$areaArr['330726']='浙江省金华市浦江县';
$areaArr['330727']='浙江省金华市磐安县';
$areaArr['320205']='江苏省无锡市锡山区';
$areaArr['320206']='江苏省无锡市惠山区';
$areaArr['320211']='江苏省无锡市滨湖区';
$areaArr['320281']='江苏省无锡市江阴市';
$areaArr['320282']='江苏省无锡市宜兴市';
$areaArr['320521']='江苏省苏州市张家港市';
$areaArr['320300']='江苏省徐州市';
$areaArr['320301']='江苏省徐州市';
$areaArr['320302']='江苏省徐州市鼓楼区';
$areaArr['320303']='江苏省徐州市云龙区';
$areaArr['320304']='江苏省徐州市九里区';
$areaArr['320305']='江苏省徐州市贾汪区';
$areaArr['320311']='江苏省徐州市泉山区';
$areaArr['320321']='江苏省徐州市丰县';
$areaArr['320322']='江苏省徐州市沛县';
$areaArr['320323']='江苏省徐州市铜山县';
$areaArr['320324']='江苏省徐州市睢宁县';
$areaArr['320381']='江苏省徐州市新沂市';
$areaArr['320382']='江苏省徐州市邳州市';
$areaArr['320400']='江苏省常州市';
$areaArr['320401']='江苏省常州市';
$areaArr['320402']='江苏省常州市天宁区';
$areaArr['320404']='江苏省常州市钟楼区';
$areaArr['320405']='江苏省常州市戚墅堰区';
$areaArr['320411']='江苏省常州市新北区';
$areaArr['320412']='江苏省常州市武进区';
$areaArr['320481']='江苏省常州市溧阳市';
$areaArr['320482']='江苏省常州市金坛市';
$areaArr['320500']='江苏省苏州市';
$areaArr['320501']='江苏省苏州市';
$areaArr['320502']='江苏省苏州市沧浪区';
$areaArr['320503']='江苏省苏州市平江区';
$areaArr['320504']='江苏省苏州市金阊区';
$areaArr['320505']='江苏省苏州市虎丘区';
$areaArr['320506']='江苏省苏州市吴中区';
$areaArr['320507']='江苏省苏州市相城区';
$areaArr['320581']='江苏省苏州市常熟市';
$areaArr['320582']='江苏省苏州市张家港市';
$areaArr['320583']='江苏省苏州市昆山市';
$areaArr['320584']='江苏省苏州市吴江市';
$areaArr['320585']='江苏省苏州市太仓市';
$areaArr['320600']='江苏省南通市';
$areaArr['320601']='江苏省南通市';
$areaArr['320602']='江苏省南通市崇川区';
$areaArr['320611']='江苏省南通市港闸区';
$areaArr['320621']='江苏省南通市海安县';
$areaArr['320623']='江苏省南通市如东县';
$areaArr['320681']='江苏省南通市启东市';
$areaArr['320682']='江苏省南通市如皋市';
$areaArr['320683']='江苏省南通市通州市';
$areaArr['320684']='江苏省南通市海门市';
$areaArr['320700']='江苏省连云港市';
$areaArr['320701']='江苏省连云港市';
$areaArr['320703']='江苏省连云港市连云区';
$areaArr['320705']='江苏省连云港市新浦区';
$areaArr['320706']='江苏省连云港市海州区';
$areaArr['320721']='江苏省连云港市赣榆县';
$areaArr['320722']='江苏省连云港市东海县';
$areaArr['230603']='黑龙江省大庆市龙凤区';
$areaArr['230604']='黑龙江省大庆市让胡路区';
$areaArr['230605']='黑龙江省大庆市红岗区';
$areaArr['230606']='黑龙江省大庆市大同区';
$areaArr['220501']='吉林省通化市';
$areaArr['220502']='吉林省通化市东昌区';
$areaArr['220503']='吉林省通化市二道江区';
$areaArr['220521']='吉林省通化市通化县';
$areaArr['220523']='吉林省通化市辉南县';
$areaArr['220524']='吉林省通化市柳河县';
$areaArr['220581']='吉林省通化市梅河口市';
$areaArr['220582']='吉林省通化市集安市';
$areaArr['220600']='吉林省白山市';
$areaArr['220601']='吉林省白山市';
$areaArr['220602']='吉林省白山市八道江区';
$areaArr['220621']='吉林省白山市抚松县';
$areaArr['220622']='吉林省白山市靖宇县';
$areaArr['220623']='吉林省白山市长白朝鲜族自治县';
$areaArr['220625']='吉林省白山市江源县';
$areaArr['220681']='吉林省白山市临江市';
$areaArr['220700']='吉林省松原市';
$areaArr['220701']='吉林省松原市';
$areaArr['220702']='吉林省松原市宁江区';
$areaArr['220721']='吉林省松原市前郭尔罗斯蒙古族自治县';
$areaArr['220722']='吉林省松原市长岭县';
$areaArr['220723']='吉林省松原市乾安县';
$areaArr['220724']='吉林省松原市扶余县';
$areaArr['220800']='吉林省白城市';
$areaArr['220801']='吉林省白城市';
$areaArr['220802']='吉林省白城市洮北区';
$areaArr['220821']='吉林省白城市镇赉县';
$areaArr['220822']='吉林省白城市通榆县';
$areaArr['220881']='吉林省白城市洮南市';
$areaArr['220882']='吉林省白城市大安市';
$areaArr['222400']='吉林省延边朝鲜族自治州';
$areaArr['222401']='吉林省延边朝鲜族自治州延吉市';
$areaArr['222402']='吉林省延边朝鲜族自治州图们市';
$areaArr['222403']='吉林省延边朝鲜族自治州敦化市';
$areaArr['222404']='吉林省延边朝鲜族自治州珲春市';
$areaArr['222405']='吉林省延边朝鲜族自治州龙井市';
$areaArr['222406']='吉林省延边朝鲜族自治州和龙市';
$areaArr['222424']='吉林省延边朝鲜族自治州汪清县';
$areaArr['222426']='吉林省延边朝鲜族自治州安图县';
$areaArr['230000']='黑龙江省';
$areaArr['230100']='黑龙江省哈尔滨市';
$areaArr['230101']='黑龙江省哈尔滨市';
$areaArr['230102']='黑龙江省哈尔滨市道里区';
$areaArr['230103']='黑龙江省哈尔滨市南岗区';
$areaArr['230104']='黑龙江省哈尔滨市道外区';
$areaArr['230106']='黑龙江省哈尔滨市香坊区';
$areaArr['230107']='黑龙江省哈尔滨市动力区';
$areaArr['230108']='黑龙江省哈尔滨市平房区';
$areaArr['230109']='黑龙江省哈尔滨市松北区';
$areaArr['230111']='黑龙江省哈尔滨市呼兰区';
$areaArr['230123']='黑龙江省哈尔滨市依兰县';
$areaArr['230124']='黑龙江省哈尔滨市方正县';
$areaArr['230125']='黑龙江省哈尔滨市宾县';
$areaArr['230126']='黑龙江省哈尔滨市巴彦县';
$areaArr['230127']='黑龙江省哈尔滨市木兰县';
$areaArr['230128']='黑龙江省哈尔滨市通河县';
$areaArr['230129']='黑龙江省哈尔滨市延寿县';
$areaArr['230181']='黑龙江省哈尔滨市阿城市';
$areaArr['230182']='黑龙江省哈尔滨市双城市';
$areaArr['150622']='内蒙古自治区鄂尔多斯市准格尔旗';
$areaArr['150623']='内蒙古自治区鄂尔多斯市鄂托克前旗';
$areaArr['150624']='内蒙古自治区鄂尔多斯市鄂托克旗';
$areaArr['150625']='内蒙古自治区鄂尔多斯市杭锦旗';
$areaArr['150626']='内蒙古自治区鄂尔多斯市乌审旗';
$areaArr['150627']='内蒙古自治区鄂尔多斯市伊金霍洛旗';
$areaArr['150700']='内蒙古自治区呼伦贝尔市';
$areaArr['150701']='内蒙古自治区呼伦贝尔市';
$areaArr['150702']='内蒙古自治区呼伦贝尔市海拉尔区';
$areaArr['150721']='内蒙古自治区呼伦贝尔市阿荣旗';
$areaArr['150722']='内蒙古自治区呼伦贝尔市莫力达瓦达斡尔族自治旗';
$areaArr['150723']='内蒙古自治区呼伦贝尔市鄂伦春自治旗';
$areaArr['150724']='内蒙古自治区呼伦贝尔市鄂温克族自治旗';
$areaArr['150725']='内蒙古自治区呼伦贝尔市陈巴尔虎旗';
$areaArr['150726']='内蒙古自治区呼伦贝尔市新巴尔虎左旗';
$areaArr['150727']='内蒙古自治区呼伦贝尔市新巴尔虎右旗';
$areaArr['150781']='内蒙古自治区呼伦贝尔市满洲里市';
$areaArr['150782']='内蒙古自治区呼伦贝尔市牙克石市';
$areaArr['150783']='内蒙古自治区呼伦贝尔市扎兰屯市';
$areaArr['150784']='内蒙古自治区呼伦贝尔市额尔古纳市';
$areaArr['150785']='内蒙古自治区呼伦贝尔市根河市';
$areaArr['150800']='内蒙古自治区巴彦淖尔市';
$areaArr['150801']='内蒙古自治区巴彦淖尔市';
$areaArr['150802']='内蒙古自治区巴彦淖尔市临河区';
$areaArr['150821']='内蒙古自治区巴彦淖尔市五原县';
$areaArr['150822']='内蒙古自治区巴彦淖尔市磴口县';
$areaArr['150823']='内蒙古自治区巴彦淖尔市乌拉特前旗';
$areaArr['150824']='内蒙古自治区巴彦淖尔市乌拉特中旗';
$areaArr['150825']='内蒙古自治区巴彦淖尔市乌拉特后旗';
$areaArr['150826']='内蒙古自治区巴彦淖尔市杭锦后旗';
$areaArr['150900']='内蒙古自治区乌兰察布市';
$areaArr['150901']='内蒙古自治区乌兰察布市';
$areaArr['150902']='内蒙古自治区乌兰察布市集宁区';
$areaArr['150921']='内蒙古自治区乌兰察布市卓资县';
$areaArr['150922']='内蒙古自治区乌兰察布市化德县';
$areaArr['150923']='内蒙古自治区乌兰察布市商都县';
$areaArr['150924']='内蒙古自治区乌兰察布市兴和县';
$areaArr['150925']='内蒙古自治区乌兰察布市凉城县';
$areaArr['150926']='内蒙古自治区乌兰察布市察哈尔右翼前旗';
$areaArr['320100']='江苏省南京市';
$areaArr['320101']='江苏省南京市';
$areaArr['320102']='江苏省南京市玄武区';
$areaArr['320103']='江苏省南京市白下区';
$areaArr['320104']='江苏省南京市秦淮区';
$areaArr['320105']='江苏省南京市建邺区';
$areaArr['320106']='江苏省南京市鼓楼区';
$areaArr['320107']='江苏省南京市下关区';
$areaArr['320111']='江苏省南京市浦口区';
$areaArr['320113']='江苏省南京市栖霞区';
$areaArr['320114']='江苏省南京市雨花台区';
$areaArr['320115']='江苏省南京市江宁区';
$areaArr['320116']='江苏省南京市六合区';
$areaArr['320124']='江苏省南京市溧水县';
$areaArr['320125']='江苏省南京市高淳县';
$areaArr['320200']='江苏省无锡市';
$areaArr['320201']='江苏省无锡市';
$areaArr['320202']='江苏省无锡市崇安区';
$areaArr['320203']='江苏省无锡市南长区';
$areaArr['320204']='江苏省无锡市北塘区';
$areaArr['230621']='黑龙江省大庆市肇州县';
$areaArr['371602']='山东省滨州市滨城区';
$areaArr['371621']='山东省滨州市惠民县';
$areaArr['371622']='山东省滨州市阳信县';
$areaArr['371623']='山东省滨州市无棣县';
$areaArr['371624']='山东省滨州市沾化县';
$areaArr['371625']='山东省滨州市博兴县';
$areaArr['371626']='山东省滨州市邹平县';
$areaArr['371700']='山东省荷泽市';
$areaArr['371701']='山东省荷泽市';
$areaArr['371702']='山东省荷泽市牡丹区';
$areaArr['371721']='山东省荷泽市曹县';
$areaArr['371722']='山东省荷泽市单县';
$areaArr['371723']='山东省荷泽市成武县';
$areaArr['371724']='山东省荷泽市巨野县';
$areaArr['371725']='山东省荷泽市郓城县';
$areaArr['371726']='山东省荷泽市鄄城县';
$areaArr['371727']='山东省荷泽市定陶县';
$areaArr['371728']='山东省荷泽市东明县';
$areaArr['410000']='河南省';
$areaArr['410100']='河南省郑州市';
$areaArr['410101']='河南省郑州市';
$areaArr['410102']='河南省郑州市中原区';
$areaArr['410103']='河南省郑州市二七区';
$areaArr['410104']='河南省郑州市管城回族区';
$areaArr['410105']='河南省郑州市金水区';
$areaArr['410106']='河南省郑州市上街区';
$areaArr['410108']='河南省郑州市惠济区';
$areaArr['410122']='河南省郑州市中牟县';
$areaArr['410181']='河南省郑州市巩义市';
$areaArr['410182']='河南省郑州市荥阳市';
$areaArr['410183']='河南省郑州市新密市';
$areaArr['410184']='河南省郑州市新郑市';
$areaArr['410185']='河南省郑州市登封市';
$areaArr['410200']='河南省开封市';
$areaArr['410201']='河南省开封市';
$areaArr['410202']='河南省开封市龙亭区';
$areaArr['410203']='河南省开封市顺河回族区';
$areaArr['410204']='河南省开封市鼓楼区';
$areaArr['410205']='河南省开封市南关区';
$areaArr['410211']='河南省开封市郊区';
$areaArr['410221']='河南省开封市杞县';
$areaArr['410222']='河南省开封市通许县';
$areaArr['410223']='河南省开封市尉氏县';
$areaArr['410224']='河南省开封市开封县';
$areaArr['410225']='河南省开封市兰考县';
$areaArr['410300']='河南省洛阳市';
$areaArr['410301']='河南省洛阳市';
$areaArr['410302']='河南省洛阳市老城区';
$areaArr['410303']='河南省洛阳市西工区';
$areaArr['410304']='河南省洛阳市廛河回族区';
$areaArr['410305']='河南省洛阳市涧西区';
$areaArr['410306']='河南省洛阳市吉利区';
$areaArr['410307']='河南省洛阳市洛龙区';
$areaArr['410322']='河南省洛阳市孟津县';
$areaArr['410323']='河南省洛阳市新安县';
$areaArr['410324']='河南省洛阳市栾川县';
$areaArr['410325']='河南省洛阳市嵩县';
$areaArr['410326']='河南省洛阳市汝阳县';
$areaArr['410327']='河南省洛阳市宜阳县';
$areaArr['410328']='河南省洛阳市洛宁县';
$areaArr['341181']='安徽省滁州市天长市';
$areaArr['341182']='安徽省滁州市明光市';
$areaArr['370900']='山东省泰安市';
$areaArr['370901']='山东省泰安市';
$areaArr['370902']='山东省泰安市泰山区';
$areaArr['370903']='山东省泰安市岱岳区';
$areaArr['370921']='山东省泰安市宁阳县';
$areaArr['370923']='山东省泰安市东平县';
$areaArr['370982']='山东省泰安市新泰市';
$areaArr['370983']='山东省泰安市肥城市';
$areaArr['371000']='山东省威海市';
$areaArr['371001']='山东省威海市';
$areaArr['371002']='山东省威海市环翠区';
$areaArr['371081']='山东省威海市文登市';
$areaArr['371082']='山东省威海市荣成市';
$areaArr['371083']='山东省威海市乳山市';
$areaArr['371100']='山东省日照市';
$areaArr['371101']='山东省日照市';
$areaArr['371102']='山东省日照市东港区';
$areaArr['371103']='山东省日照市岚山区';
$areaArr['371121']='山东省日照市五莲县';
$areaArr['371122']='山东省日照市莒县';
$areaArr['371200']='山东省莱芜市';
$areaArr['371201']='山东省莱芜市';
$areaArr['371202']='山东省莱芜市莱城区';
$areaArr['371203']='山东省莱芜市钢城区';
$areaArr['371300']='山东省临沂市';
$areaArr['371301']='山东省临沂市';
$areaArr['371302']='山东省临沂市兰山区';
$areaArr['371311']='山东省临沂市罗庄区';
$areaArr['371312']='山东省临沂市河东区';
$areaArr['371321']='山东省临沂市沂南县';
$areaArr['371322']='山东省临沂市郯城县';
$areaArr['371323']='山东省临沂市沂水县';
$areaArr['371324']='山东省临沂市苍山县';
$areaArr['371325']='山东省临沂市费县';
$areaArr['371326']='山东省临沂市平邑县';
$areaArr['371327']='山东省临沂市莒南县';
$areaArr['371328']='山东省临沂市蒙阴县';
$areaArr['371329']='山东省临沂市临沭县';
$areaArr['371400']='山东省德州市';
$areaArr['371401']='山东省德州市';
$areaArr['371402']='山东省德州市德城区';
$areaArr['371421']='山东省德州市陵县';
$areaArr['371422']='山东省德州市宁津县';
$areaArr['371423']='山东省德州市庆云县';
$areaArr['371424']='山东省德州市临邑县';
$areaArr['371425']='山东省德州市齐河县';
$areaArr['371426']='山东省德州市平原县';
$areaArr['371427']='山东省德州市夏津县';
$areaArr['371428']='山东省德州市武城县';
$areaArr['371481']='山东省德州市乐陵市';
$areaArr['371482']='山东省德州市禹城市';
$areaArr['371500']='山东省聊城市';
$areaArr['371501']='山东省聊城市';
$areaArr['371502']='山东省聊城市东昌府区';
$areaArr['371521']='山东省聊城市阳谷县';
$areaArr['371522']='山东省聊城市莘县';
$areaArr['371523']='山东省聊城市茌平县';
$areaArr['371524']='山东省聊城市东阿县';
$areaArr['371525']='山东省聊城市冠县';
$areaArr['371526']='山东省聊城市高唐县';
$areaArr['371581']='山东省聊城市临清市';
$areaArr['421123']='湖北省黄冈市罗田县';
$areaArr['371601']='山东省滨州市';
$areaArr['350629']='福建省漳州市华安县';
$areaArr['350681']='福建省漳州市龙海市';
$areaArr['350700']='福建省南平市';
$areaArr['350701']='福建省南平市';
$areaArr['350702']='福建省南平市延平区';
$areaArr['350721']='福建省南平市顺昌县';
$areaArr['350722']='福建省南平市浦城县';
$areaArr['350723']='福建省南平市光泽县';
$areaArr['350724']='福建省南平市松溪县';
$areaArr['350725']='福建省南平市政和县';
$areaArr['350781']='福建省南平市邵武市';
$areaArr['350782']='福建省南平市武夷山市';
$areaArr['350783']='福建省南平市建瓯市';
$areaArr['350784']='福建省南平市建阳市';
$areaArr['350800']='福建省龙岩市';
$areaArr['350801']='福建省龙岩市';
$areaArr['350802']='福建省龙岩市新罗区';
$areaArr['350821']='福建省龙岩市长汀县';
$areaArr['350822']='福建省龙岩市永定县';
$areaArr['350823']='福建省龙岩市上杭县';
$areaArr['350824']='福建省龙岩市武平县';
$areaArr['350825']='福建省龙岩市连城县';
$areaArr['350881']='福建省龙岩市漳平市';
$areaArr['350900']='福建省宁德市';
$areaArr['350901']='福建省宁德市';
$areaArr['350902']='福建省宁德市蕉城区';
$areaArr['350921']='福建省宁德市霞浦县';
$areaArr['350922']='福建省宁德市古田县';
$areaArr['350923']='福建省宁德市屏南县';
$areaArr['350924']='福建省宁德市寿宁县';
$areaArr['350925']='福建省宁德市周宁县';
$areaArr['350926']='福建省宁德市柘荣县';
$areaArr['350981']='福建省宁德市福安市';
$areaArr['350982']='福建省宁德市福鼎市';
$areaArr['360000']='江西省';
$areaArr['360100']='江西省南昌市';
$areaArr['360101']='江西省南昌市';
$areaArr['360102']='江西省南昌市东湖区';
$areaArr['360103']='江西省南昌市西湖区';
$areaArr['360104']='江西省南昌市青云谱区';
$areaArr['360105']='江西省南昌市湾里区';
$areaArr['360111']='江西省南昌市青山湖区';
$areaArr['360121']='江西省南昌市南昌县';
$areaArr['360122']='江西省南昌市新建县';
$areaArr['360123']='江西省南昌市安义县';
$areaArr['360124']='江西省南昌市进贤县';
$areaArr['360200']='江西省景德镇市';
$areaArr['360201']='江西省景德镇市';
$areaArr['360202']='江西省景德镇市昌江区';
$areaArr['360203']='江西省景德镇市珠山区';
$areaArr['360222']='江西省景德镇市浮梁县';
$areaArr['360281']='江西省景德镇市乐平市';
$areaArr['360300']='江西省萍乡市';
$areaArr['360301']='江西省萍乡市';
$areaArr['360302']='江西省萍乡市安源区';
$areaArr['360313']='江西省萍乡市湘东区';
$areaArr['360321']='江西省萍乡市莲花县';
$areaArr['360322']='江西省萍乡市上栗县';
$areaArr['360323']='江西省萍乡市芦溪县';
$areaArr['360400']='江西省九江市';
$areaArr['360401']='江西省九江市';
$areaArr['360402']='江西省九江市庐山区';
$areaArr['360421']='江西省九江市九江县';
$areaArr['370303']='山东省淄博市张店区';
$areaArr['370304']='山东省淄博市博山区';
$areaArr['370305']='山东省淄博市临淄区';
$areaArr['370306']='山东省淄博市周村区';
$areaArr['370321']='山东省淄博市桓台县';
$areaArr['370322']='山东省淄博市高青县';
$areaArr['370323']='山东省淄博市沂源县';
$areaArr['370400']='山东省枣庄市';
$areaArr['370401']='山东省枣庄市';
$areaArr['370402']='山东省枣庄市市中区';
$areaArr['370403']='山东省枣庄市薛城区';
$areaArr['370404']='山东省枣庄市峄城区';
$areaArr['370405']='山东省枣庄市台儿庄区';
$areaArr['370406']='山东省枣庄市山亭区';
$areaArr['370481']='山东省枣庄市滕州市';
$areaArr['370500']='山东省东营市';
$areaArr['370501']='山东省东营市';
$areaArr['370502']='山东省东营市东营区';
$areaArr['370503']='山东省东营市河口区';
$areaArr['370521']='山东省东营市垦利县';
$areaArr['370522']='山东省东营市利津县';
$areaArr['370523']='山东省东营市广饶县';
$areaArr['370600']='山东省烟台市';
$areaArr['370601']='山东省烟台市';
$areaArr['370602']='山东省烟台市芝罘区';
$areaArr['370611']='山东省烟台市福山区';
$areaArr['370612']='山东省烟台市牟平区';
$areaArr['370613']='山东省烟台市莱山区';
$areaArr['370634']='山东省烟台市长岛县';
$areaArr['370681']='山东省烟台市龙口市';
$areaArr['370682']='山东省烟台市莱阳市';
$areaArr['370683']='山东省烟台市莱州市';
$areaArr['370684']='山东省烟台市蓬莱市';
$areaArr['370685']='山东省烟台市招远市';
$areaArr['370686']='山东省烟台市栖霞市';
$areaArr['370687']='山东省烟台市海阳市';
$areaArr['370700']='山东省潍坊市';
$areaArr['370701']='山东省潍坊市';
$areaArr['370702']='山东省潍坊市潍城区';
$areaArr['370703']='山东省潍坊市寒亭区';
$areaArr['370704']='山东省潍坊市坊子区';
$areaArr['370705']='山东省潍坊市奎文区';
$areaArr['370724']='山东省潍坊市临朐县';
$areaArr['370725']='山东省潍坊市昌乐县';
$areaArr['370781']='山东省潍坊市青州市';
$areaArr['370782']='山东省潍坊市诸城市';
$areaArr['370783']='山东省潍坊市寿光市';
$areaArr['370784']='山东省潍坊市安丘市';
$areaArr['370785']='山东省潍坊市高密市';
$areaArr['370786']='山东省潍坊市昌邑市';
$areaArr['370800']='山东省济宁市';
$areaArr['370801']='山东省济宁市';
$areaArr['370802']='山东省济宁市市中区';
$areaArr['370811']='山东省济宁市任城区';
$areaArr['211202']='辽宁省铁岭市银州区';
$areaArr['211204']='辽宁省铁岭市清河区';
$areaArr['141182']='山西省吕梁市汾阳市';
$areaArr['152523']='内蒙古自治区锡林郭勒盟苏尼特左旗';
$areaArr['152524']='内蒙古自治区锡林郭勒盟苏尼特右旗';
$areaArr['152525']='内蒙古自治区锡林郭勒盟东乌珠穆沁旗';
$areaArr['152526']='内蒙古自治区锡林郭勒盟西乌珠穆沁旗';
$areaArr['152527']='内蒙古自治区锡林郭勒盟太仆寺旗';
$areaArr['152528']='内蒙古自治区锡林郭勒盟镶黄旗';
$areaArr['152529']='内蒙古自治区锡林郭勒盟正镶白旗';
$areaArr['152530']='内蒙古自治区锡林郭勒盟正蓝旗';
$areaArr['152531']='内蒙古自治区锡林郭勒盟多伦县';
$areaArr['152900']='内蒙古自治区阿拉善盟';
$areaArr['152921']='内蒙古自治区阿拉善盟阿拉善左旗';
$areaArr['152922']='内蒙古自治区阿拉善盟阿拉善右旗';
$areaArr['152923']='内蒙古自治区阿拉善盟额济纳旗';
$areaArr['210000']='辽宁省';
$areaArr['210100']='辽宁省沈阳市';
$areaArr['210101']='辽宁省沈阳市';
$areaArr['210102']='辽宁省沈阳市和平区';
$areaArr['210103']='辽宁省沈阳市沈河区';
$areaArr['210104']='辽宁省沈阳市大东区';
$areaArr['210105']='辽宁省沈阳市皇姑区';
$areaArr['210106']='辽宁省沈阳市铁西区';
$areaArr['210111']='辽宁省沈阳市苏家屯区';
$areaArr['210112']='辽宁省沈阳市东陵区';
$areaArr['210113']='辽宁省沈阳市新城子区';
$areaArr['210114']='辽宁省沈阳市于洪区';
$areaArr['210122']='辽宁省沈阳市辽中县';
$areaArr['210123']='辽宁省沈阳市康平县';
$areaArr['210124']='辽宁省沈阳市法库县';
$areaArr['210181']='辽宁省沈阳市新民市';
$areaArr['210200']='辽宁省大连市';
$areaArr['210201']='辽宁省大连市';
$areaArr['210202']='辽宁省大连市中山区';
$areaArr['210203']='辽宁省大连市西岗区';
$areaArr['210204']='辽宁省大连市沙河口区';
$areaArr['210211']='辽宁省大连市甘井子区';
$areaArr['210212']='辽宁省大连市旅顺口区';
$areaArr['210213']='辽宁省大连市金州区';
$areaArr['210224']='辽宁省大连市长海县';
$areaArr['210281']='辽宁省大连市瓦房店市';
$areaArr['210282']='辽宁省大连市普兰店市';
$areaArr['210283']='辽宁省大连市庄河市';
$areaArr['210300']='辽宁省鞍山市';
$areaArr['210301']='辽宁省鞍山市';
$areaArr['210302']='辽宁省鞍山市铁东区';
$areaArr['210303']='辽宁省鞍山市铁西区';
$areaArr['210304']='辽宁省鞍山市立山区';
$areaArr['210311']='辽宁省鞍山市千山区';
$areaArr['210321']='辽宁省鞍山市台安县';
$areaArr['210323']='辽宁省鞍山市岫岩满族自治县';
$areaArr['210381']='辽宁省鞍山市海城市';
$areaArr['210400']='辽宁省抚顺市';
$areaArr['210401']='辽宁省抚顺市';
$areaArr['210402']='辽宁省抚顺市新抚区';
$areaArr['210403']='辽宁省抚顺市东洲区';
$areaArr['210404']='辽宁省抚顺市望花区';
$areaArr['210411']='辽宁省抚顺市顺城区';
$areaArr['210421']='辽宁省抚顺市抚顺县';
$areaArr['210422']='辽宁省抚顺市新宾满族自治县';
$areaArr['210423']='辽宁省抚顺市清原满族自治县';
$areaArr['320803']='江苏省淮安市楚州区';
$areaArr['320804']='江苏省淮安市淮阴区';
$areaArr['320811']='江苏省淮安市清浦区';
$areaArr['320826']='江苏省淮安市涟水县';
$areaArr['320829']='江苏省淮安市洪泽县';
$areaArr['320830']='江苏省淮安市盱眙县';
$areaArr['320831']='江苏省淮安市金湖县';
$areaArr['320900']='江苏省盐城市';
$areaArr['320901']='江苏省盐城市';
$areaArr['320902']='江苏省盐城市亭湖区';
$areaArr['320903']='江苏省盐城市盐都区';
$areaArr['320921']='江苏省盐城市响水县';
$areaArr['320922']='江苏省盐城市滨海县';
$areaArr['320923']='江苏省盐城市阜宁县';
$areaArr['320924']='江苏省盐城市射阳县';
$areaArr['320925']='江苏省盐城市建湖县';
$areaArr['320981']='江苏省盐城市东台市';
$areaArr['320982']='江苏省盐城市大丰市';
$areaArr['321000']='江苏省扬州市';
$areaArr['321001']='江苏省扬州市';
$areaArr['321002']='江苏省扬州市广陵区';
$areaArr['321003']='江苏省扬州市邗江区';
$areaArr['321011']='江苏省扬州市郊区';
$areaArr['321023']='江苏省扬州市宝应县';
$areaArr['321081']='江苏省扬州市仪征市';
$areaArr['321084']='江苏省扬州市高邮市';
$areaArr['321088']='江苏省扬州市江都市';
$areaArr['321100']='江苏省镇江市';
$areaArr['321101']='江苏省镇江市';
$areaArr['321102']='江苏省镇江市京口区';
$areaArr['321111']='江苏省镇江市润州区';
$areaArr['321112']='江苏省镇江市丹徒区';
$areaArr['321181']='江苏省镇江市丹阳市';
$areaArr['321182']='江苏省镇江市扬中市';
$areaArr['321183']='江苏省镇江市句容市';
$areaArr['321200']='江苏省泰州市';
$areaArr['321201']='江苏省泰州市';
$areaArr['321202']='江苏省泰州市海陵区';
$areaArr['321203']='江苏省泰州市高港区';
$areaArr['321281']='江苏省泰州市兴化市';
$areaArr['321282']='江苏省泰州市靖江市';
$areaArr['321283']='江苏省泰州市泰兴市';
$areaArr['321284']='江苏省泰州市姜堰市';
$areaArr['341621']='安徽省亳州市涡阳县';
$areaArr['341622']='安徽省亳州市蒙城县';
$areaArr['341623']='安徽省亳州市利辛县';
$areaArr['341700']='安徽省池州市';
$areaArr['341701']='安徽省池州市';
$areaArr['341702']='安徽省池州市贵池区';
$areaArr['341721']='安徽省池州市东至县';
$areaArr['341722']='安徽省池州市石台县';
$areaArr['341723']='安徽省池州市青阳县';
$areaArr['341800']='安徽省宣城市';
$areaArr['341801']='安徽省宣城市';
$areaArr['341802']='安徽省宣城市宣州区';
$areaArr['341821']='安徽省宣城市郎溪县';
$areaArr['341822']='安徽省宣城市广德县';
$areaArr['341823']='安徽省宣城市泾县';
$areaArr['341824']='安徽省宣城市绩溪县';
$areaArr['341825']='安徽省宣城市旌德县';
$areaArr['341881']='安徽省宣城市宁国市';
$areaArr['350000']='福建省';
$areaArr['350100']='福建省福州市';
$areaArr['350101']='福建省福州市';
$areaArr['350102']='福建省福州市鼓楼区';
$areaArr['350103']='福建省福州市台江区';
$areaArr['350104']='福建省福州市仓山区';
$areaArr['350105']='福建省福州市马尾区';
$areaArr['370882']='山东省济宁市兖州市';
$areaArr['350628']='福建省漳州市平和县';
$areaArr['360926']='江西省宜春市铜鼓县';
$areaArr['360981']='江西省宜春市丰城市';
$areaArr['360982']='江西省宜春市樟树市';
$areaArr['360983']='江西省宜春市高安市';
$areaArr['361000']='江西省抚州市';
$areaArr['361001']='江西省抚州市';
$areaArr['361002']='江西省抚州市临川区';
$areaArr['361021']='江西省抚州市南城县';
$areaArr['361022']='江西省抚州市黎川县';
$areaArr['361023']='江西省抚州市南丰县';
$areaArr['361024']='江西省抚州市崇仁县';
$areaArr['361025']='江西省抚州市乐安县';
$areaArr['361026']='江西省抚州市宜黄县';
$areaArr['361027']='江西省抚州市金溪县';
$areaArr['361028']='江西省抚州市资溪县';
$areaArr['361029']='江西省抚州市东乡县';
$areaArr['361030']='江西省抚州市广昌县';
$areaArr['361100']='江西省上饶市';
$areaArr['361101']='江西省上饶市';
$areaArr['361102']='江西省上饶市信州区';
$areaArr['361121']='江西省上饶市上饶县';
$areaArr['361122']='江西省上饶市广丰县';
$areaArr['361123']='江西省上饶市玉山县';
$areaArr['361124']='江西省上饶市铅山县';
$areaArr['361125']='江西省上饶市横峰县';
$areaArr['361126']='江西省上饶市弋阳县';
$areaArr['361127']='江西省上饶市余干县';
$areaArr['361128']='江西省上饶市鄱阳县';
$areaArr['361129']='江西省上饶市万年县';
$areaArr['361130']='江西省上饶市婺源县';
$areaArr['361181']='江西省上饶市德兴市';
$areaArr['370000']='山东省';
$areaArr['370100']='山东省济南市';
$areaArr['370101']='山东省济南市';
$areaArr['370102']='山东省济南市历下区';
$areaArr['370103']='山东省济南市市中区';
$areaArr['370104']='山东省济南市槐荫区';
$areaArr['370105']='山东省济南市天桥区';
$areaArr['370112']='山东省济南市历城区';
$areaArr['370113']='山东省济南市长清区';
$areaArr['370124']='山东省济南市平阴县';
$areaArr['370125']='山东省济南市济阳县';
$areaArr['370126']='山东省济南市商河县';
$areaArr['370181']='山东省济南市章丘市';
$areaArr['370200']='山东省青岛市';
$areaArr['370201']='山东省青岛市';
$areaArr['370202']='山东省青岛市市南区';
$areaArr['370203']='山东省青岛市市北区';
$areaArr['370205']='山东省青岛市四方区';
$areaArr['370211']='山东省青岛市黄岛区';
$areaArr['370212']='山东省青岛市崂山区';
$areaArr['370213']='山东省青岛市李沧区';
$areaArr['370214']='山东省青岛市城阳区';
$areaArr['370281']='山东省青岛市胶州市';
$areaArr['370282']='山东省青岛市即墨市';
$areaArr['370283']='山东省青岛市平度市';
$areaArr['370284']='山东省青岛市胶南市';
$areaArr['370285']='山东省青岛市莱西市';
$areaArr['370300']='山东省淄博市';
$areaArr['370301']='山东省淄博市';
$areaArr['370302']='山东省淄博市淄川区';
$areaArr['370883']='山东省济宁市邹城市';
$areaArr['360423']='江西省九江市武宁县';
$areaArr['360424']='江西省九江市修水县';
$areaArr['360425']='江西省九江市永修县';
$areaArr['360426']='江西省九江市德安县';
$areaArr['360427']='江西省九江市星子县';
$areaArr['360428']='江西省九江市都昌县';
$areaArr['360429']='江西省九江市湖口县';
$areaArr['360430']='江西省九江市彭泽县';
$areaArr['360481']='江西省九江市瑞昌市';
$areaArr['360500']='江西省新余市';
$areaArr['360501']='江西省新余市';
$areaArr['360502']='江西省新余市渝水区';
$areaArr['360521']='江西省新余市分宜县';
$areaArr['360600']='江西省鹰潭市';
$areaArr['360601']='江西省鹰潭市';
$areaArr['360602']='江西省鹰潭市月湖区';
$areaArr['360622']='江西省鹰潭市余江县';
$areaArr['360681']='江西省鹰潭市贵溪市';
$areaArr['360700']='江西省赣州市';
$areaArr['360701']='江西省赣州市';
$areaArr['360702']='江西省赣州市章贡区';
$areaArr['360721']='江西省赣州市赣县';
$areaArr['360722']='江西省赣州市信丰县';
$areaArr['360723']='江西省赣州市大余县';
$areaArr['360724']='江西省赣州市上犹县';
$areaArr['360725']='江西省赣州市崇义县';
$areaArr['360726']='江西省赣州市安远县';
$areaArr['360727']='江西省赣州市龙南县';
$areaArr['360728']='江西省赣州市定南县';
$areaArr['360729']='江西省赣州市全南县';
$areaArr['360730']='江西省赣州市宁都县';
$areaArr['360731']='江西省赣州市于都县';
$areaArr['360732']='江西省赣州市兴国县';
$areaArr['360733']='江西省赣州市会昌县';
$areaArr['360734']='江西省赣州市寻乌县';
$areaArr['360735']='江西省赣州市石城县';
$areaArr['360781']='江西省赣州市瑞金市';
$areaArr['360782']='江西省赣州市南康市';
$areaArr['360800']='江西省吉安市';
$areaArr['360801']='江西省吉安市';
$areaArr['360802']='江西省吉安市吉州区';
$areaArr['360803']='江西省吉安市青原区';
$areaArr['360821']='江西省吉安市吉安县';
$areaArr['360822']='江西省吉安市吉水县';
$areaArr['360823']='江西省吉安市峡江县';
$areaArr['360824']='江西省吉安市新干县';
$areaArr['360825']='江西省吉安市永丰县';
$areaArr['360826']='江西省吉安市泰和县';
$areaArr['360827']='江西省吉安市遂川县';
$areaArr['360828']='江西省吉安市万安县';
$areaArr['360829']='江西省吉安市安福县';
$areaArr['360830']='江西省吉安市永新县';
$areaArr['360881']='江西省吉安市井冈山市';
$areaArr['360900']='江西省宜春市';
$areaArr['360901']='江西省宜春市';
$areaArr['360902']='江西省宜春市袁州区';
$areaArr['360921']='江西省宜春市奉新县';
$areaArr['360922']='江西省宜春市万载县';
$areaArr['360923']='江西省宜春市上高县';
$areaArr['360924']='江西省宜春市宜丰县';
$areaArr['371600']='山东省滨州市';
$areaArr['360925']='江西省宜春市靖安县';
$areaArr['410926']='河南省濮阳市范县';
$areaArr['420503']='湖北省宜昌市伍家岗区';
$areaArr['420504']='湖北省宜昌市点军区';
$areaArr['420505']='湖北省宜昌市猇亭区';
$areaArr['420506']='湖北省宜昌市夷陵区';
$areaArr['420525']='湖北省宜昌市远安县';
$areaArr['420526']='湖北省宜昌市兴山县';
$areaArr['420527']='湖北省宜昌市秭归县';
$areaArr['420528']='湖北省宜昌市长阳土家族自治县';
$areaArr['420529']='湖北省宜昌市五峰土家族自治县';
$areaArr['420581']='湖北省宜昌市宜都市';
$areaArr['420582']='湖北省宜昌市当阳市';
$areaArr['420583']='湖北省宜昌市枝江市';
$areaArr['420600']='湖北省襄樊市';
$areaArr['420601']='湖北省襄樊市';
$areaArr['420602']='湖北省襄樊市襄城区';
$areaArr['420606']='湖北省襄樊市樊城区';
$areaArr['420607']='湖北省襄樊市襄阳区';
$areaArr['420624']='湖北省襄樊市南漳县';
$areaArr['420625']='湖北省襄樊市谷城县';
$areaArr['420626']='湖北省襄樊市保康县';
$areaArr['420682']='湖北省襄樊市老河口市';
$areaArr['420683']='湖北省襄樊市枣阳市';
$areaArr['420684']='湖北省襄樊市宜城市';
$areaArr['420700']='湖北省鄂州市';
$areaArr['420701']='湖北省鄂州市';
$areaArr['420702']='湖北省鄂州市梁子湖区';
$areaArr['420703']='湖北省鄂州市华容区';
$areaArr['420704']='湖北省鄂州市鄂城区';
$areaArr['420800']='湖北省荆门市';
$areaArr['420801']='湖北省荆门市';
$areaArr['420802']='湖北省荆门市东宝区';
$areaArr['420804']='湖北省荆门市掇刀区';
$areaArr['420821']='湖北省荆门市京山县';
$areaArr['420822']='湖北省荆门市沙洋县';
$areaArr['420881']='湖北省荆门市钟祥市';
$areaArr['420900']='湖北省孝感市';
$areaArr['420901']='湖北省孝感市';
$areaArr['420902']='湖北省孝感市孝南区';
$areaArr['420921']='湖北省孝感市孝昌县';
$areaArr['420922']='湖北省孝感市大悟县';
$areaArr['420923']='湖北省孝感市云梦县';
$areaArr['420981']='湖北省孝感市应城市';
$areaArr['420982']='湖北省孝感市安陆市';
$areaArr['420984']='湖北省孝感市汉川市';
$areaArr['421000']='湖北省荆州市';
$areaArr['421001']='湖北省荆州市';
$areaArr['421002']='湖北省荆州市沙市区';
$areaArr['421003']='湖北省荆州市荆州区';
$areaArr['421022']='湖北省荆州市公安县';
$areaArr['421023']='湖北省荆州市监利县';
$areaArr['421024']='湖北省荆州市江陵县';
$areaArr['421081']='湖北省荆州市石首市';
$areaArr['421083']='湖北省荆州市洪湖市';
$areaArr['421087']='湖北省荆州市松滋市';
$areaArr['421100']='湖北省黄冈市';
$areaArr['421101']='湖北省黄冈市';
$areaArr['421102']='湖北省黄冈市黄州区';
$areaArr['421121']='湖北省黄冈市团风县';
$areaArr['421122']='湖北省黄冈市红安县';
$areaArr['430381']='湖南省湘潭市湘乡市';
$areaArr['430922']='湖南省益阳市桃江县';
$areaArr['430923']='湖南省益阳市安化县';
$areaArr['430401']='湖南省衡阳市';
$areaArr['430405']='湖南省衡阳市珠晖区';
$areaArr['430406']='湖南省衡阳市雁峰区';
$areaArr['430407']='湖南省衡阳市石鼓区';
$areaArr['430408']='湖南省衡阳市蒸湘区';
$areaArr['430412']='湖南省衡阳市南岳区';
$areaArr['430421']='湖南省衡阳市衡阳县';
$areaArr['430422']='湖南省衡阳市衡南县';
$areaArr['430423']='湖南省衡阳市衡山县';
$areaArr['430424']='湖南省衡阳市衡东县';
$areaArr['430426']='湖南省衡阳市祁东县';
$areaArr['430481']='湖南省衡阳市耒阳市';
$areaArr['430482']='湖南省衡阳市常宁市';
$areaArr['430500']='湖南省邵阳市';
$areaArr['430501']='湖南省邵阳市';
$areaArr['430502']='湖南省邵阳市双清区';
$areaArr['430503']='湖南省邵阳市大祥区';
$areaArr['430511']='湖南省邵阳市北塔区';
$areaArr['430521']='湖南省邵阳市邵东县';
$areaArr['430522']='湖南省邵阳市新邵县';
$areaArr['430523']='湖南省邵阳市邵阳县';
$areaArr['430524']='湖南省邵阳市隆回县';
$areaArr['430525']='湖南省邵阳市洞口县';
$areaArr['430527']='湖南省邵阳市绥宁县';
$areaArr['430528']='湖南省邵阳市新宁县';
$areaArr['430529']='湖南省邵阳市城步苗族自治县';
$areaArr['430581']='湖南省邵阳市武冈市';
$areaArr['430600']='湖南省岳阳市';
$areaArr['430601']='湖南省岳阳市';
$areaArr['430602']='湖南省岳阳市岳阳楼区';
$areaArr['430603']='湖南省岳阳市云溪区';
$areaArr['430611']='湖南省岳阳市君山区';
$areaArr['430621']='湖南省岳阳市岳阳县';
$areaArr['430623']='湖南省岳阳市华容县';
$areaArr['430624']='湖南省岳阳市湘阴县';
$areaArr['430626']='湖南省岳阳市平江县';
$areaArr['430681']='湖南省岳阳市汨罗市';
$areaArr['430682']='湖南省岳阳市临湘市';
$areaArr['430700']='湖南省常德市';
$areaArr['430701']='湖南省常德市';
$areaArr['430702']='湖南省常德市武陵区';
$areaArr['430703']='湖南省常德市鼎城区';
$areaArr['430721']='湖南省常德市安乡县';
$areaArr['430722']='湖南省常德市汉寿县';
$areaArr['430723']='湖南省常德市澧县';
$areaArr['430724']='湖南省常德市临澧县';
$areaArr['430725']='湖南省常德市桃源县';
$areaArr['430726']='湖南省常德市石门县';
$areaArr['430781']='湖南省常德市津市市';
$areaArr['430800']='湖南省张家界市';
$areaArr['320723']='江苏省连云港市灌云县';
$areaArr['320724']='江苏省连云港市灌南县';
$areaArr['320800']='江苏省淮安市';
$areaArr['320801']='江苏省淮安市';
$areaArr['330781']='浙江省金华市兰溪市';
$areaArr['230622']='黑龙江省大庆市肇源县';
$areaArr['230623']='黑龙江省大庆市林甸县';
$areaArr['230624']='黑龙江省大庆市杜尔伯特蒙古族自治县';
$areaArr['230700']='黑龙江省伊春市';
$areaArr['230701']='黑龙江省伊春市';
$areaArr['230702']='黑龙江省伊春市伊春区';
$areaArr['230703']='黑龙江省伊春市南岔区';
$areaArr['230704']='黑龙江省伊春市友好区';
$areaArr['230705']='黑龙江省伊春市西林区';
$areaArr['230706']='黑龙江省伊春市翠峦区';
$areaArr['230707']='黑龙江省伊春市新青区';
$areaArr['230708']='黑龙江省伊春市美溪区';
$areaArr['230709']='黑龙江省伊春市金山屯区';
$areaArr['230710']='黑龙江省伊春市五营区';
$areaArr['230711']='黑龙江省伊春市乌马河区';
$areaArr['230712']='黑龙江省伊春市汤旺河区';
$areaArr['230713']='黑龙江省伊春市带岭区';
$areaArr['230714']='黑龙江省伊春市乌伊岭区';
$areaArr['230715']='黑龙江省伊春市红星区';
$areaArr['230716']='黑龙江省伊春市上甘岭区';
$areaArr['230722']='黑龙江省伊春市嘉荫县';
$areaArr['230781']='黑龙江省伊春市铁力市';
$areaArr['230800']='黑龙江省佳木斯市';
$areaArr['230801']='黑龙江省佳木斯市';
$areaArr['230802']='黑龙江省佳木斯市永红区';
$areaArr['230803']='黑龙江省佳木斯市向阳区';
$areaArr['230804']='黑龙江省佳木斯市前进区';
$areaArr['230805']='黑龙江省佳木斯市东风区';
$areaArr['230811']='黑龙江省佳木斯市郊区';
$areaArr['230822']='黑龙江省佳木斯市桦南县';
$areaArr['230826']='黑龙江省佳木斯市桦川县';
$areaArr['230828']='黑龙江省佳木斯市汤原县';
$areaArr['230833']='黑龙江省佳木斯市抚远县';
$areaArr['230881']='黑龙江省佳木斯市同江市';
$areaArr['230882']='黑龙江省佳木斯市富锦市';
$areaArr['230900']='黑龙江省七台河市';
$areaArr['230901']='黑龙江省七台河市';
$areaArr['230902']='黑龙江省七台河市新兴区';
$areaArr['230903']='黑龙江省七台河市桃山区';
$areaArr['230904']='黑龙江省七台河市茄子河区';
$areaArr['230921']='黑龙江省七台河市勃利县';
$areaArr['231000']='黑龙江省牡丹江市';
$areaArr['231001']='黑龙江省牡丹江市';
$areaArr['231002']='黑龙江省牡丹江市东安区';
$areaArr['231003']='黑龙江省牡丹江市阳明区';
$areaArr['231004']='黑龙江省牡丹江市爱民区';
$areaArr['231005']='黑龙江省牡丹江市西安区';
$areaArr['231024']='黑龙江省牡丹江市东宁县';
$areaArr['231025']='黑龙江省牡丹江市林口县';
$areaArr['231081']='黑龙江省牡丹江市绥芬河市';
$areaArr['231083']='黑龙江省牡丹江市海林市';
$areaArr['231084']='黑龙江省牡丹江市宁安市';
$areaArr['231085']='黑龙江省牡丹江市穆棱市';
$areaArr['231100']='黑龙江省黑河市';
$areaArr['231101']='黑龙江省黑河市';
$areaArr['231102']='黑龙江省黑河市爱辉区';
$areaArr['231121']='黑龙江省黑河市嫩江县';
$areaArr['360403']='江西省九江市浔阳区';
$areaArr['231124']='黑龙江省黑河市孙吴县';
$areaArr['231181']='黑龙江省黑河市北安市';
$areaArr['231182']='黑龙江省黑河市五大连池市';
$areaArr['231200']='黑龙江省绥化市';
$areaArr['231201']='黑龙江省绥化市';
$areaArr['231202']='黑龙江省绥化市北林区';
$areaArr['231221']='黑龙江省绥化市望奎县';
$areaArr['231222']='黑龙江省绥化市兰西县';
$areaArr['231223']='黑龙江省绥化市青冈县';
$areaArr['231224']='黑龙江省绥化市庆安县';
$areaArr['231225']='黑龙江省绥化市明水县';
$areaArr['231226']='黑龙江省绥化市绥棱县';
$areaArr['231281']='黑龙江省绥化市安达市';
$areaArr['231282']='黑龙江省绥化市肇东市';
$areaArr['231283']='黑龙江省绥化市海伦市';
$areaArr['232700']='黑龙江省大兴安岭地区';
$areaArr['232721']='黑龙江省大兴安岭地区呼玛县';
$areaArr['232722']='黑龙江省大兴安岭地区塔河县';
$areaArr['232723']='黑龙江省大兴安岭地区漠河县';
$areaArr['310000']='上海市';
$areaArr['310100']='上海市';
$areaArr['310101']='上海市黄浦区';
$areaArr['310103']='上海市卢湾区';
$areaArr['310104']='上海市徐汇区';
$areaArr['310105']='上海市长宁区';
$areaArr['310106']='上海市静安区';
$areaArr['310107']='上海市普陀区';
$areaArr['310108']='上海市闸北区';
$areaArr['310109']='上海市虹口区';
$areaArr['310110']='上海市杨浦区';
$areaArr['310112']='上海市闵行区';
$areaArr['310113']='上海市宝山区';
$areaArr['310114']='上海市嘉定区';
$areaArr['310115']='上海市浦东新区';
$areaArr['310116']='上海市金山区';
$areaArr['310117']='上海市松江区';
$areaArr['310118']='上海市青浦区';
$areaArr['310119']='上海市南汇区';
$areaArr['310120']='上海市奉贤区';
$areaArr['310200']='上海市';
$areaArr['310230']='上海市崇明县';
$areaArr['320000']='江苏省';
$areaArr['429021']='湖北省神农架林区';
$areaArr['430000']='湖南省';
$areaArr['430100']='湖南省长沙市';
$areaArr['430101']='湖南省长沙市';
$areaArr['430102']='湖南省长沙市芙蓉区';
$areaArr['430103']='湖南省长沙市天心区';
$areaArr['430104']='湖南省长沙市岳麓区';
$areaArr['430105']='湖南省长沙市开福区';
$areaArr['430111']='湖南省长沙市雨花区';
$areaArr['430121']='湖南省长沙市长沙县';
$areaArr['430122']='湖南省长沙市望城县';
$areaArr['430124']='湖南省长沙市宁乡县';
$areaArr['430181']='湖南省长沙市浏阳市';
$areaArr['430200']='湖南省株洲市';
$areaArr['430201']='湖南省株洲市';
$areaArr['430202']='湖南省株洲市荷塘区';
$areaArr['430203']='湖南省株洲市芦淞区';
$areaArr['430204']='湖南省株洲市石峰区';
$areaArr['430211']='湖南省株洲市天元区';
$areaArr['430221']='湖南省株洲市株洲县';
$areaArr['430223']='湖南省株洲市攸县';
$areaArr['430224']='湖南省株洲市茶陵县';
$areaArr['430225']='湖南省株洲市炎陵县';
$areaArr['430281']='湖南省株洲市醴陵市';
$areaArr['430300']='湖南省湘潭市';
$areaArr['430301']='湖南省湘潭市';
$areaArr['430302']='湖南省湘潭市雨湖区';
$areaArr['430304']='湖南省湘潭市岳塘区';
$areaArr['430321']='湖南省湘潭市湘潭县';
$areaArr['420500']='湖北省宜昌市';
$areaArr['411525']='河南省信阳市固始县';
$areaArr['411526']='河南省信阳市潢川县';
$areaArr['411527']='河南省信阳市淮滨县';
$areaArr['411528']='河南省信阳市息县';
$areaArr['411600']='河南省周口市';
$areaArr['411601']='河南省周口市';
$areaArr['411602']='河南省周口市川汇区';
$areaArr['411621']='河南省周口市扶沟县';
$areaArr['411622']='河南省周口市西华县';
$areaArr['411623']='河南省周口市商水县';
$areaArr['411624']='河南省周口市沈丘县';
$areaArr['411625']='河南省周口市郸城县';
$areaArr['411626']='河南省周口市淮阳县';
$areaArr['411627']='河南省周口市太康县';
$areaArr['411628']='河南省周口市鹿邑县';
$areaArr['411681']='河南省周口市项城市';
$areaArr['411700']='河南省驻马店市';
$areaArr['411701']='河南省驻马店市';
$areaArr['411702']='河南省驻马店市驿城区';
$areaArr['411721']='河南省驻马店市西平县';
$areaArr['411722']='河南省驻马店市上蔡县';
$areaArr['411723']='河南省驻马店市平舆县';
$areaArr['411724']='河南省驻马店市正阳县';
$areaArr['411725']='河南省驻马店市确山县';
$areaArr['411726']='河南省驻马店市泌阳县';
$areaArr['411727']='河南省驻马店市汝南县';
$areaArr['411728']='河南省驻马店市遂平县';
$areaArr['411729']='河南省驻马店市新蔡县';
$areaArr['420000']='湖北省';
$areaArr['420100']='湖北省武汉市';
$areaArr['420101']='湖北省武汉市';
$areaArr['420102']='湖北省武汉市江岸区';
$areaArr['420103']='湖北省武汉市江汉区';
$areaArr['420104']='湖北省武汉市乔口区';
$areaArr['420105']='湖北省武汉市汉阳区';
$areaArr['420106']='湖北省武汉市武昌区';
$areaArr['420107']='湖北省武汉市青山区';
$areaArr['420111']='湖北省武汉市洪山区';
$areaArr['420112']='湖北省武汉市东西湖区';
$areaArr['420113']='湖北省武汉市汉南区';
$areaArr['420114']='湖北省武汉市蔡甸区';
$areaArr['420115']='湖北省武汉市江夏区';
$areaArr['420116']='湖北省武汉市黄陂区';
$areaArr['420117']='湖北省武汉市新洲区';
$areaArr['420200']='湖北省黄石市';
$areaArr['420201']='湖北省黄石市';
$areaArr['420202']='湖北省黄石市黄石港区';
$areaArr['420203']='湖北省黄石市西塞山区';
$areaArr['420204']='湖北省黄石市下陆区';
$areaArr['420205']='湖北省黄石市铁山区';
$areaArr['420222']='湖北省黄石市阳新县';
$areaArr['420281']='湖北省黄石市大冶市';
$areaArr['420300']='湖北省十堰市';
$areaArr['420301']='湖北省十堰市';
$areaArr['420302']='湖北省十堰市茅箭区';
$areaArr['420303']='湖北省十堰市张湾区';
$areaArr['420321']='湖北省十堰市郧县';
$areaArr['420322']='湖北省十堰市郧西县';
$areaArr['420323']='湖北省十堰市竹山县';
$areaArr['420324']='湖北省十堰市竹溪县';
$areaArr['420325']='湖北省十堰市房县';
$areaArr['420381']='湖北省十堰市丹江口市';
$areaArr['420501']='湖北省宜昌市';
$areaArr['430400']='湖南省衡阳市';
$areaArr['410401']='河南省平顶山市';
$areaArr['410402']='河南省平顶山市新华区';
$areaArr['410403']='河南省平顶山市卫东区';
$areaArr['410404']='河南省平顶山市石龙区';
$areaArr['410411']='河南省平顶山市湛河区';
$areaArr['410421']='河南省平顶山市宝丰县';
$areaArr['410422']='河南省平顶山市叶县';
$areaArr['410423']='河南省平顶山市鲁山县';
$areaArr['410425']='河南省平顶山市郏县';
$areaArr['410481']='河南省平顶山市舞钢市';
$areaArr['410482']='河南省平顶山市汝州市';
$areaArr['410500']='河南省安阳市';
$areaArr['410501']='河南省安阳市';
$areaArr['410502']='河南省安阳市文峰区';
$areaArr['410503']='河南省安阳市北关区';
$areaArr['410505']='河南省安阳市殷都区';
$areaArr['410506']='河南省安阳市龙安区';
$areaArr['410522']='河南省安阳市安阳县';
$areaArr['410523']='河南省安阳市汤阴县';
$areaArr['410526']='河南省安阳市滑县';
$areaArr['410527']='河南省安阳市内黄县';
$areaArr['410581']='河南省安阳市林州市';
$areaArr['410600']='河南省鹤壁市';
$areaArr['410601']='河南省鹤壁市';
$areaArr['410602']='河南省鹤壁市鹤山区';
$areaArr['410603']='河南省鹤壁市山城区';
$areaArr['410611']='河南省鹤壁市淇滨区';
$areaArr['410621']='河南省鹤壁市浚县';
$areaArr['410622']='河南省鹤壁市淇县';
$areaArr['410700']='河南省新乡市';
$areaArr['410701']='河南省新乡市';
$areaArr['410702']='河南省新乡市红旗区';
$areaArr['410703']='河南省新乡市卫滨区';
$areaArr['410704']='河南省新乡市凤泉区';
$areaArr['410711']='河南省新乡市牧野区';
$areaArr['410721']='河南省新乡市新乡县';
$areaArr['410724']='河南省新乡市获嘉县';
$areaArr['410725']='河南省新乡市原阳县';
$areaArr['410726']='河南省新乡市延津县';
$areaArr['410727']='河南省新乡市封丘县';
$areaArr['410728']='河南省新乡市长垣县';
$areaArr['410781']='河南省新乡市卫辉市';
$areaArr['410782']='河南省新乡市辉县市';
$areaArr['410800']='河南省焦作市';
$areaArr['410801']='河南省焦作市';
$areaArr['410802']='河南省焦作市解放区';
$areaArr['410803']='河南省焦作市中站区';
$areaArr['410804']='河南省焦作市马村区';
$areaArr['410811']='河南省焦作市山阳区';
$areaArr['410821']='河南省焦作市修武县';
$areaArr['410822']='河南省焦作市博爱县';
$areaArr['410823']='河南省焦作市武陟县';
$areaArr['410825']='河南省焦作市温县';
$areaArr['410881']='河南省焦作市济源市';
$areaArr['410882']='河南省焦作市沁阳市';
$areaArr['410883']='河南省焦作市孟州市';
$areaArr['410900']='河南省濮阳市';
$areaArr['410901']='河南省濮阳市';
$areaArr['410902']='河南省濮阳市华龙区';
$areaArr['410922']='河南省濮阳市清丰县';
$areaArr['430382']='湖南省湘潭市韶山市';
$areaArr['421124']='湖北省黄冈市英山县';
$areaArr['410927']='河南省濮阳市台前县';
$areaArr['410928']='河南省濮阳市濮阳县';
$areaArr['411000']='河南省许昌市';
$areaArr['411001']='河南省许昌市';
$areaArr['411002']='河南省许昌市魏都区';
$areaArr['411023']='河南省许昌市许昌县';
$areaArr['411024']='河南省许昌市鄢陵县';
$areaArr['411025']='河南省许昌市襄城县';
$areaArr['411081']='河南省许昌市禹州市';
$areaArr['411082']='河南省许昌市长葛市';
$areaArr['411100']='河南省漯河市';
$areaArr['411101']='河南省漯河市';
$areaArr['411102']='河南省漯河市源汇区';
$areaArr['411103']='河南省漯河市郾城区';
$areaArr['411104']='河南省漯河市召陵区';
$areaArr['411121']='河南省漯河市舞阳县';
$areaArr['411122']='河南省漯河市临颍县';
$areaArr['411200']='河南省三门峡市';
$areaArr['411201']='河南省三门峡市';
$areaArr['411202']='河南省三门峡市湖滨区';
$areaArr['411221']='河南省三门峡市渑池县';
$areaArr['411222']='河南省三门峡市陕县';
$areaArr['411224']='河南省三门峡市卢氏县';
$areaArr['411281']='河南省三门峡市义马市';
$areaArr['411282']='河南省三门峡市灵宝市';
$areaArr['411300']='河南省南阳市';
$areaArr['411301']='河南省南阳市';
$areaArr['411302']='河南省南阳市宛城区';
$areaArr['411303']='河南省南阳市卧龙区';
$areaArr['411321']='河南省南阳市南召县';
$areaArr['411322']='河南省南阳市方城县';
$areaArr['411323']='河南省南阳市西峡县';
$areaArr['411324']='河南省南阳市镇平县';
$areaArr['411325']='河南省南阳市内乡县';
$areaArr['411326']='河南省南阳市淅川县';
$areaArr['411327']='河南省南阳市社旗县';
$areaArr['411328']='河南省南阳市唐河县';
$areaArr['411329']='河南省南阳市新野县';
$areaArr['411330']='河南省南阳市桐柏县';
$areaArr['411381']='河南省南阳市邓州市';
$areaArr['411400']='河南省商丘市';
$areaArr['411401']='河南省商丘市';
$areaArr['411402']='河南省商丘市梁园区';
$areaArr['411403']='河南省商丘市睢阳区';
$areaArr['411421']='河南省商丘市民权县';
$areaArr['411422']='河南省商丘市睢县';
$areaArr['411423']='河南省商丘市宁陵县';
$areaArr['411424']='河南省商丘市柘城县';
$areaArr['411425']='河南省商丘市虞城县';
$areaArr['411426']='河南省商丘市夏邑县';
$areaArr['411481']='河南省商丘市永城市';
$areaArr['411500']='河南省信阳市';
$areaArr['411501']='河南省信阳市';
$areaArr['411502']='河南省信阳市师河区';
$areaArr['411503']='河南省信阳市平桥区';
$areaArr['411521']='河南省信阳市罗山县';
$areaArr['411522']='河南省信阳市光山县';
$areaArr['411523']='河南省信阳市新县';
$areaArr['411524']='河南省信阳市商城县';
$areaArr['440100']='广东省广州市';
$areaArr['440101']='广东省广州市';
$areaArr['410381']='河南省洛阳市偃师市';
$areaArr['410400']='河南省平顶山市';
$areaArr['510704']='四川省绵阳市游仙区';
$areaArr['510722']='四川省绵阳市三台县';
$areaArr['510723']='四川省绵阳市盐亭县';
$areaArr['510724']='四川省绵阳市安县';
$areaArr['510725']='四川省绵阳市梓潼县';
$areaArr['510726']='四川省绵阳市北川羌族自治县';
$areaArr['510727']='四川省绵阳市平武县';
$areaArr['510781']='四川省绵阳市江油市';
$areaArr['510800']='四川省广元市';
$areaArr['510801']='四川省广元市';
$areaArr['510802']='四川省广元市市中区';
$areaArr['510811']='四川省广元市元坝区';
$areaArr['510812']='四川省广元市朝天区';
$areaArr['510821']='四川省广元市旺苍县';
$areaArr['510822']='四川省广元市青川县';
$areaArr['510823']='四川省广元市剑阁县';
$areaArr['510824']='四川省广元市苍溪县';
$areaArr['510900']='四川省遂宁市';
$areaArr['510901']='四川省遂宁市';
$areaArr['510903']='四川省遂宁市船山区';
$areaArr['510904']='四川省遂宁市安居区';
$areaArr['510921']='四川省遂宁市蓬溪县';
$areaArr['510922']='四川省遂宁市射洪县';
$areaArr['510923']='四川省遂宁市大英县';
$areaArr['511000']='四川省内江市';
$areaArr['511001']='四川省内江市';
$areaArr['511002']='四川省内江市市中区';
$areaArr['511011']='四川省内江市东兴区';
$areaArr['511024']='四川省内江市威远县';
$areaArr['511025']='四川省内江市资中县';
$areaArr['511028']='四川省内江市隆昌县';
$areaArr['511100']='四川省乐山市';
$areaArr['511101']='四川省乐山市';
$areaArr['511102']='四川省乐山市市中区';
$areaArr['511111']='四川省乐山市沙湾区';
$areaArr['511112']='四川省乐山市五通桥区';
$areaArr['511113']='四川省乐山市金口河区';
$areaArr['511123']='四川省乐山市犍为县';
$areaArr['511124']='四川省乐山市井研县';
$areaArr['511126']='四川省乐山市夹江县';
$areaArr['511129']='四川省乐山市沐川县';
$areaArr['511132']='四川省乐山市峨边彝族自治县';
$areaArr['511133']='四川省乐山市马边彝族自治县';
$areaArr['511181']='四川省乐山市峨眉山市';
$areaArr['511300']='四川省南充市';
$areaArr['370826']='山东省济宁市微山县';
$areaArr['370827']='山东省济宁市鱼台县';
$areaArr['370828']='山东省济宁市金乡县';
$areaArr['370829']='山东省济宁市嘉祥县';
$areaArr['370830']='山东省济宁市汶上县';
$areaArr['370831']='山东省济宁市泗水县';
$areaArr['370832']='山东省济宁市梁山县';
$areaArr['370881']='山东省济宁市曲阜市';
$areaArr['350111']='福建省福州市晋安区';
$areaArr['350121']='福建省福州市闽侯县';
$areaArr['350122']='福建省福州市连江县';
$areaArr['350123']='福建省福州市罗源县';
$areaArr['350124']='福建省福州市闽清县';
$areaArr['350125']='福建省福州市永泰县';
$areaArr['350128']='福建省福州市平潭县';
$areaArr['350181']='福建省福州市福清市';
$areaArr['350182']='福建省福州市长乐市';
$areaArr['350200']='福建省厦门市';
$areaArr['350201']='福建省厦门市';
$areaArr['350203']='福建省厦门市思明区';
$areaArr['350205']='福建省厦门市海沧区';
$areaArr['350206']='福建省厦门市湖里区';
$areaArr['350211']='福建省厦门市集美区';
$areaArr['350212']='福建省厦门市同安区';
$areaArr['350213']='福建省厦门市翔安区';
$areaArr['350300']='福建省莆田市';
$areaArr['350301']='福建省莆田市';
$areaArr['350302']='福建省莆田市城厢区';
$areaArr['350303']='福建省莆田市涵江区';
$areaArr['350304']='福建省莆田市荔城区';
$areaArr['350305']='福建省莆田市秀屿区';
$areaArr['350322']='福建省莆田市仙游县';
$areaArr['350400']='福建省三明市';
$areaArr['350401']='福建省三明市';
$areaArr['350402']='福建省三明市梅列区';
$areaArr['350403']='福建省三明市三元区';
$areaArr['350421']='福建省三明市明溪县';
$areaArr['350423']='福建省三明市清流县';
$areaArr['350424']='福建省三明市宁化县';
$areaArr['350425']='福建省三明市大田县';
$areaArr['350426']='福建省三明市尤溪县';
$areaArr['350427']='福建省三明市沙县';
$areaArr['350428']='福建省三明市将乐县';
$areaArr['350429']='福建省三明市泰宁县';
$areaArr['350430']='福建省三明市建宁县';
$areaArr['350481']='福建省三明市永安市';
$areaArr['350500']='福建省泉州市';
$areaArr['350501']='福建省泉州市';
$areaArr['350502']='福建省泉州市鲤城区';
$areaArr['350503']='福建省泉州市丰泽区';
$areaArr['350504']='福建省泉州市洛江区';
$areaArr['350505']='福建省泉州市泉港区';
$areaArr['350521']='福建省泉州市惠安县';
$areaArr['350524']='福建省泉州市安溪县';
$areaArr['350525']='福建省泉州市永春县';
$areaArr['350526']='福建省泉州市德化县';
$areaArr['350527']='福建省泉州市金门县';
$areaArr['350581']='福建省泉州市石狮市';
$areaArr['350582']='福建省泉州市晋江市';
$areaArr['350583']='福建省泉州市南安市';
$areaArr['350600']='福建省漳州市';
$areaArr['350601']='福建省漳州市';
$areaArr['350602']='福建省漳州市芗城区';
$areaArr['350603']='福建省漳州市龙文区';
$areaArr['350622']='福建省漳州市云霄县';
$areaArr['350623']='福建省漳州市漳浦县';
$areaArr['350624']='福建省漳州市诏安县';
$areaArr['350625']='福建省漳州市长泰县';
$areaArr['350626']='福建省漳州市东山县';
$areaArr['350627']='福建省漳州市南靖县';
$areaArr['341200']='安徽省阜阳市';
$areaArr['341201']='安徽省阜阳市';
$areaArr['341202']='安徽省阜阳市颍州区';
$areaArr['341203']='安徽省阜阳市颍东区';
$areaArr['341204']='安徽省阜阳市颍泉区';
$areaArr['341221']='安徽省阜阳市临泉县';
$areaArr['341222']='安徽省阜阳市太和县';
$areaArr['341225']='安徽省阜阳市阜南县';
$areaArr['341226']='安徽省阜阳市颍上县';
$areaArr['341282']='安徽省阜阳市界首市';
$areaArr['341300']='安徽省宿州市';
$areaArr['341301']='安徽省宿州市';
$areaArr['341302']='安徽省宿州市墉桥区';
$areaArr['341321']='安徽省宿州市砀山县';
$areaArr['341322']='安徽省宿州市萧县';
$areaArr['341323']='安徽省宿州市灵璧县';
$areaArr['341324']='安徽省宿州市泗县';
$areaArr['341400']='安徽省巢湖市';
$areaArr['341401']='安徽省巢湖市';
$areaArr['341402']='安徽省巢湖市居巢区';
$areaArr['341421']='安徽省巢湖市庐江县';
$areaArr['341422']='安徽省巢湖市无为县';
$areaArr['341423']='安徽省巢湖市含山县';
$areaArr['341424']='安徽省巢湖市和县';
$areaArr['341500']='安徽省六安市';
$areaArr['341501']='安徽省六安市';
$areaArr['341502']='安徽省六安市金安区';
$areaArr['341503']='安徽省六安市裕安区';
$areaArr['341521']='安徽省六安市寿县';
$areaArr['341522']='安徽省六安市霍邱县';
$areaArr['341523']='安徽省六安市舒城县';
$areaArr['341524']='安徽省六安市金寨县';
$areaArr['341525']='安徽省六安市霍山县';
$areaArr['341600']='安徽省亳州市';
$areaArr['341601']='安徽省亳州市';
$areaArr['341602']='安徽省亳州市谯城区';
$areaArr['445301']='广东省云浮市';
$areaArr['445302']='广东省云浮市云城区';
$areaArr['445321']='广东省云浮市新兴县';
$areaArr['445322']='广东省云浮市郁南县';
$areaArr['445323']='广东省云浮市云安县';
$areaArr['445381']='广东省云浮市罗定市';
$areaArr['450000']='广西壮族自治区';
$areaArr['450100']='广西壮族自治区南宁市';
$areaArr['450101']='广西壮族自治区南宁市';
$areaArr['450102']='广西壮族自治区南宁市兴宁区';
$areaArr['450103']='广西壮族自治区南宁市青秀区';
$areaArr['450105']='广西壮族自治区南宁市江南区';
$areaArr['450107']='广西壮族自治区南宁市西乡塘区';
$areaArr['450108']='广西壮族自治区南宁市良庆区';
$areaArr['450109']='广西壮族自治区南宁市邕宁区';
$areaArr['450122']='广西壮族自治区南宁市武鸣县';
$areaArr['450123']='广西壮族自治区南宁市隆安县';
$areaArr['450124']='广西壮族自治区南宁市马山县';
$areaArr['450125']='广西壮族自治区南宁市上林县';
$areaArr['450126']='广西壮族自治区南宁市宾阳县';
$areaArr['450127']='广西壮族自治区南宁市横县';
$areaArr['450200']='广西壮族自治区柳州市';
$areaArr['450201']='广西壮族自治区柳州市';
$areaArr['450202']='广西壮族自治区柳州市城中区';
$areaArr['450203']='广西壮族自治区柳州市鱼峰区';
$areaArr['450204']='广西壮族自治区柳州市柳南区';
$areaArr['450205']='广西壮族自治区柳州市柳北区';
$areaArr['450221']='广西壮族自治区柳州市柳江县';
$areaArr['450222']='广西壮族自治区柳州市柳城县';
$areaArr['450223']='广西壮族自治区柳州市鹿寨县';
$areaArr['460105']='海南省海口市秀英区';
$areaArr['522625']='贵州省黔东南苗族侗族自治州镇远县';
$areaArr['460107']='海南省海口市琼山区';
$areaArr['460108']='海南省海口市美兰区';
$areaArr['460200']='海南省三亚市';
$areaArr['460201']='海南省三亚市';
$areaArr['469000']='海南省省直辖县级行政单位';
$areaArr['469001']='海南省五指山市';
$areaArr['469002']='海南省琼海市';
$areaArr['469003']='海南省儋州市';
$areaArr['469005']='海南省文昌市';
$areaArr['469006']='海南省万宁市';
$areaArr['469007']='海南省东方市';
$areaArr['469025']='海南省定安县';
$areaArr['469026']='海南省屯昌县';
$areaArr['469027']='海南省澄迈县';
$areaArr['469028']='海南省临高县';
$areaArr['469030']='海南省白沙黎族自治县';
$areaArr['469031']='海南省昌江黎族自治县';
$areaArr['469033']='海南省乐东黎族自治县';
$areaArr['469034']='海南省陵水黎族自治县';
$areaArr['469035']='海南省保亭黎族苗族自治县';
$areaArr['469036']='海南省琼中黎族苗族自治县';
$areaArr['469037']='海南省西沙群岛';
$areaArr['469038']='海南省南沙群岛';
$areaArr['469039']='海南省中沙群岛的岛礁及其海域';
$areaArr['500000']='重庆市';
$areaArr['500100']='重庆市';
$areaArr['500101']='重庆市万州区';
$areaArr['500102']='重庆市涪陵区';
$areaArr['500103']='重庆市渝中区';
$areaArr['500104']='重庆市大渡口区';
$areaArr['500105']='重庆市江北区';
$areaArr['500106']='重庆市沙坪坝区';
$areaArr['500107']='重庆市九龙坡区';
$areaArr['500108']='重庆市南岸区';
$areaArr['500109']='重庆市北碚区';
$areaArr['500110']='重庆市万盛区';
$areaArr['500111']='重庆市双桥区';
$areaArr['500112']='重庆市渝北区';
$areaArr['500113']='重庆市巴南区';
$areaArr['500114']='重庆市黔江区';
$areaArr['500115']='重庆市长寿区';
$areaArr['500200']='重庆市';
$areaArr['500222']='重庆市綦江县';
$areaArr['500223']='重庆市潼南县';
$areaArr['500224']='重庆市铜梁县';
$areaArr['500225']='重庆市大足县';
$areaArr['500226']='重庆市荣昌县';
$areaArr['500227']='重庆市璧山县';
$areaArr['500228']='重庆市梁平县';
$areaArr['500229']='重庆市城口县';
$areaArr['500230']='重庆市丰都县';
$areaArr['500231']='重庆市垫江县';
$areaArr['500232']='重庆市武隆县';
$areaArr['500233']='重庆市忠县';
$areaArr['500234']='重庆市开县';
$areaArr['500235']='重庆市云阳县';
$areaArr['500236']='重庆市奉节县';
$areaArr['500237']='重庆市巫山县';
$areaArr['500238']='重庆市巫溪县';
$areaArr['500240']='重庆市石柱土家族自治县';
$areaArr['440783']='广东省江门市开平市';
$areaArr['450901']='广西壮族自治区玉林市';
$areaArr['440785']='广东省江门市恩平市';
$areaArr['440800']='广东省湛江市';
$areaArr['440801']='广东省湛江市';
$areaArr['440802']='广东省湛江市赤坎区';
$areaArr['440803']='广东省湛江市霞山区';
$areaArr['440804']='广东省湛江市坡头区';
$areaArr['440811']='广东省湛江市麻章区';
$areaArr['440823']='广东省湛江市遂溪县';
$areaArr['440825']='广东省湛江市徐闻县';
$areaArr['440881']='广东省湛江市廉江市';
$areaArr['440882']='广东省湛江市雷州市';
$areaArr['440883']='广东省湛江市吴川市';
$areaArr['440900']='广东省茂名市';
$areaArr['440901']='广东省茂名市';
$areaArr['440902']='广东省茂名市茂南区';
$areaArr['440903']='广东省茂名市茂港区';
$areaArr['440923']='广东省茂名市电白县';
$areaArr['440981']='广东省茂名市高州市';
$areaArr['440982']='广东省茂名市化州市';
$areaArr['440983']='广东省茂名市信宜市';
$areaArr['441200']='广东省肇庆市';
$areaArr['441201']='广东省肇庆市';
$areaArr['441202']='广东省肇庆市端州区';
$areaArr['441203']='广东省肇庆市鼎湖区';
$areaArr['441223']='广东省肇庆市广宁县';
$areaArr['441224']='广东省肇庆市怀集县';
$areaArr['441225']='广东省肇庆市封开县';
$areaArr['441226']='广东省肇庆市德庆县';
$areaArr['441283']='广东省肇庆市高要市';
$areaArr['441284']='广东省肇庆市四会市';
$areaArr['441300']='广东省惠州市';
$areaArr['441301']='广东省惠州市';
$areaArr['441302']='广东省惠州市惠城区';
$areaArr['441303']='广东省惠州市惠阳区';
$areaArr['441322']='广东省惠州市博罗县';
$areaArr['441323']='广东省惠州市惠东县';
$areaArr['441324']='广东省惠州市龙门县';
$areaArr['441400']='广东省梅州市';
$areaArr['441401']='广东省梅州市';
$areaArr['441402']='广东省梅州市梅江区';
$areaArr['441421']='广东省梅州市梅县';
$areaArr['441422']='广东省梅州市大埔县';
$areaArr['441423']='广东省梅州市丰顺县';
$areaArr['441424']='广东省梅州市五华县';
$areaArr['441426']='广东省梅州市平远县';
$areaArr['441427']='广东省梅州市蕉岭县';
$areaArr['441481']='广东省梅州市兴宁市';
$areaArr['441500']='广东省汕尾市';
$areaArr['441501']='广东省汕尾市';
$areaArr['441502']='广东省汕尾市城区';
$areaArr['441521']='广东省汕尾市海丰县';
$areaArr['441523']='广东省汕尾市陆河县';
$areaArr['441581']='广东省汕尾市陆丰市';
$areaArr['441600']='广东省河源市';
$areaArr['441601']='广东省河源市';
$areaArr['441602']='广东省河源市源城区';
$areaArr['441621']='广东省河源市紫金县';
$areaArr['441622']='广东省河源市龙川县';
$areaArr['441623']='广东省河源市连平县';
$areaArr['441624']='广东省河源市和平县';
$areaArr['441625']='广东省河源市东源县';
$areaArr['450224']='广西壮族自治区柳州市融安县';
$areaArr['500243']='重庆市彭水苗族土家族自治县';
$areaArr['500300']='重庆市';
$areaArr['440105']='广东省广州市海珠区';
$areaArr['440106']='广东省广州市天河区';
$areaArr['440107']='广东省广州市芳村区';
$areaArr['440111']='广东省广州市白云区';
$areaArr['440112']='广东省广州市黄埔区';
$areaArr['440113']='广东省广州市番禺区';
$areaArr['440114']='广东省广州市花都区';
$areaArr['440183']='广东省广州市增城市';
$areaArr['440184']='广东省广州市从化市';
$areaArr['440200']='广东省韶关市';
$areaArr['440201']='广东省韶关市';
$areaArr['440203']='广东省韶关市武江区';
$areaArr['440204']='广东省韶关市浈江区';
$areaArr['440205']='广东省韶关市曲江区';
$areaArr['440222']='广东省韶关市始兴县';
$areaArr['440224']='广东省韶关市仁化县';
$areaArr['440229']='广东省韶关市翁源县';
$areaArr['440232']='广东省韶关市乳源瑶族自治县';
$areaArr['440233']='广东省韶关市新丰县';
$areaArr['440281']='广东省韶关市乐昌市';
$areaArr['440282']='广东省韶关市南雄市';
$areaArr['440300']='广东省深圳市';
$areaArr['440301']='广东省深圳市';
$areaArr['440303']='广东省深圳市罗湖区';
$areaArr['440304']='广东省深圳市福田区';
$areaArr['440305']='广东省深圳市南山区';
$areaArr['440306']='广东省深圳市宝安区';
$areaArr['440307']='广东省深圳市龙岗区';
$areaArr['440308']='广东省深圳市盐田区';
$areaArr['440400']='广东省珠海市';
$areaArr['440401']='广东省珠海市';
$areaArr['440402']='广东省珠海市香洲区';
$areaArr['440403']='广东省珠海市斗门区';
$areaArr['440404']='广东省珠海市金湾区';
$areaArr['440500']='广东省汕头市';
$areaArr['440501']='广东省汕头市';
$areaArr['440507']='广东省汕头市龙湖区';
$areaArr['440511']='广东省汕头市金平区';
$areaArr['440512']='广东省汕头市濠江区';
$areaArr['440513']='广东省汕头市潮阳区';
$areaArr['440514']='广东省汕头市潮南区';
$areaArr['440515']='广东省汕头市澄海区';
$areaArr['440523']='广东省汕头市南澳县';
$areaArr['440600']='广东省佛山市';
$areaArr['440601']='广东省佛山市';
$areaArr['440604']='广东省佛山市禅城区';
$areaArr['440605']='广东省佛山市南海区';
$areaArr['440606']='广东省佛山市顺德区';
$areaArr['440607']='广东省佛山市三水区';
$areaArr['440608']='广东省佛山市高明区';
$areaArr['440700']='广东省江门市';
$areaArr['440701']='广东省江门市';
$areaArr['440703']='广东省江门市蓬江区';
$areaArr['440704']='广东省江门市江海区';
$areaArr['440705']='广东省江门市新会区';
$areaArr['440781']='广东省江门市台山市';
$areaArr['460100']='海南省海口市';
$areaArr['460101']='海南省海口市';
$areaArr['500241']='重庆市秀山土家族苗族自治县';
$areaArr['500242']='重庆市酉阳土家族苗族自治县';
$areaArr['441701']='广东省阳江市';
$areaArr['450921']='广西壮族自治区玉林市容县';
$areaArr['450922']='广西壮族自治区玉林市陆川县';
$areaArr['450923']='广西壮族自治区玉林市博白县';
$areaArr['450924']='广西壮族自治区玉林市兴业县';
$areaArr['450981']='广西壮族自治区玉林市北流市';
$areaArr['451000']='广西壮族自治区百色市';
$areaArr['451001']='广西壮族自治区百色市';
$areaArr['451002']='广西壮族自治区百色市右江区';
$areaArr['451021']='广西壮族自治区百色市田阳县';
$areaArr['451022']='广西壮族自治区百色市田东县';
$areaArr['451023']='广西壮族自治区百色市平果县';
$areaArr['451024']='广西壮族自治区百色市德保县';
$areaArr['451025']='广西壮族自治区百色市靖西县';
$areaArr['451026']='广西壮族自治区百色市那坡县';
$areaArr['451027']='广西壮族自治区百色市凌云县';
$areaArr['451028']='广西壮族自治区百色市乐业县';
$areaArr['451029']='广西壮族自治区百色市田林县';
$areaArr['451030']='广西壮族自治区百色市西林县';
$areaArr['451031']='广西壮族自治区百色市隆林各族自治县';
$areaArr['451100']='广西壮族自治区贺州市';
$areaArr['451101']='广西壮族自治区贺州市';
$areaArr['451102']='广西壮族自治区贺州市八步区';
$areaArr['451121']='广西壮族自治区贺州市昭平县';
$areaArr['451122']='广西壮族自治区贺州市钟山县';
$areaArr['451123']='广西壮族自治区贺州市富川瑶族自治县';
$areaArr['451200']='广西壮族自治区河池市';
$areaArr['451201']='广西壮族自治区河池市';
$areaArr['451202']='广西壮族自治区河池市金城江区';
$areaArr['451221']='广西壮族自治区河池市南丹县';
$areaArr['451222']='广西壮族自治区河池市天峨县';
$areaArr['451223']='广西壮族自治区河池市凤山县';
$areaArr['451224']='广西壮族自治区河池市东兰县';
$areaArr['451225']='广西壮族自治区河池市罗城仫佬族自治县';
$areaArr['451226']='广西壮族自治区河池市环江毛南族自治县';
$areaArr['451227']='广西壮族自治区河池市巴马瑶族自治县';
$areaArr['451228']='广西壮族自治区河池市都安瑶族自治县';
$areaArr['451229']='广西壮族自治区河池市大化瑶族自治县';
$areaArr['451281']='广西壮族自治区河池市宜州市';
$areaArr['451300']='广西壮族自治区来宾市';
$areaArr['451301']='广西壮族自治区来宾市';
$areaArr['451302']='广西壮族自治区来宾市兴宾区';
$areaArr['451321']='广西壮族自治区来宾市忻城县';
$areaArr['430801']='湖南省张家界市';
$areaArr['430802']='湖南省张家界市永定区';
$areaArr['430811']='湖南省张家界市武陵源区';
$areaArr['430821']='湖南省张家界市慈利县';
$areaArr['430822']='湖南省张家界市桑植县';
$areaArr['430900']='湖南省益阳市';
$areaArr['430901']='湖南省益阳市';
$areaArr['430902']='湖南省益阳市资阳区';
$areaArr['430903']='湖南省益阳市赫山区';
$areaArr['430921']='湖南省益阳市南县';
$areaArr['441700']='广东省阳江市';
$areaArr['420502']='湖北省宜昌市西陵区';
$areaArr['430981']='湖南省益阳市沅江市';
$areaArr['431000']='湖南省郴州市';
$areaArr['431001']='湖南省郴州市';
$areaArr['431002']='湖南省郴州市北湖区';
$areaArr['431003']='湖南省郴州市苏仙区';
$areaArr['431021']='湖南省郴州市桂阳县';
$areaArr['431022']='湖南省郴州市宜章县';
$areaArr['431023']='湖南省郴州市永兴县';
$areaArr['431024']='湖南省郴州市嘉禾县';
$areaArr['431025']='湖南省郴州市临武县';
$areaArr['431026']='湖南省郴州市汝城县';
$areaArr['431027']='湖南省郴州市桂东县';
$areaArr['431028']='湖南省郴州市安仁县';
$areaArr['431081']='湖南省郴州市资兴市';
$areaArr['431100']='湖南省永州市';
$areaArr['431101']='湖南省永州市';
$areaArr['431102']='湖南省永州市芝山区';
$areaArr['431103']='湖南省永州市冷水滩区';
$areaArr['431121']='湖南省永州市祁阳县';
$areaArr['431122']='湖南省永州市东安县';
$areaArr['431123']='湖南省永州市双牌县';
$areaArr['431124']='湖南省永州市道县';
$areaArr['431125']='湖南省永州市江永县';
$areaArr['431126']='湖南省永州市宁远县';
$areaArr['431127']='湖南省永州市蓝山县';
$areaArr['431128']='湖南省永州市新田县';
$areaArr['431129']='湖南省永州市江华瑶族自治县';
$areaArr['431200']='湖南省怀化市';
$areaArr['431201']='湖南省怀化市';
$areaArr['431202']='湖南省怀化市鹤城区';
$areaArr['431221']='湖南省怀化市中方县';
$areaArr['431222']='湖南省怀化市沅陵县';
$areaArr['431223']='湖南省怀化市辰溪县';
$areaArr['431224']='湖南省怀化市溆浦县';
$areaArr['431225']='湖南省怀化市会同县';
$areaArr['431226']='湖南省怀化市麻阳苗族自治县';
$areaArr['431227']='湖南省怀化市新晃侗族自治县';
$areaArr['431228']='湖南省怀化市芷江侗族自治县';
$areaArr['431229']='湖南省怀化市靖州苗族侗族自治县';
$areaArr['431230']='湖南省怀化市通道侗族自治县';
$areaArr['431281']='湖南省怀化市洪江市';
$areaArr['431300']='湖南省娄底市';
$areaArr['431301']='湖南省娄底市';
$areaArr['431302']='湖南省娄底市娄星区';
$areaArr['431321']='湖南省娄底市双峰县';
$areaArr['431322']='湖南省娄底市新化县';
$areaArr['431381']='湖南省娄底市冷水江市';
$areaArr['431382']='湖南省娄底市涟源市';
$areaArr['433100']='湖南省湘西土家族苗族自治州';
$areaArr['433101']='湖南省湘西土家族苗族自治州吉首市';
$areaArr['433122']='湖南省湘西土家族苗族自治州泸溪县';
$areaArr['433123']='湖南省湘西土家族苗族自治州凤凰县';
$areaArr['433124']='湖南省湘西土家族苗族自治州花垣县';
$areaArr['433125']='湖南省湘西土家族苗族自治州保靖县';
$areaArr['433126']='湖南省湘西土家族苗族自治州古丈县';
$areaArr['433127']='湖南省湘西土家族苗族自治州永顺县';
$areaArr['433130']='湖南省湘西土家族苗族自治州龙山县';
$areaArr['440000']='广东省';
$areaArr['410329']='河南省洛阳市伊川县';
$areaArr['410923']='河南省濮阳市南乐县';
$areaArr['450902']='广西壮族自治区玉林市玉州区';
$areaArr['421125']='湖北省黄冈市浠水县';
$areaArr['421126']='湖北省黄冈市蕲春县';
$areaArr['421127']='湖北省黄冈市黄梅县';
$areaArr['421181']='湖北省黄冈市麻城市';
$areaArr['421182']='湖北省黄冈市武穴市';
$areaArr['421200']='湖北省咸宁市';
$areaArr['421201']='湖北省咸宁市';
$areaArr['421202']='湖北省咸宁市咸安区';
$areaArr['421221']='湖北省咸宁市嘉鱼县';
$areaArr['421222']='湖北省咸宁市通城县';
$areaArr['421223']='湖北省咸宁市崇阳县';
$areaArr['421224']='湖北省咸宁市通山县';
$areaArr['421281']='湖北省咸宁市赤壁市';
$areaArr['421300']='湖北省随州市';
$areaArr['421301']='湖北省随州市';
$areaArr['421302']='湖北省随州市曾都区';
$areaArr['421381']='湖北省随州市广水市';
$areaArr['422800']='湖北省恩施土家族苗族自治州';
$areaArr['422801']='湖北省恩施土家族苗族自治州恩施市';
$areaArr['422802']='湖北省恩施土家族苗族自治州利川市';
$areaArr['422822']='湖北省恩施土家族苗族自治州建始县';
$areaArr['422823']='湖北省恩施土家族苗族自治州巴东县';
$areaArr['422825']='湖北省恩施土家族苗族自治州宣恩县';
$areaArr['422826']='湖北省恩施土家族苗族自治州咸丰县';
$areaArr['422827']='湖北省恩施土家族苗族自治州来凤县';
$areaArr['422828']='湖北省恩施土家族苗族自治州鹤峰县';
$areaArr['429000']='湖北省省直辖行政单位';
$areaArr['429004']='湖北省仙桃市';
$areaArr['429005']='湖北省潜江市';
$areaArr['429006']='湖北省天门市';
$areaArr['530111']='云南省昆明市官渡区';
$areaArr['530112']='云南省昆明市西山区';
$areaArr['530113']='云南省昆明市东川区';
$areaArr['530121']='云南省昆明市呈贡县';
$areaArr['530122']='云南省昆明市晋宁县';
$areaArr['530124']='云南省昆明市富民县';
$areaArr['530125']='云南省昆明市宜良县';
$areaArr['530126']='云南省昆明市石林彝族自治县';
$areaArr['530127']='云南省昆明市嵩明县';
$areaArr['530128']='云南省昆明市禄劝彝族苗族自治县';
$areaArr['530129']='云南省昆明市寻甸回族彝族自治县';
$areaArr['530181']='云南省昆明市安宁市';
$areaArr['530300']='云南省曲靖市';
$areaArr['530301']='云南省曲靖市';
$areaArr['530302']='云南省曲靖市麒麟区';
$areaArr['530321']='云南省曲靖市马龙县';
$areaArr['530322']='云南省曲靖市陆良县';
$areaArr['530323']='云南省曲靖市师宗县';
$areaArr['530324']='云南省曲靖市罗平县';
$areaArr['530325']='云南省曲靖市富源县';
$areaArr['530326']='云南省曲靖市会泽县';
$areaArr['530328']='云南省曲靖市沾益县';
$areaArr['530381']='云南省曲靖市宣威市';
$areaArr['530400']='云南省玉溪市';
$areaArr['530401']='云南省玉溪市';
$areaArr['620500']='甘肃省天水市';
$areaArr['533124']='云南省德宏傣族景颇族自治州陇川县';
$areaArr['533300']='云南省怒江傈僳族自治州';
$areaArr['533321']='云南省怒江傈僳族自治州泸水县';
$areaArr['532323']='云南省楚雄彝族自治州牟定县';
$areaArr['532324']='云南省楚雄彝族自治州南华县';
$areaArr['532325']='云南省楚雄彝族自治州姚安县';
$areaArr['532326']='云南省楚雄彝族自治州大姚县';
$areaArr['532327']='云南省楚雄彝族自治州永仁县';
$areaArr['532328']='云南省楚雄彝族自治州元谋县';
$areaArr['532329']='云南省楚雄彝族自治州武定县';
$areaArr['532331']='云南省楚雄彝族自治州禄丰县';
$areaArr['532500']='云南省红河哈尼族彝族自治州';
$areaArr['532501']='云南省红河哈尼族彝族自治州个旧市';
$areaArr['532502']='云南省红河哈尼族彝族自治州开远市';
$areaArr['532522']='云南省红河哈尼族彝族自治州蒙自县';
$areaArr['532523']='云南省红河哈尼族彝族自治州屏边苗族自治县';
$areaArr['532524']='云南省红河哈尼族彝族自治州建水县';
$areaArr['532525']='云南省红河哈尼族彝族自治州石屏县';
$areaArr['532526']='云南省红河哈尼族彝族自治州弥勒县';
$areaArr['532527']='云南省红河哈尼族彝族自治州泸西县';
$areaArr['532528']='云南省红河哈尼族彝族自治州元阳县';
$areaArr['532529']='云南省红河哈尼族彝族自治州红河县';
$areaArr['532530']='云南省红河哈尼族彝族自治州金平苗族瑶族傣族自治县';
$areaArr['532531']='云南省红河哈尼族彝族自治州绿春县';
$areaArr['532532']='云南省红河哈尼族彝族自治州河口瑶族自治县';
$areaArr['532600']='云南省文山壮族苗族自治州';
$areaArr['532621']='云南省文山壮族苗族自治州文山县';
$areaArr['532622']='云南省文山壮族苗族自治州砚山县';
$areaArr['532623']='云南省文山壮族苗族自治州西畴县';
$areaArr['532624']='云南省文山壮族苗族自治州麻栗坡县';
$areaArr['532625']='云南省文山壮族苗族自治州马关县';
$areaArr['532626']='云南省文山壮族苗族自治州丘北县';
$areaArr['532627']='云南省文山壮族苗族自治州广南县';
$areaArr['532628']='云南省文山壮族苗族自治州富宁县';
$areaArr['532800']='云南省西双版纳傣族自治州';
$areaArr['532801']='云南省西双版纳傣族自治州景洪市';
$areaArr['532822']='云南省西双版纳傣族自治州勐海县';
$areaArr['532823']='云南省西双版纳傣族自治州勐腊县';
$areaArr['532900']='云南省大理白族自治州';
$areaArr['532901']='云南省大理白族自治州大理市';
$areaArr['532922']='云南省大理白族自治州漾濞彝族自治县';
$areaArr['532923']='云南省大理白族自治州祥云县';
$areaArr['532924']='云南省大理白族自治州宾川县';
$areaArr['532925']='云南省大理白族自治州弥渡县';
$areaArr['532926']='云南省大理白族自治州南涧彝族自治县';
$areaArr['532927']='云南省大理白族自治州巍山彝族回族自治县';
$areaArr['532928']='云南省大理白族自治州永平县';
$areaArr['532929']='云南省大理白族自治州云龙县';
$areaArr['532930']='云南省大理白族自治州洱源县';
$areaArr['532931']='云南省大理白族自治州剑川县';
$areaArr['532932']='云南省大理白族自治州鹤庆县';
$areaArr['533100']='云南省德宏傣族景颇族自治州';
$areaArr['533102']='云南省德宏傣族景颇族自治州瑞丽市';
$areaArr['533103']='云南省德宏傣族景颇族自治州潞西市';
$areaArr['533122']='云南省德宏傣族景颇族自治州梁河县';
$areaArr['533123']='云南省德宏傣族景颇族自治州盈江县';
$areaArr['610727']='陕西省汉中市略阳县';
$areaArr['610728']='陕西省汉中市镇巴县';
$areaArr['610729']='陕西省汉中市留坝县';
$areaArr['533323']='云南省怒江傈僳族自治州福贡县';
$areaArr['533324']='云南省怒江傈僳族自治州贡山独龙族怒族自治县';
$areaArr['533325']='云南省怒江傈僳族自治州兰坪白族普米族自治县';
$areaArr['533400']='云南省迪庆藏族自治州';
$areaArr['533421']='云南省迪庆藏族自治州香格里拉县';
$areaArr['533422']='云南省迪庆藏族自治州德钦县';
$areaArr['533423']='云南省迪庆藏族自治州维西傈僳族自治县';
$areaArr['540000']='西藏自治区';
$areaArr['540100']='西藏自治区拉萨市';
$areaArr['540101']='西藏自治区拉萨市';
$areaArr['540102']='西藏自治区拉萨市城关区';
$areaArr['540121']='西藏自治区拉萨市林周县';
$areaArr['540122']='西藏自治区拉萨市当雄县';
$areaArr['540123']='西藏自治区拉萨市尼木县';
$areaArr['540124']='西藏自治区拉萨市曲水县';
$areaArr['540125']='西藏自治区拉萨市堆龙德庆县';
$areaArr['540126']='西藏自治区拉萨市达孜县';
$areaArr['540127']='西藏自治区拉萨市墨竹工卡县';
$areaArr['542100']='西藏自治区昌都地区';
$areaArr['542121']='西藏自治区昌都地区昌都县';
$areaArr['542122']='西藏自治区昌都地区江达县';
$areaArr['542123']='西藏自治区昌都地区贡觉县';
$areaArr['542124']='西藏自治区昌都地区类乌齐县';
$areaArr['542125']='西藏自治区昌都地区丁青县';
$areaArr['542126']='西藏自治区昌都地区察雅县';
$areaArr['542127']='西藏自治区昌都地区八宿县';
$areaArr['542128']='西藏自治区昌都地区左贡县';
$areaArr['542129']='西藏自治区昌都地区芒康县';
$areaArr['542132']='西藏自治区昌都地区洛隆县';
$areaArr['542133']='西藏自治区昌都地区边坝县';
$areaArr['542200']='西藏自治区山南地区';
$areaArr['542221']='西藏自治区山南地区乃东县';
$areaArr['542222']='西藏自治区山南地区扎囊县';
$areaArr['542223']='西藏自治区山南地区贡嘎县';
$areaArr['542224']='西藏自治区山南地区桑日县';
$areaArr['542225']='西藏自治区山南地区琼结县';
$areaArr['542226']='西藏自治区山南地区曲松县';
$areaArr['542227']='西藏自治区山南地区措美县';
$areaArr['542228']='西藏自治区山南地区洛扎县';
$areaArr['542229']='西藏自治区山南地区加查县';
$areaArr['542231']='西藏自治区山南地区隆子县';
$areaArr['542232']='西藏自治区山南地区错那县';
$areaArr['542233']='西藏自治区山南地区浪卡子县';
$areaArr['542300']='西藏自治区日喀则地区';
$areaArr['542301']='西藏自治区日喀则地区日喀则市';
$areaArr['542322']='西藏自治区日喀则地区南木林县';
$areaArr['542323']='西藏自治区日喀则地区江孜县';
$areaArr['542324']='西藏自治区日喀则地区定日县';
$areaArr['542325']='西藏自治区日喀则地区萨迦县';
$areaArr['542326']='西藏自治区日喀则地区拉孜县';
$areaArr['542327']='西藏自治区日喀则地区昂仁县';
$areaArr['542328']='西藏自治区日喀则地区谢通门县';
$areaArr['542329']='西藏自治区日喀则地区白朗县';
$areaArr['542330']='西藏自治区日喀则地区仁布县';
$areaArr['542331']='西藏自治区日喀则地区康马县';
$areaArr['513227']='四川省阿坝藏族羌族自治州小金县';
$areaArr['513228']='四川省阿坝藏族羌族自治州黑水县';
$areaArr['513229']='四川省阿坝藏族羌族自治州马尔康县';
//$areaArr['513025']='四川省达川地区通江县';
$areaArr['511424']='四川省眉山市丹棱县';
$areaArr['530424']='云南省玉溪市华宁县';
$areaArr['530425']='云南省玉溪市易门县';
$areaArr['530426']='云南省玉溪市峨山彝族自治县';
$areaArr['530427']='云南省玉溪市新平彝族傣族自治县';
$areaArr['530428']='云南省玉溪市元江哈尼族彝族傣族自治县';
$areaArr['530500']='云南省保山市';
$areaArr['530501']='云南省保山市';
$areaArr['530502']='云南省保山市隆阳区';
$areaArr['530521']='云南省保山市施甸县';
$areaArr['530522']='云南省保山市腾冲县';
$areaArr['530523']='云南省保山市龙陵县';
$areaArr['530524']='云南省保山市昌宁县';
$areaArr['530600']='云南省昭通市';
$areaArr['530601']='云南省昭通市';
$areaArr['530602']='云南省昭通市昭阳区';
$areaArr['530621']='云南省昭通市鲁甸县';
$areaArr['530622']='云南省昭通市巧家县';
$areaArr['530623']='云南省昭通市盐津县';
$areaArr['530624']='云南省昭通市大关县';
$areaArr['530625']='云南省昭通市永善县';
$areaArr['530626']='云南省昭通市绥江县';
$areaArr['530627']='云南省昭通市镇雄县';
$areaArr['530628']='云南省昭通市彝良县';
$areaArr['530629']='云南省昭通市威信县';
$areaArr['530630']='云南省昭通市水富县';
$areaArr['530700']='云南省丽江市';
$areaArr['530701']='云南省丽江市';
$areaArr['530702']='云南省丽江市古城区';
$areaArr['530721']='云南省丽江市玉龙纳西族自治县';
$areaArr['530722']='云南省丽江市永胜县';
$areaArr['530723']='云南省丽江市华坪县';
$areaArr['530724']='云南省丽江市宁蒗彝族自治县';
$areaArr['530800']='云南省思茅市';
$areaArr['530801']='云南省思茅市';
$areaArr['530802']='云南省思茅市翠云区';
$areaArr['530821']='云南省思茅市普洱哈尼族彝族自治县';
$areaArr['530822']='云南省思茅市墨江哈尼族自治县';
$areaArr['530823']='云南省思茅市景东彝族自治县';
$areaArr['530824']='云南省思茅市景谷傣族彝族自治县';
$areaArr['530825']='云南省思茅市镇沅彝族哈尼族拉祜族自治县';
$areaArr['530826']='云南省思茅市江城哈尼族彝族自治县';
$areaArr['530827']='云南省思茅市孟连傣族拉祜族佤族自治县';
$areaArr['530828']='云南省思茅市澜沧拉祜族自治县';
$areaArr['530829']='云南省思茅市西盟佤族自治县';
$areaArr['530900']='云南省临沧市';
$areaArr['530901']='云南省临沧市';
$areaArr['530902']='云南省临沧市临翔区';
$areaArr['530921']='云南省临沧市凤庆县';
$areaArr['530922']='云南省临沧市云县';
$areaArr['530923']='云南省临沧市永德县';
$areaArr['530924']='云南省临沧市镇康县';
$areaArr['530925']='云南省临沧市双江拉祜族佤族布朗族傣族自治县';
$areaArr['530926']='云南省临沧市耿马傣族佤族自治县';
$areaArr['530927']='云南省临沧市沧源佤族自治县';
$areaArr['520203']='贵州省六盘水市六枝特区';
$areaArr['520221']='贵州省六盘水市水城县';
$areaArr['520222']='贵州省六盘水市盘县';
$areaArr['520300']='贵州省遵义市';
$areaArr['520301']='贵州省遵义市';
$areaArr['520302']='贵州省遵义市红花岗区';
$areaArr['520303']='贵州省遵义市汇川区';
$areaArr['520321']='贵州省遵义市遵义县';
$areaArr['520322']='贵州省遵义市桐梓县';
$areaArr['520323']='贵州省遵义市绥阳县';
$areaArr['520324']='贵州省遵义市正安县';
$areaArr['520325']='贵州省遵义市道真仡佬族苗族自治县';
$areaArr['520326']='贵州省遵义市务川仡佬族苗族自治县';
$areaArr['520327']='贵州省遵义市凤冈县';
$areaArr['520328']='贵州省遵义市湄潭县';
$areaArr['520329']='贵州省遵义市余庆县';
$areaArr['520330']='贵州省遵义市习水县';
$areaArr['520381']='贵州省遵义市赤水市';
$areaArr['520382']='贵州省遵义市仁怀市';
$areaArr['520400']='贵州省安顺市';
$areaArr['520401']='贵州省安顺市';
$areaArr['520402']='贵州省安顺市西秀区';
$areaArr['520421']='贵州省安顺市平坝县';
$areaArr['520422']='贵州省安顺市普定县';
$areaArr['520423']='贵州省安顺市镇宁布依族苗族自治县';
$areaArr['520424']='贵州省安顺市关岭布依族苗族自治县';
$areaArr['520425']='贵州省安顺市紫云苗族布依族自治县';
$areaArr['522200']='贵州省铜仁地区';
$areaArr['522201']='贵州省铜仁地区铜仁市';
$areaArr['522222']='贵州省铜仁地区江口县';
$areaArr['522223']='贵州省铜仁地区玉屏侗族自治县';
$areaArr['522224']='贵州省铜仁地区石阡县';
$areaArr['522225']='贵州省铜仁地区思南县';
$areaArr['522226']='贵州省铜仁地区印江土家族苗族自治县';
$areaArr['522227']='贵州省铜仁地区德江县';
$areaArr['522228']='贵州省铜仁地区沿河土家族自治县';
$areaArr['522229']='贵州省铜仁地区松桃苗族自治县';
$areaArr['522230']='贵州省铜仁地区万山特区';
$areaArr['522300']='贵州省黔西南布依族苗族自治州';
$areaArr['522301']='贵州省黔西南布依族苗族自治州兴义市';
$areaArr['522322']='贵州省黔西南布依族苗族自治州兴仁县';
$areaArr['522323']='贵州省黔西南布依族苗族自治州普安县';
$areaArr['522324']='贵州省黔西南布依族苗族自治州晴隆县';
$areaArr['522325']='贵州省黔西南布依族苗族自治州贞丰县';
$areaArr['522326']='贵州省黔西南布依族苗族自治州望谟县';
$areaArr['522327']='贵州省黔西南布依族苗族自治州册亨县';
$areaArr['522328']='贵州省黔西南布依族苗族自治州安龙县';
$areaArr['522400']='贵州省毕节地区';
$areaArr['522401']='贵州省毕节地区毕节市';
$areaArr['522422']='贵州省毕节地区大方县';
$areaArr['522423']='贵州省毕节地区黔西县';
$areaArr['522424']='贵州省毕节地区金沙县';
$areaArr['511301']='四川省南充市';
$areaArr['511302']='四川省南充市顺庆区';
$areaArr['511303']='四川省南充市高坪区';
$areaArr['511304']='四川省南充市嘉陵区';
$areaArr['511321']='四川省南充市南部县';
$areaArr['511322']='四川省南充市营山县';
$areaArr['511323']='四川省南充市蓬安县';
$areaArr['511324']='四川省南充市仪陇县';
$areaArr['511325']='四川省南充市西充县';
$areaArr['511381']='四川省南充市阆中市';
$areaArr['511400']='四川省眉山市';
$areaArr['511401']='四川省眉山市';
$areaArr['511402']='四川省眉山市东坡区';
$areaArr['440102']='广东省广州市东山区';
$areaArr['440103']='广东省广州市荔湾区';
$areaArr['440104']='广东省广州市越秀区';
$areaArr['500381']='重庆市江津市';
$areaArr['500382']='重庆市合川市';
$areaArr['500383']='重庆市永川市';
$areaArr['500384']='重庆市南川市';
$areaArr['510000']='四川省';
$areaArr['510100']='四川省成都市';
$areaArr['510101']='四川省成都市';
$areaArr['510104']='四川省成都市锦江区';
$areaArr['510105']='四川省成都市青羊区';
$areaArr['510106']='四川省成都市金牛区';
$areaArr['510107']='四川省成都市武侯区';
$areaArr['510108']='四川省成都市成华区';
$areaArr['510112']='四川省成都市龙泉驿区';
$areaArr['510113']='四川省成都市青白江区';
$areaArr['510114']='四川省成都市新都区';
$areaArr['510115']='四川省成都市温江区';
$areaArr['510121']='四川省成都市金堂县';
$areaArr['510122']='四川省成都市双流县';
$areaArr['510124']='四川省成都市郫县';
$areaArr['510129']='四川省成都市大邑县';
$areaArr['510131']='四川省成都市蒲江县';
$areaArr['510132']='四川省成都市新津县';
$areaArr['510181']='四川省成都市都江堰市';
$areaArr['510182']='四川省成都市彭州市';
$areaArr['510183']='四川省成都市邛崃市';
$areaArr['510184']='四川省成都市崇州市';
$areaArr['510300']='四川省自贡市';
$areaArr['510301']='四川省自贡市';
$areaArr['510302']='四川省自贡市自流井区';
$areaArr['510303']='四川省自贡市贡井区';
$areaArr['510304']='四川省自贡市大安区';
$areaArr['510311']='四川省自贡市沿滩区';
$areaArr['510321']='四川省自贡市荣县';
$areaArr['510322']='四川省自贡市富顺县';
$areaArr['510400']='四川省攀枝花市';
$areaArr['510401']='四川省攀枝花市';
$areaArr['510402']='四川省攀枝花市东区';
$areaArr['510403']='四川省攀枝花市西区';
$areaArr['510411']='四川省攀枝花市仁和区';
$areaArr['510421']='四川省攀枝花市米易县';
$areaArr['510422']='四川省攀枝花市盐边县';
$areaArr['510500']='四川省泸州市';
$areaArr['510501']='四川省泸州市';
$areaArr['510502']='四川省泸州市江阳区';
$areaArr['510503']='四川省泸州市纳溪区';
$areaArr['510504']='四川省泸州市龙马潭区';
$areaArr['510521']='四川省泸州市泸县';
$areaArr['510522']='四川省泸州市合江县';
$areaArr['510524']='四川省泸州市叙永县';
$areaArr['510525']='四川省泸州市古蔺县';
$areaArr['510600']='四川省德阳市';
$areaArr['510601']='四川省德阳市';
$areaArr['510603']='四川省德阳市旌阳区';
$areaArr['510623']='四川省德阳市中江县';
$areaArr['510626']='四川省德阳市罗江县';
$areaArr['510681']='四川省德阳市广汉市';
$areaArr['510682']='四川省德阳市什邡市';
$areaArr['530402']='云南省玉溪市红塔区';
$areaArr['530421']='云南省玉溪市江川县';
$areaArr['530422']='云南省玉溪市澄江县';
$areaArr['510701']='四川省绵阳市';
$areaArr['510703']='四川省绵阳市涪城区';
$areaArr['441702']='广东省阳江市江城区';
$areaArr['441721']='广东省阳江市阳西县';
$areaArr['441723']='广东省阳江市阳东县';
$areaArr['441781']='广东省阳江市阳春市';
$areaArr['441800']='广东省清远市';
$areaArr['441801']='广东省清远市';
$areaArr['441802']='广东省清远市清城区';
$areaArr['441821']='广东省清远市佛冈县';
$areaArr['441823']='广东省清远市阳山县';
$areaArr['441825']='广东省清远市连山壮族瑶族自治县';
$areaArr['441826']='广东省清远市连南瑶族自治县';
$areaArr['441827']='广东省清远市清新县';
$areaArr['441881']='广东省清远市英德市';
$areaArr['441882']='广东省清远市连州市';
$areaArr['441900']='广东省东莞市';
$areaArr['442000']='广东省中山市';
$areaArr['445100']='广东省潮州市';
$areaArr['445101']='广东省潮州市';
$areaArr['445102']='广东省潮州市湘桥区';
$areaArr['445121']='广东省潮州市潮安县';
$areaArr['445122']='广东省潮州市饶平县';
$areaArr['445200']='广东省揭阳市';
$areaArr['445201']='广东省揭阳市';
$areaArr['445202']='广东省揭阳市榕城区';
$areaArr['445221']='广东省揭阳市揭东县';
$areaArr['445222']='广东省揭阳市揭西县';
$areaArr['445224']='广东省揭阳市惠来县';
$areaArr['445281']='广东省揭阳市普宁市';
$areaArr['445300']='广东省云浮市';
$areaArr['513433']='四川省凉山彝族自治州冕宁县';
$areaArr['513434']='四川省凉山彝族自治州越西县';
$areaArr['513435']='四川省凉山彝族自治州甘洛县';
$areaArr['513436']='四川省凉山彝族自治州美姑县';
$areaArr['513437']='四川省凉山彝族自治州雷波县';
$areaArr['520000']='贵州省';
$areaArr['520100']='贵州省贵阳市';
$areaArr['520101']='贵州省贵阳市';
$areaArr['520102']='贵州省贵阳市南明区';
$areaArr['520103']='贵州省贵阳市云岩区';
$areaArr['520111']='贵州省贵阳市花溪区';
$areaArr['520112']='贵州省贵阳市乌当区';
$areaArr['520113']='贵州省贵阳市白云区';
$areaArr['520114']='贵州省贵阳市小河区';
$areaArr['520121']='贵州省贵阳市开阳县';
$areaArr['520122']='贵州省贵阳市息烽县';
$areaArr['520123']='贵州省贵阳市修文县';
$areaArr['520181']='贵州省贵阳市清镇市';
$areaArr['520200']='贵州省六盘水市';
$areaArr['520201']='贵州省六盘水市钟山区';
$areaArr['511421']='四川省眉山市仁寿县';
$areaArr['511422']='四川省眉山市彭山县';
$areaArr['511423']='四川省眉山市洪雅县';
$areaArr['620523']='甘肃省天水市甘谷县';
$areaArr['653024']='新疆维吾尔自治区克孜勒苏柯尔克孜自治州乌恰县';
$areaArr['653100']='新疆维吾尔自治区喀什地区';
$areaArr['653101']='新疆维吾尔自治区喀什地区喀什市';
$areaArr['653121']='新疆维吾尔自治区喀什地区疏附县';
$areaArr['653122']='新疆维吾尔自治区喀什地区疏勒县';
$areaArr['653123']='新疆维吾尔自治区喀什地区英吉沙县';
$areaArr['653124']='新疆维吾尔自治区喀什地区泽普县';
$areaArr['653125']='新疆维吾尔自治区喀什地区莎车县';
$areaArr['653126']='新疆维吾尔自治区喀什地区叶城县';
$areaArr['653127']='新疆维吾尔自治区喀什地区麦盖提县';
$areaArr['653128']='新疆维吾尔自治区喀什地区岳普湖县';
$areaArr['653129']='新疆维吾尔自治区喀什地区伽师县';
$areaArr['653130']='新疆维吾尔自治区喀什地区巴楚县';
$areaArr['653131']='新疆维吾尔自治区喀什地区塔什库尔干塔吉克自治县';
$areaArr['653200']='新疆维吾尔自治区和田地区';
$areaArr['653201']='新疆维吾尔自治区和田地区和田市';
$areaArr['653221']='新疆维吾尔自治区和田地区和田县';
$areaArr['653222']='新疆维吾尔自治区和田地区墨玉县';
$areaArr['653223']='新疆维吾尔自治区和田地区皮山县';
$areaArr['653224']='新疆维吾尔自治区和田地区洛浦县';
$areaArr['653225']='新疆维吾尔自治区和田地区策勒县';
$areaArr['653226']='新疆维吾尔自治区和田地区于田县';
$areaArr['653227']='新疆维吾尔自治区和田地区民丰县';
$areaArr['654000']='新疆维吾尔自治区伊犁哈萨克自治州';
$areaArr['654002']='新疆维吾尔自治区伊犁哈萨克自治州伊宁市';
$areaArr['654003']='新疆维吾尔自治区伊犁哈萨克自治州奎屯市';
$areaArr['654021']='新疆维吾尔自治区伊犁哈萨克自治州伊宁县';
$areaArr['654022']='新疆维吾尔自治区伊犁哈萨克自治州察布查尔锡伯自治县';
$areaArr['654023']='新疆维吾尔自治区伊犁哈萨克自治州霍城县';
$areaArr['654024']='新疆维吾尔自治区伊犁哈萨克自治州巩留县';
$areaArr['654025']='新疆维吾尔自治区伊犁哈萨克自治州新源县';
$areaArr['654026']='新疆维吾尔自治区伊犁哈萨克自治州昭苏县';
$areaArr['654027']='新疆维吾尔自治区伊犁哈萨克自治州特克斯县';
$areaArr['654028']='新疆维吾尔自治区伊犁哈萨克自治州尼勒克县';
$areaArr['654200']='新疆维吾尔自治区塔城地区';
$areaArr['654201']='新疆维吾尔自治区塔城地区塔城市';
$areaArr['654202']='新疆维吾尔自治区塔城地区乌苏市';
$areaArr['654221']='新疆维吾尔自治区塔城地区额敏县';
$areaArr['654223']='新疆维吾尔自治区塔城地区沙湾县';
$areaArr['654224']='新疆维吾尔自治区塔城地区托里县';
$areaArr['654225']='新疆维吾尔自治区塔城地区裕民县';
$areaArr['654226']='新疆维吾尔自治区塔城地区和布克赛尔蒙古自治县';
$areaArr['654300']='新疆维吾尔自治区阿勒泰地区';
$areaArr['654301']='新疆维吾尔自治区阿勒泰地区阿勒泰市';
$areaArr['654321']='新疆维吾尔自治区阿勒泰地区布尔津县';
$areaArr['654322']='新疆维吾尔自治区阿勒泰地区富蕴县';
$areaArr['654323']='新疆维吾尔自治区阿勒泰地区福海县';
$areaArr['654324']='新疆维吾尔自治区阿勒泰地区哈巴河县';
$areaArr['654325']='新疆维吾尔自治区阿勒泰地区青河县';
$areaArr['542333']='西藏自治区日喀则地区仲巴县';
$areaArr['542334']='西藏自治区日喀则地区亚东县';
$areaArr['542335']='西藏自治区日喀则地区吉隆县';
$areaArr['542336']='西藏自治区日喀则地区聂拉木县';
$areaArr['632623']='青海省果洛藏族自治州甘德县';
$areaArr['632624']='青海省果洛藏族自治州达日县';
$areaArr['650108']='新疆维吾尔自治区乌鲁木齐市东山区';
$areaArr['650121']='新疆维吾尔自治区乌鲁木齐市乌鲁木齐县';
$areaArr['650200']='新疆维吾尔自治区克拉玛依市';
$areaArr['650201']='新疆维吾尔自治区克拉玛依市';
$areaArr['650202']='新疆维吾尔自治区克拉玛依市独山子区';
$areaArr['650203']='新疆维吾尔自治区克拉玛依市克拉玛依区';
$areaArr['650204']='新疆维吾尔自治区克拉玛依市白碱滩区';
$areaArr['650205']='新疆维吾尔自治区克拉玛依市乌尔禾区';
$areaArr['652100']='新疆维吾尔自治区吐鲁番地区';
$areaArr['652101']='新疆维吾尔自治区吐鲁番地区吐鲁番市';
$areaArr['652122']='新疆维吾尔自治区吐鲁番地区鄯善县';
$areaArr['652123']='新疆维吾尔自治区吐鲁番地区托克逊县';
$areaArr['652200']='新疆维吾尔自治区哈密地区';
$areaArr['652201']='新疆维吾尔自治区哈密地区哈密市';
$areaArr['652222']='新疆维吾尔自治区哈密地区巴里坤哈萨克自治县';
$areaArr['652223']='新疆维吾尔自治区哈密地区伊吾县';
$areaArr['652300']='新疆维吾尔自治区昌吉回族自治州';
$areaArr['652301']='新疆维吾尔自治区昌吉回族自治州昌吉市';
$areaArr['652302']='新疆维吾尔自治区昌吉回族自治州阜康市';
$areaArr['652303']='新疆维吾尔自治区昌吉回族自治州米泉市';
$areaArr['652323']='新疆维吾尔自治区昌吉回族自治州呼图壁县';
$areaArr['652324']='新疆维吾尔自治区昌吉回族自治州玛纳斯县';
$areaArr['652325']='新疆维吾尔自治区昌吉回族自治州奇台县';
$areaArr['652327']='新疆维吾尔自治区昌吉回族自治州吉木萨尔县';
$areaArr['652328']='新疆维吾尔自治区昌吉回族自治州木垒哈萨克自治县';
$areaArr['652700']='新疆维吾尔自治区博尔塔拉蒙古自治州';
$areaArr['652701']='新疆维吾尔自治区博尔塔拉蒙古自治州博乐市';
$areaArr['652722']='新疆维吾尔自治区博尔塔拉蒙古自治州精河县';
$areaArr['652723']='新疆维吾尔自治区博尔塔拉蒙古自治州温泉县';
$areaArr['652800']='新疆维吾尔自治区巴音郭楞蒙古自治州';
$areaArr['652801']='新疆维吾尔自治区巴音郭楞蒙古自治州库尔勒市';
$areaArr['652822']='新疆维吾尔自治区巴音郭楞蒙古自治州轮台县';
$areaArr['652823']='新疆维吾尔自治区巴音郭楞蒙古自治州尉犁县';
$areaArr['652824']='新疆维吾尔自治区巴音郭楞蒙古自治州若羌县';
$areaArr['652825']='新疆维吾尔自治区巴音郭楞蒙古自治州且末县';
$areaArr['652826']='新疆维吾尔自治区巴音郭楞蒙古自治州焉耆回族自治县';
$areaArr['652827']='新疆维吾尔自治区巴音郭楞蒙古自治州和静县';
$areaArr['652828']='新疆维吾尔自治区巴音郭楞蒙古自治州和硕县';
$areaArr['652829']='新疆维吾尔自治区巴音郭楞蒙古自治州博湖县';
$areaArr['652900']='新疆维吾尔自治区阿克苏地区';
$areaArr['652901']='新疆维吾尔自治区阿克苏地区阿克苏市';
$areaArr['652922']='新疆维吾尔自治区阿克苏地区温宿县';
$areaArr['652923']='新疆维吾尔自治区阿克苏地区库车县';
$areaArr['652924']='新疆维吾尔自治区阿克苏地区沙雅县';
$areaArr['652925']='新疆维吾尔自治区阿克苏地区新和县';
$areaArr['652926']='新疆维吾尔自治区阿克苏地区拜城县';
$areaArr['652927']='新疆维吾尔自治区阿克苏地区乌什县';
$areaArr['652928']='新疆维吾尔自治区阿克苏地区阿瓦提县';
$areaArr['542332']='西藏自治区日喀则地区定结县';
$areaArr['659000']='新疆维吾尔自治区省直辖行政单位';
$areaArr['659001']='新疆维吾尔自治区石河子市';
$areaArr['659002']='新疆维吾尔自治区阿拉尔市';
$areaArr['610730']='陕西省汉中市佛坪县';
$areaArr['610800']='陕西省榆林市';
$areaArr['610801']='陕西省榆林市';
$areaArr['610802']='陕西省榆林市榆阳区';
$areaArr['610821']='陕西省榆林市神木县';
$areaArr['610822']='陕西省榆林市府谷县';
$areaArr['610823']='陕西省榆林市横山县';
$areaArr['610824']='陕西省榆林市靖边县';
$areaArr['610825']='陕西省榆林市定边县';
$areaArr['610826']='陕西省榆林市绥德县';
$areaArr['610827']='陕西省榆林市米脂县';
$areaArr['610828']='陕西省榆林市佳县';
$areaArr['610829']='陕西省榆林市吴堡县';
$areaArr['610830']='陕西省榆林市清涧县';
$areaArr['610831']='陕西省榆林市子洲县';
$areaArr['610900']='陕西省安康市';
$areaArr['610901']='陕西省安康市';
$areaArr['610902']='陕西省安康市汉滨区';
$areaArr['610921']='陕西省安康市汉阴县';
$areaArr['610922']='陕西省安康市石泉县';
$areaArr['610923']='陕西省安康市宁陕县';
$areaArr['610924']='陕西省安康市紫阳县';
$areaArr['610925']='陕西省安康市岚皋县';
$areaArr['610926']='陕西省安康市平利县';
$areaArr['610927']='陕西省安康市镇坪县';
$areaArr['610928']='陕西省安康市旬阳县';
$areaArr['610929']='陕西省安康市白河县';
$areaArr['611000']='陕西省商洛市';
$areaArr['611001']='陕西省商洛市';
$areaArr['611002']='陕西省商洛市商州区';
$areaArr['611021']='陕西省商洛市洛南县';
$areaArr['611022']='陕西省商洛市丹凤县';
$areaArr['611023']='陕西省商洛市商南县';
$areaArr['611024']='陕西省商洛市山阳县';
$areaArr['611025']='陕西省商洛市镇安县';
$areaArr['611026']='陕西省商洛市柞水县';
$areaArr['620000']='甘肃省';
$areaArr['620100']='甘肃省兰州市';
$areaArr['620101']='甘肃省兰州市';
$areaArr['620102']='甘肃省兰州市城关区';
$areaArr['620103']='甘肃省兰州市七里河区';
$areaArr['620104']='甘肃省兰州市西固区';
$areaArr['620105']='甘肃省兰州市安宁区';
$areaArr['620111']='甘肃省兰州市红古区';
$areaArr['620121']='甘肃省兰州市永登县';
$areaArr['620122']='甘肃省兰州市皋兰县';
$areaArr['620123']='甘肃省兰州市榆中县';
$areaArr['620200']='甘肃省嘉峪关市';
$areaArr['620201']='甘肃省嘉峪关市';
$areaArr['620300']='甘肃省金昌市';
$areaArr['620301']='甘肃省金昌市';
$areaArr['620302']='甘肃省金昌市金川区';
$areaArr['620321']='甘肃省金昌市永昌县';
$areaArr['620400']='甘肃省白银市';
$areaArr['620401']='甘肃省白银市';
$areaArr['620402']='甘肃省白银市白银区';
$areaArr['620403']='甘肃省白银市平川区';
$areaArr['620421']='甘肃省白银市靖远县';
$areaArr['620422']='甘肃省白银市会宁县';
$areaArr['620423']='甘肃省白银市景泰县';
$areaArr['632600']='青海省果洛藏族自治州';
$areaArr['632621']='青海省果洛藏族自治州玛沁县';
$areaArr['632622']='青海省果洛藏族自治州班玛县';
$areaArr['620524']='甘肃省天水市武山县';
$areaArr['632625']='青海省果洛藏族自治州久治县';
$areaArr['632626']='青海省果洛藏族自治州玛多县';
$areaArr['632700']='青海省玉树藏族自治州';
$areaArr['632721']='青海省玉树藏族自治州玉树县';
$areaArr['632722']='青海省玉树藏族自治州杂多县';
$areaArr['632723']='青海省玉树藏族自治州称多县';
$areaArr['632724']='青海省玉树藏族自治州治多县';
$areaArr['632725']='青海省玉树藏族自治州囊谦县';
$areaArr['632726']='青海省玉树藏族自治州曲麻莱县';
$areaArr['632800']='青海省海西蒙古族藏族自治州';
$areaArr['632801']='青海省海西蒙古族藏族自治州格尔木市';
$areaArr['632802']='青海省海西蒙古族藏族自治州德令哈市';
$areaArr['632821']='青海省海西蒙古族藏族自治州乌兰县';
$areaArr['632822']='青海省海西蒙古族藏族自治州都兰县';
$areaArr['632823']='青海省海西蒙古族藏族自治州天峻县';
$areaArr['640000']='宁夏回族自治区';
$areaArr['640100']='宁夏回族自治区银川市';
$areaArr['640101']='宁夏回族自治区银川市';
$areaArr['640104']='宁夏回族自治区银川市兴庆区';
$areaArr['640105']='宁夏回族自治区银川市西夏区';
$areaArr['640106']='宁夏回族自治区银川市金凤区';
$areaArr['640121']='宁夏回族自治区银川市永宁县';
$areaArr['640122']='宁夏回族自治区银川市贺兰县';
$areaArr['640181']='宁夏回族自治区银川市灵武市';
$areaArr['640200']='宁夏回族自治区石嘴山市';
$areaArr['640201']='宁夏回族自治区石嘴山市';
$areaArr['640202']='宁夏回族自治区石嘴山市大武口区';
$areaArr['640205']='宁夏回族自治区石嘴山市惠农区';
$areaArr['640221']='宁夏回族自治区石嘴山市平罗县';
$areaArr['640300']='宁夏回族自治区吴忠市';
$areaArr['640301']='宁夏回族自治区吴忠市';
$areaArr['640302']='宁夏回族自治区吴忠市利通区';
$areaArr['640323']='宁夏回族自治区吴忠市盐池县';
$areaArr['640324']='宁夏回族自治区吴忠市同心县';
$areaArr['640381']='宁夏回族自治区吴忠市青铜峡市';
$areaArr['640400']='宁夏回族自治区固原市';
$areaArr['640401']='宁夏回族自治区固原市';
$areaArr['640402']='宁夏回族自治区固原市原州区';
$areaArr['640422']='宁夏回族自治区固原市西吉县';
$areaArr['640423']='宁夏回族自治区固原市隆德县';
$areaArr['640424']='宁夏回族自治区固原市泾源县';
$areaArr['640425']='宁夏回族自治区固原市彭阳县';
$areaArr['640500']='宁夏回族自治区中卫市';
$areaArr['640501']='宁夏回族自治区中卫市';
$areaArr['640502']='宁夏回族自治区中卫市沙坡头区';
$areaArr['640521']='宁夏回族自治区中卫市中宁县';
$areaArr['640522']='宁夏回族自治区中卫市海原县';
$areaArr['650000']='新疆维吾尔自治区';
$areaArr['650100']='新疆维吾尔自治区乌鲁木齐市';
$areaArr['650101']='新疆维吾尔自治区乌鲁木齐市';
$areaArr['650102']='新疆维吾尔自治区乌鲁木齐市天山区';
$areaArr['650103']='新疆维吾尔自治区乌鲁木齐市沙依巴克区';
$areaArr['610304']='陕西省宝鸡市陈仓区';
$areaArr['451322']='广西壮族自治区来宾市象州县';
$areaArr['451323']='广西壮族自治区来宾市武宣县';
$areaArr['451324']='广西壮族自治区来宾市金秀瑶族自治县';
$areaArr['451381']='广西壮族自治区来宾市合山市';
$areaArr['451400']='广西壮族自治区崇左市';
$areaArr['451401']='广西壮族自治区崇左市';
$areaArr['451402']='广西壮族自治区崇左市江洲区';
$areaArr['451421']='广西壮族自治区崇左市扶绥县';
$areaArr['451422']='广西壮族自治区崇左市宁明县';
$areaArr['451423']='广西壮族自治区崇左市龙州县';
$areaArr['451424']='广西壮族自治区崇左市大新县';
$areaArr['451425']='广西壮族自治区崇左市天等县';
$areaArr['451481']='广西壮族自治区崇左市凭祥市';
$areaArr['460000']='海南省';
$areaArr['440784']='广东省江门市鹤山市';
$areaArr['460106']='海南省海口市龙华区';
$areaArr['450225']='广西壮族自治区柳州市融水苗族自治县';
$areaArr['450226']='广西壮族自治区柳州市三江侗族自治县';
$areaArr['450300']='广西壮族自治区桂林市';
$areaArr['450301']='广西壮族自治区桂林市';
$areaArr['450302']='广西壮族自治区桂林市秀峰区';
$areaArr['450303']='广西壮族自治区桂林市叠彩区';
$areaArr['450304']='广西壮族自治区桂林市象山区';
$areaArr['450305']='广西壮族自治区桂林市七星区';
$areaArr['450311']='广西壮族自治区桂林市雁山区';
$areaArr['450321']='广西壮族自治区桂林市阳朔县';
$areaArr['450322']='广西壮族自治区桂林市临桂县';
$areaArr['450323']='广西壮族自治区桂林市灵川县';
$areaArr['450324']='广西壮族自治区桂林市全州县';
$areaArr['450325']='广西壮族自治区桂林市兴安县';
$areaArr['450326']='广西壮族自治区桂林市永福县';
$areaArr['450327']='广西壮族自治区桂林市灌阳县';
$areaArr['450328']='广西壮族自治区桂林市龙胜各族自治县';
$areaArr['450329']='广西壮族自治区桂林市资源县';
$areaArr['450330']='广西壮族自治区桂林市平乐县';
$areaArr['450331']='广西壮族自治区桂林市荔蒲县';
$areaArr['450332']='广西壮族自治区桂林市恭城瑶族自治县';
$areaArr['450400']='广西壮族自治区梧州市';
$areaArr['450401']='广西壮族自治区梧州市';
$areaArr['450403']='广西壮族自治区梧州市万秀区';
$areaArr['450404']='广西壮族自治区梧州市蝶山区';
$areaArr['450405']='广西壮族自治区梧州市长洲区';
$areaArr['450421']='广西壮族自治区梧州市苍梧县';
$areaArr['450422']='广西壮族自治区梧州市藤县';
$areaArr['450423']='广西壮族自治区梧州市蒙山县';
$areaArr['450481']='广西壮族自治区梧州市岑溪市';
$areaArr['450500']='广西壮族自治区北海市';
$areaArr['450501']='广西壮族自治区北海市';
$areaArr['450502']='广西壮族自治区北海市海城区';
$areaArr['450503']='广西壮族自治区北海市银海区';
$areaArr['450512']='广西壮族自治区北海市铁山港区';
$areaArr['450521']='广西壮族自治区北海市合浦县';
$areaArr['450600']='广西壮族自治区防城港市';
$areaArr['450601']='广西壮族自治区防城港市';
$areaArr['450602']='广西壮族自治区防城港市港口区';
$areaArr['450603']='广西壮族自治区防城港市防城区';
$areaArr['450621']='广西壮族自治区防城港市上思县';
$areaArr['450681']='广西壮族自治区防城港市东兴市';
$areaArr['450700']='广西壮族自治区钦州市';
$areaArr['450701']='广西壮族自治区钦州市';
$areaArr['450702']='广西壮族自治区钦州市钦南区';
$areaArr['450703']='广西壮族自治区钦州市钦北区';
$areaArr['450721']='广西壮族自治区钦州市灵山县';
$areaArr['450722']='广西壮族自治区钦州市浦北县';
$areaArr['450800']='广西壮族自治区贵港市';
$areaArr['450801']='广西壮族自治区贵港市';
$areaArr['450802']='广西壮族自治区贵港市港北区';
$areaArr['450803']='广西壮族自治区贵港市港南区';
$areaArr['450804']='广西壮族自治区贵港市覃塘区';
$areaArr['450821']='广西壮族自治区贵港市平南县';
$areaArr['450881']='广西壮族自治区贵港市桂平市';
$areaArr['450900']='广西壮族自治区玉林市';
$areaArr['510683']='四川省德阳市绵竹市';
$areaArr['510700']='四川省绵阳市';
$areaArr['522626']='贵州省黔东南苗族侗族自治州岑巩县';
$areaArr['522627']='贵州省黔东南苗族侗族自治州天柱县';
$areaArr['522628']='贵州省黔东南苗族侗族自治州锦屏县';
$areaArr['522629']='贵州省黔东南苗族侗族自治州剑河县';
$areaArr['522630']='贵州省黔东南苗族侗族自治州台江县';
$areaArr['522631']='贵州省黔东南苗族侗族自治州黎平县';
$areaArr['522632']='贵州省黔东南苗族侗族自治州榕江县';
$areaArr['522633']='贵州省黔东南苗族侗族自治州从江县';
$areaArr['522634']='贵州省黔东南苗族侗族自治州雷山县';
$areaArr['522635']='贵州省黔东南苗族侗族自治州麻江县';
$areaArr['522636']='贵州省黔东南苗族侗族自治州丹寨县';
$areaArr['522700']='贵州省黔南布依族苗族自治州';
$areaArr['522701']='贵州省黔南布依族苗族自治州都匀市';
$areaArr['522702']='贵州省黔南布依族苗族自治州福泉市';
$areaArr['522722']='贵州省黔南布依族苗族自治州荔波县';
$areaArr['522723']='贵州省黔南布依族苗族自治州贵定县';
$areaArr['522725']='贵州省黔南布依族苗族自治州瓮安县';
$areaArr['522726']='贵州省黔南布依族苗族自治州独山县';
$areaArr['522727']='贵州省黔南布依族苗族自治州平塘县';
$areaArr['522728']='贵州省黔南布依族苗族自治州罗甸县';
$areaArr['522729']='贵州省黔南布依族苗族自治州长顺县';
$areaArr['522730']='贵州省黔南布依族苗族自治州龙里县';
$areaArr['522731']='贵州省黔南布依族苗族自治州惠水县';
$areaArr['522732']='贵州省黔南布依族苗族自治州三都水族自治县';
$areaArr['530000']='云南省';
$areaArr['530100']='云南省昆明市';
$areaArr['530101']='云南省昆明市';
$areaArr['530102']='云南省昆明市五华区';
$areaArr['530103']='云南省昆明市盘龙区';
$areaArr['621222']='甘肃省陇南市文县';
$areaArr['621223']='甘肃省陇南市宕昌县';
$areaArr['621224']='甘肃省陇南市康县';
$areaArr['542337']='西藏自治区日喀则地区萨嘎县';
$areaArr['542338']='西藏自治区日喀则地区岗巴县';
$areaArr['610328']='陕西省宝鸡市千阳县';
$areaArr['610329']='陕西省宝鸡市麟游县';
$areaArr['610330']='陕西省宝鸡市凤县';
$areaArr['610331']='陕西省宝鸡市太白县';
$areaArr['610400']='陕西省咸阳市';
$areaArr['610401']='陕西省咸阳市';
$areaArr['610402']='陕西省咸阳市秦都区';
$areaArr['610403']='陕西省咸阳市杨凌区';
$areaArr['610404']='陕西省咸阳市渭城区';
$areaArr['610422']='陕西省咸阳市三原县';
$areaArr['610423']='陕西省咸阳市泾阳县';
$areaArr['610424']='陕西省咸阳市乾县';
$areaArr['610425']='陕西省咸阳市礼泉县';
$areaArr['610426']='陕西省咸阳市永寿县';
$areaArr['610427']='陕西省咸阳市彬县';
$areaArr['610428']='陕西省咸阳市长武县';
$areaArr['610429']='陕西省咸阳市旬邑县';
$areaArr['610430']='陕西省咸阳市淳化县';
$areaArr['610431']='陕西省咸阳市武功县';
$areaArr['610481']='陕西省咸阳市兴平市';
$areaArr['610500']='陕西省渭南市';
$areaArr['610501']='陕西省渭南市';
$areaArr['610502']='陕西省渭南市临渭区';
$areaArr['610521']='陕西省渭南市华县';
$areaArr['610522']='陕西省渭南市潼关县';
$areaArr['610523']='陕西省渭南市大荔县';
$areaArr['610524']='陕西省渭南市合阳县';
$areaArr['610525']='陕西省渭南市澄城县';
$areaArr['610526']='陕西省渭南市蒲城县';
$areaArr['610527']='陕西省渭南市白水县';
$areaArr['610528']='陕西省渭南市富平县';
$areaArr['610581']='陕西省渭南市韩城市';
$areaArr['610582']='陕西省渭南市华阴市';
$areaArr['610600']='陕西省延安市';
$areaArr['610601']='陕西省延安市';
$areaArr['610602']='陕西省延安市宝塔区';
$areaArr['610621']='陕西省延安市延长县';
$areaArr['610622']='陕西省延安市延川县';
$areaArr['610623']='陕西省延安市子长县';
$areaArr['610624']='陕西省延安市安塞县';
$areaArr['610625']='陕西省延安市志丹县';
$areaArr['610626']='陕西省延安市吴旗县';
$areaArr['610627']='陕西省延安市甘泉县';
$areaArr['610628']='陕西省延安市富县';
$areaArr['610629']='陕西省延安市洛川县';
$areaArr['610630']='陕西省延安市宜川县';
$areaArr['610631']='陕西省延安市黄龙县';
$areaArr['610632']='陕西省延安市黄陵县';
$areaArr['610700']='陕西省汉中市';
$areaArr['610701']='陕西省汉中市';
$areaArr['610702']='陕西省汉中市汉台区';
$areaArr['610721']='陕西省汉中市南郑县';
$areaArr['610722']='陕西省汉中市城固县';
$areaArr['610723']='陕西省汉中市洋县';
$areaArr['610724']='陕西省汉中市西乡县';
$areaArr['610725']='陕西省汉中市勉县';
$areaArr['610726']='陕西省汉中市宁强县';
$areaArr['620501']='甘肃省天水市';
$areaArr['620502']='甘肃省天水市秦城区';
$areaArr['620503']='甘肃省天水市北道区';
$areaArr['620521']='甘肃省天水市清水县';
$areaArr['620522']='甘肃省天水市秦安县';
$areaArr['542400']='西藏自治区那曲地区';
$areaArr['542421']='西藏自治区那曲地区那曲县';
$areaArr['542422']='西藏自治区那曲地区嘉黎县';
$areaArr['542423']='西藏自治区那曲地区比如县';
$areaArr['542424']='西藏自治区那曲地区聂荣县';
$areaArr['542425']='西藏自治区那曲地区安多县';
$areaArr['542426']='西藏自治区那曲地区申扎县';
$areaArr['542427']='西藏自治区那曲地区索县';
$areaArr['542428']='西藏自治区那曲地区班戈县';
$areaArr['542429']='西藏自治区那曲地区巴青县';
$areaArr['542430']='西藏自治区那曲地区尼玛县';
$areaArr['542500']='西藏自治区阿里地区';
$areaArr['542521']='西藏自治区阿里地区普兰县';
$areaArr['542522']='西藏自治区阿里地区札达县';
$areaArr['542523']='西藏自治区阿里地区噶尔县';
$areaArr['542524']='西藏自治区阿里地区日土县';
$areaArr['542525']='西藏自治区阿里地区革吉县';
$areaArr['542526']='西藏自治区阿里地区改则县';
$areaArr['542527']='西藏自治区阿里地区措勤县';
$areaArr['542600']='西藏自治区林芝地区';
$areaArr['542621']='西藏自治区林芝地区林芝县';
$areaArr['542622']='西藏自治区林芝地区工布江达县';
$areaArr['542623']='西藏自治区林芝地区米林县';
$areaArr['542624']='西藏自治区林芝地区墨脱县';
$areaArr['542625']='西藏自治区林芝地区波密县';
$areaArr['542626']='西藏自治区林芝地区察隅县';
$areaArr['542627']='西藏自治区林芝地区朗县';
$areaArr['610000']='陕西省';
$areaArr['610100']='陕西省西安市';
$areaArr['610101']='陕西省西安市';
$areaArr['610102']='陕西省西安市新城区';
$areaArr['610103']='陕西省西安市碑林区';
$areaArr['610104']='陕西省西安市莲湖区';
$areaArr['610111']='陕西省西安市灞桥区';
$areaArr['610112']='陕西省西安市未央区';
$areaArr['610113']='陕西省西安市雁塔区';
$areaArr['610114']='陕西省西安市阎良区';
$areaArr['610115']='陕西省西安市临潼区';
$areaArr['610116']='陕西省西安市长安区';
$areaArr['610122']='陕西省西安市蓝田县';
$areaArr['610124']='陕西省西安市周至县';
$areaArr['610125']='陕西省西安市户县';
$areaArr['610126']='陕西省西安市高陵县';
$areaArr['610200']='陕西省铜川市';
$areaArr['610201']='陕西省铜川市';
$areaArr['610202']='陕西省铜川市王益区';
$areaArr['610203']='陕西省铜川市印台区';
$areaArr['610204']='陕西省铜川市耀州区';
$areaArr['610222']='陕西省铜川市宜君县';
$areaArr['610300']='陕西省宝鸡市';
$areaArr['610301']='陕西省宝鸡市';
$areaArr['610302']='陕西省宝鸡市渭滨区';
$areaArr['610303']='陕西省宝鸡市金台区';
$areaArr['654326']='新疆维吾尔自治区阿勒泰地区吉木乃县';
$areaArr['632525']='青海省海南藏族自治州贵南县';
$areaArr['650104']='新疆维吾尔自治区乌鲁木齐市新市区';
$areaArr['650105']='新疆维吾尔自治区乌鲁木齐市水磨沟区';
$areaArr['650106']='新疆维吾尔自治区乌鲁木齐市头屯河区';
$areaArr['621225']='甘肃省陇南市西和县';
$areaArr['621226']='甘肃省陇南市礼县';
$areaArr['621227']='甘肃省陇南市徽县';
$areaArr['621228']='甘肃省陇南市两当县';
$areaArr['622900']='甘肃省临夏回族自治州';
$areaArr['622901']='甘肃省临夏回族自治州临夏市';
$areaArr['622921']='甘肃省临夏回族自治州临夏县';
$areaArr['622922']='甘肃省临夏回族自治州康乐县';
$areaArr['622923']='甘肃省临夏回族自治州永靖县';
$areaArr['622924']='甘肃省临夏回族自治州广河县';
$areaArr['622925']='甘肃省临夏回族自治州和政县';
$areaArr['622926']='甘肃省临夏回族自治州东乡族自治县';
$areaArr['622927']='甘肃省临夏回族自治州积石山保安族东乡族撒拉族自治县';
$areaArr['623000']='甘肃省甘南藏族自治州';
$areaArr['623001']='甘肃省甘南藏族自治州合作市';
$areaArr['623021']='甘肃省甘南藏族自治州临潭县';
$areaArr['623022']='甘肃省甘南藏族自治州卓尼县';
$areaArr['623023']='甘肃省甘南藏族自治州舟曲县';
$areaArr['623024']='甘肃省甘南藏族自治州迭部县';
$areaArr['623025']='甘肃省甘南藏族自治州玛曲县';
$areaArr['623026']='甘肃省甘南藏族自治州碌曲县';
$areaArr['623027']='甘肃省甘南藏族自治州夏河县';
$areaArr['630000']='青海省';
$areaArr['630100']='青海省西宁市';
$areaArr['630101']='青海省西宁市';
$areaArr['630102']='青海省西宁市城东区';
$areaArr['630103']='青海省西宁市城中区';
$areaArr['630104']='青海省西宁市城西区';
$areaArr['630105']='青海省西宁市城北区';
$areaArr['630121']='青海省西宁市大通回族土族自治县';
$areaArr['630122']='青海省西宁市湟中县';
$areaArr['630123']='青海省西宁市湟源县';
$areaArr['632100']='青海省海东地区';
$areaArr['632121']='青海省海东地区平安县';
$areaArr['632122']='青海省海东地区民和回族土族自治县';
$areaArr['632123']='青海省海东地区乐都县';
$areaArr['632126']='青海省海东地区互助土族自治县';
$areaArr['632127']='青海省海东地区化隆回族自治县';
$areaArr['632128']='青海省海东地区循化撒拉族自治县';
$areaArr['632200']='青海省海北藏族自治州';
$areaArr['632221']='青海省海北藏族自治州门源回族自治县';
$areaArr['632222']='青海省海北藏族自治州祁连县';
$areaArr['632223']='青海省海北藏族自治州海晏县';
$areaArr['632224']='青海省海北藏族自治州刚察县';
$areaArr['632300']='青海省黄南藏族自治州';
$areaArr['632321']='青海省黄南藏族自治州同仁县';
$areaArr['632322']='青海省黄南藏族自治州尖扎县';
$areaArr['632323']='青海省黄南藏族自治州泽库县';
$areaArr['632324']='青海省黄南藏族自治州河南蒙古族自治县';
$areaArr['632500']='青海省海南藏族自治州';
$areaArr['632521']='青海省海南藏族自治州共和县';
$areaArr['632522']='青海省海南藏族自治州同德县';
$areaArr['632523']='青海省海南藏族自治州贵德县';
$areaArr['632524']='青海省海南藏族自治州兴海县';
$areaArr['652929']='新疆维吾尔自治区阿克苏地区柯坪县';
$areaArr['610322']='陕西省宝鸡市凤翔县';
$areaArr['610323']='陕西省宝鸡市岐山县';
$areaArr['610324']='陕西省宝鸡市扶风县';
$areaArr['610326']='陕西省宝鸡市眉县';
$areaArr['610327']='陕西省宝鸡市陇县';
$areaArr['650107']='新疆维吾尔自治区乌鲁木齐市达坂城区';
$areaArr['620525']='甘肃省天水市张家川回族自治县';
$areaArr['620600']='甘肃省武威市';
$areaArr['620601']='甘肃省武威市';
$areaArr['620602']='甘肃省武威市凉州区';
$areaArr['620621']='甘肃省武威市民勤县';
$areaArr['620622']='甘肃省武威市古浪县';
$areaArr['620623']='甘肃省武威市天祝藏族自治县';
$areaArr['620700']='甘肃省张掖市';
$areaArr['620701']='甘肃省张掖市';
$areaArr['620702']='甘肃省张掖市甘州区';
$areaArr['620721']='甘肃省张掖市肃南裕固族自治县';
$areaArr['620722']='甘肃省张掖市民乐县';
$areaArr['620723']='甘肃省张掖市临泽县';
$areaArr['620724']='甘肃省张掖市高台县';
$areaArr['620725']='甘肃省张掖市山丹县';
$areaArr['620800']='甘肃省平凉市';
$areaArr['620801']='甘肃省平凉市';
$areaArr['620802']='甘肃省平凉市崆峒区';
$areaArr['620821']='甘肃省平凉市泾川县';
$areaArr['620822']='甘肃省平凉市灵台县';
$areaArr['620823']='甘肃省平凉市崇信县';
$areaArr['620824']='甘肃省平凉市华亭县';
$areaArr['620825']='甘肃省平凉市庄浪县';
$areaArr['620826']='甘肃省平凉市静宁县';
$areaArr['620900']='甘肃省酒泉市';
$areaArr['620901']='甘肃省酒泉市';
$areaArr['620902']='甘肃省酒泉市肃州区';
$areaArr['620921']='甘肃省酒泉市金塔县';
$areaArr['620922']='甘肃省酒泉市安西县';
$areaArr['620923']='甘肃省酒泉市肃北蒙古族自治县';
$areaArr['620924']='甘肃省酒泉市阿克塞哈萨克族自治县';
$areaArr['620981']='甘肃省酒泉市玉门市';
$areaArr['620982']='甘肃省酒泉市敦煌市';
$areaArr['621000']='甘肃省庆阳市';
$areaArr['621001']='甘肃省庆阳市';
$areaArr['621002']='甘肃省庆阳市西峰区';
$areaArr['621021']='甘肃省庆阳市庆城县';
$areaArr['621022']='甘肃省庆阳市环县';
$areaArr['621023']='甘肃省庆阳市华池县';
$areaArr['621024']='甘肃省庆阳市合水县';
$areaArr['621025']='甘肃省庆阳市正宁县';
$areaArr['621026']='甘肃省庆阳市宁县';
$areaArr['621027']='甘肃省庆阳市镇原县';
$areaArr['621100']='甘肃省定西市';
$areaArr['621101']='甘肃省定西市';
$areaArr['621102']='甘肃省定西市安定区';
$areaArr['621121']='甘肃省定西市通渭县';
$areaArr['621122']='甘肃省定西市陇西县';
$areaArr['621123']='甘肃省定西市渭源县';
$areaArr['621124']='甘肃省定西市临洮县';
$areaArr['621125']='甘肃省定西市漳县';
$areaArr['621126']='甘肃省定西市岷县';
$areaArr['621200']='甘肃省陇南市';
$areaArr['621201']='甘肃省陇南市';
$areaArr['621202']='甘肃省陇南市武都区';
$areaArr['621221']='甘肃省陇南市成县';
$areaArr['653000']='新疆维吾尔自治区克孜勒苏柯尔克孜自治州';
$areaArr['653001']='新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿图什市';
$areaArr['653022']='新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿克陶县';
$areaArr['653023']='新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿合奇县';
$areaArr['659003']='新疆维吾尔自治区图木舒克市';
$areaArr['659004']='新疆维吾尔自治区五家渠市';
$areaArr['710000']='台湾省';
$areaArr['810000']='香港特别行政区';
$areaArr['820000']='澳门特别行政区';
$areaArr['A00000']='亚洲';
$areaArr['B00000']='非洲';
$areaArr['C00000']='欧洲';
$areaArr['D00000']='美洲';
$areaArr['E00000']='大洋洲';
$areaArr['F01000']='南极洲';
$areaArr['ZZZZZZ']='其它';
$areaArr['522425']='贵州省毕节地区织金县';
$areaArr['522426']='贵州省毕节地区纳雍县';
$areaArr['522427']='贵州省毕节地区威宁彝族回族苗族自治县';
$areaArr['522428']='贵州省毕节地区赫章县';
$areaArr['522600']='贵州省黔东南苗族侗族自治州';
$areaArr['522601']='贵州省黔东南苗族侗族自治州凯里市';
$areaArr['522622']='贵州省黔东南苗族侗族自治州黄平县';
$areaArr['522623']='贵州省黔东南苗族侗族自治州施秉县';
$areaArr['522624']='贵州省黔东南苗族侗族自治州三穗县';
$areaArr['513230']='四川省阿坝藏族羌族自治州壤塘县';
$areaArr['511425']='四川省眉山市青神县';
$areaArr['511500']='四川省宜宾市';
$areaArr['511501']='四川省宜宾市';
$areaArr['511502']='四川省宜宾市翠屏区';
$areaArr['511521']='四川省宜宾市宜宾县';
$areaArr['511522']='四川省宜宾市南溪县';
$areaArr['511523']='四川省宜宾市江安县';
$areaArr['511524']='四川省宜宾市长宁县';
$areaArr['511525']='四川省宜宾市高县';
$areaArr['511526']='四川省宜宾市珙县';
$areaArr['511527']='四川省宜宾市筠连县';
$areaArr['511528']='四川省宜宾市兴文县';
$areaArr['511529']='四川省宜宾市屏山县';
$areaArr['511600']='四川省广安市';
$areaArr['511601']='四川省广安市';
$areaArr['511602']='四川省广安市广安区';
$areaArr['511621']='四川省广安市岳池县';
$areaArr['511622']='四川省广安市武胜县';
$areaArr['511623']='四川省广安市邻水县';
$areaArr['511681']='四川省广安市华莹市';
$areaArr['511700']='四川省达州市';
$areaArr['511701']='四川省达州市';
$areaArr['511702']='四川省达州市通川区';
$areaArr['511721']='四川省达州市达县';
$areaArr['511722']='四川省达州市宣汉县';
$areaArr['511723']='四川省达州市开江县';
$areaArr['511724']='四川省达州市大竹县';
$areaArr['511725']='四川省达州市渠县';
$areaArr['511781']='四川省达州市万源市';
$areaArr['511800']='四川省雅安市';
$areaArr['511801']='四川省雅安市';
$areaArr['511802']='四川省雅安市雨城区';
$areaArr['511821']='四川省雅安市名山县';
$areaArr['511822']='四川省雅安市荥经县';
$areaArr['511823']='四川省雅安市汉源县';
$areaArr['511824']='四川省雅安市石棉县';
$areaArr['511825']='四川省雅安市天全县';
$areaArr['511826']='四川省雅安市芦山县';
$areaArr['511827']='四川省雅安市宝兴县';
$areaArr['511900']='四川省巴中市';
$areaArr['511901']='四川省巴中市';
$areaArr['511902']='四川省巴中市巴州区';
$areaArr['511921']='四川省巴中市通江县';
$areaArr['511922']='四川省巴中市南江县';
$areaArr['511923']='四川省巴中市平昌县';
$areaArr['512000']='四川省资阳市';
$areaArr['512001']='四川省资阳市';
$areaArr['512002']='四川省资阳市雁江区';
$areaArr['512021']='四川省资阳市安岳县';
$areaArr['512022']='四川省资阳市乐至县';
$areaArr['512081']='四川省资阳市简阳市';
$areaArr['513200']='四川省阿坝藏族羌族自治州';
$areaArr['513221']='四川省阿坝藏族羌族自治州汶川县';
$areaArr['513222']='四川省阿坝藏族羌族自治州理县';
$areaArr['513223']='四川省阿坝藏族羌族自治州茂县';
$areaArr['513224']='四川省阿坝藏族羌族自治州松潘县';
$areaArr['513225']='四川省阿坝藏族羌族自治州九寨沟县';
$areaArr['513226']='四川省阿坝藏族羌族自治州金川县';
$areaArr['532300']='云南省楚雄彝族自治州';
$areaArr['532301']='云南省楚雄彝族自治州楚雄市';
$areaArr['532322']='云南省楚雄彝族自治州双柏县';
$areaArr['530423']='云南省玉溪市通海县';
$areaArr['513231']='四川省阿坝藏族羌族自治州阿坝县';
$areaArr['513232']='四川省阿坝藏族羌族自治州若尔盖县';
$areaArr['513233']='四川省阿坝藏族羌族自治州红原县';
$areaArr['513300']='四川省甘孜藏族自治州';
$areaArr['513321']='四川省甘孜藏族自治州康定县';
$areaArr['513322']='四川省甘孜藏族自治州泸定县';
$areaArr['513323']='四川省甘孜藏族自治州丹巴县';
$areaArr['513324']='四川省甘孜藏族自治州九龙县';
$areaArr['513325']='四川省甘孜藏族自治州雅江县';
$areaArr['513326']='四川省甘孜藏族自治州道孚县';
$areaArr['513327']='四川省甘孜藏族自治州炉霍县';
$areaArr['513328']='四川省甘孜藏族自治州甘孜县';
$areaArr['513329']='四川省甘孜藏族自治州新龙县';
$areaArr['513330']='四川省甘孜藏族自治州德格县';
$areaArr['513331']='四川省甘孜藏族自治州白玉县';
$areaArr['513332']='四川省甘孜藏族自治州石渠县';
$areaArr['513333']='四川省甘孜藏族自治州色达县';
$areaArr['513334']='四川省甘孜藏族自治州理塘县';
$areaArr['513335']='四川省甘孜藏族自治州巴塘县';
$areaArr['513336']='四川省甘孜藏族自治州乡城县';
$areaArr['513337']='四川省甘孜藏族自治州稻城县';
$areaArr['513338']='四川省甘孜藏族自治州得荣县';
$areaArr['513400']='四川省凉山彝族自治州';
$areaArr['513401']='四川省凉山彝族自治州西昌市';
$areaArr['513422']='四川省凉山彝族自治州木里藏族自治县';
$areaArr['513423']='四川省凉山彝族自治州盐源县';
$areaArr['513424']='四川省凉山彝族自治州德昌县';
$areaArr['513425']='四川省凉山彝族自治州会理县';
$areaArr['513426']='四川省凉山彝族自治州会东县';
$areaArr['513427']='四川省凉山彝族自治州宁南县';
$areaArr['513428']='四川省凉山彝族自治州普格县';
$areaArr['513429']='四川省凉山彝族自治州布拖县';
$areaArr['513430']='四川省凉山彝族自治州金阳县';
$areaArr['513431']='四川省凉山彝族自治州昭觉县';
$areaArr['513432']='四川省凉山彝族自治州喜德县';
$areaArr['513025']='四川省达川地区通江县';
$areaArr['320821']='江苏省淮安市淮阴县';
$areaArr['370111']='山东省济南市郊区';
$areaArr['513701']='四川省巴中地区巴中市';
$areaArr['513023']='四川省达川地区开江县';
$areaArr['422302']='湖北省咸宁地区赤壁市';
$areaArr['362422']='江西省吉安地区吉水县';
$areaArr['132235']='河北省邢台地区威县';
$areaArr['110227']='北京市怀柔县';
$areaArr['642221']='宁夏回族自治区固原地区固原县';
$areaArr['342623']='安徽省巢湖地区无为县';
$areaArr['132828']='河北省廊坊地区文安县';
$areaArr['420621']='湖北省襄樊市襄阳县';
$areaArr['342401']='安徽省六安地区六安市';
$areaArr['452528']='广西壮族自治区玉林地区博白县';
$areaArr['142731']='山西省运城地区绛县';
$areaArr['510102']='四川省成都市东城区';
$areaArr['142703']='山西省运城地区河津市';
$areaArr['362227']='江西省宜春地区万载县';
$areaArr['321321']='江苏省宿迁市宿豫县';
$areaArr['432503']='湖南省娄底地区涟源市';
$areaArr['422324']='湖北省咸宁地区通城县';
$areaArr['522101']='贵州省遵义地区遵义市';
$areaArr['622628']='甘肃省陇南地区礼县';
$areaArr['142725']='山西省运城地区万荣县';
$areaArr['441425']='广东省梅州市兴宁县';
$areaArr['450121']='广西壮族自治区南宁市邕宁县';
$areaArr['510211']='四川省重庆市江北区';
$areaArr['210225']='辽宁省大连市庄河县';
$areaArr['412301']='河南省商丘地区商丘市';
$areaArr['433027']='湖南省怀化地区芷江县';
$areaArr['432522']='湖南省娄底地区双峰县';
$areaArr['422202']='湖北省孝感地区应城市';
$areaArr['132337']='河北省石家庄市行唐县';
$areaArr['430425']='湖南省衡阳市常宁县';
$areaArr['330725']='浙江省金华市义乌县';
$areaArr['330719']='浙江省金华市兰溪市';
$areaArr['452424']='广西壮族自治区贺州地区昭平县';
$areaArr['452130']='广西壮族自治区南宁地区大新县';
$areaArr['132928']='河北省沧州地区南皮县';
$areaArr['362426']='江西省吉安地区泰和县';
$areaArr['320112']='江苏省南京市大厂区';
$areaArr['360621']='江西省鹰潭市贵溪县';
$areaArr['440681']='广东省佛山市顺德市';
$areaArr['441321']='广东省惠州市惠阳县';
$areaArr['372822']='山东省临沂地区郯城县';
$areaArr['522501']='贵州省安顺地区安顺市';
$areaArr['432823']='湖南省郴州地区永兴县';
$areaArr['142729']='山西省运城地区闻喜县';
$areaArr['330219']='浙江省宁波市余姚市';
$areaArr['342127']='安徽省阜阳地区阜南县';
$areaArr['330821']='浙江省衢州市衢县';
$areaArr['362201']='江西省宜春地区宜春市';
$areaArr['440682']='广东省佛山市南海市';
$areaArr['372325']='山东省滨州地区沾化县';
$areaArr['422422']='湖北省荆州地区松滋县';
$areaArr['310226']='上海市奉贤县';
$areaArr['132522']='河北省张家口地区康保县';
$areaArr['342530']='安徽省宣城地区旌德县';
$areaArr['532723']='云南省思茅地区墨江哈尼族自治县';
$areaArr['140104']='山西省太原市河西区';
$areaArr['362401']='江西省吉安地区吉安市';
$areaArr['411123']='河南省漯河市郾城县';
$areaArr['440421']='广东省珠海市斗门县';
$areaArr['362132']='江西省赣州地区于都县';
$areaArr['362301']='江西省上饶地区上饶市';
$areaArr['410504']='河南省安阳市铁西区';
$areaArr['422228']='湖北省孝感地区汉川县';
$areaArr['441228']='广东省肇庆市新兴县';
$areaArr['622624']='甘肃省陇南地区成县';

$areaArr['362331']='江西省上饶地区万年县';

$areaArr['452501']='广西壮族自治区玉林地区玉林市';

$areaArr['422426']='湖北省荆州地区洪湖县';

$areaArr['512924']='四川省南充地区营山县';

$areaArr['362427']='江西省吉安地区遂川县';

$areaArr['440582']='广东省汕头市潮阳市';

$areaArr['321083']='江苏省扬州市兴化市';

$areaArr['460002']='海南省海南省琼海市';

$areaArr['142226']='山西省忻州地区繁峙县';

$areaArr['440508']='广东省汕头市金园区';

$areaArr['512927']='四川省南充地区仪陇县';

$areaArr['640102']='宁夏回族自治区银川市城区';

$areaArr['510212']='四川省重庆市沙坪坝区';

$areaArr['460028']='海南省海南省临高县';

$areaArr['413026']='河南省信阳地区固始县';

$areaArr['330222']='浙江省宁波市慈溪县';

$areaArr['352225']='福建省宁德地区霞浦县';

$areaArr['342326']='安徽省滁县地区凤阳县';

$areaArr['612425']='陕西省安康地区紫阳县';

$areaArr['612322']='陕西省汉中地区城固县';

$areaArr['460003']='海南省海南省儋州市';

$areaArr['441281']='广东省肇庆市云浮市';

$areaArr['362202']='江西省宜春地区丰城市';

$areaArr['440711']='广东省江门市郊区';

$areaArr['412932']='河南省南阳市桐柏县';

$areaArr['321027']='江苏省扬州市邗江县';

$areaArr['413023']='河南省信阳地区平桥区';

$areaArr['342824']='安徽省安庆地区潜山县';

$areaArr['132224']='河北省邢台地区内丘县';

$areaArr['362527']='江西省抚州地区宜黄县';

$areaArr['341223']='安徽省阜阳市涡阳县';

$areaArr['372922']='山东省菏泽地区曹县';

$areaArr['362232']='江西省宜春地区靖安县';

$areaArr['440921']='广东省茂名市信宜县';

$areaArr['232301']='黑龙江省绥化地区绥化市';

$areaArr['441611']='广东省河源市郊区';

$areaArr['352203']='福建省宁德地区福鼎市';

$areaArr['640203']='宁夏回族自治区石嘴山市石嘴山区';

$areaArr['511223']='四川省万县市梁平县';

$areaArr['440782']='广东省江门市新会市';

$areaArr['441381']='广东省惠州市惠阳市';

$areaArr['432402']='湖南省常德地区津市市';

$areaArr['340901']='安徽省';

$areaArr['422601']='湖北省郧阳地区丹江口市';

$areaArr['510231']='四川省重庆市北碚区';

$areaArr['413021']='河南省信阳地区息县';

$areaArr['231027']='黑龙江省牡丹江市虎林县';

$areaArr['362133']='江西省赣州地区兴国县';

$areaArr['142201']='山西省忻州地区忻州市';

$areaArr['654101']='新疆维吾尔自治区伊犁哈萨克自治州伊宁市';

$areaArr['410311']='河南省洛阳市郊区';

$areaArr['440725']='广东省江门市鹤山县';

$areaArr['420221']='湖北省黄石市大冶县';

$areaArr['321025']='江苏省扬州市泰兴县';

$areaArr['132903']='河北省沧州地区任丘市';

$areaArr['441282']='广东省肇庆市罗定市';

$areaArr['342529']='安徽省宣城地区泾县';

$areaArr['342322']='安徽省滁县地区来安县';

$areaArr['342701']='安徽省徽州地区屯溪市';

$areaArr['413022']='河南省信阳地区淮滨县';

$areaArr['352104']='福建省南平地区建瓯市';

$areaArr['362430']='江西省吉安地区永新县';

$areaArr['140102']='山西省太原市南城区';

$areaArr['422129']='湖北省黄冈地区广济县';

$areaArr['422226']='湖北省孝感地区云梦县';

$areaArr['442526']='广东省博罗县';

$areaArr['460035']='海南省海南省保亭黎族苗族自治县';

$areaArr['622326']='甘肃省武威地区天祝藏族自治县';

$areaArr['352202']='福建省宁德地区福安市';

$areaArr['412822']='河南省驻马店地区泌阳县';

$areaArr['441229']='广东省肇庆市郁南县';

$areaArr['133001']='河北省衡水地区衡水市';

$areaArr['152127']='内蒙古自治区呼伦贝尔盟鄂伦春自治旗';

$areaArr['362233']='江西省宜春地区铜鼓县';

$areaArr['512921']='四川省南充地区南充县';

$areaArr['432322']='湖南省益阳地区南县';

$areaArr['332529']='浙江省丽水地区景宁畲族自治县';

$areaArr['432424']='湖南省常德地区澧县';

$areaArr['622421']='甘肃省定西地区定西县';

$areaArr['362203']='江西省宜春地区樟树市';

$areaArr['500239']='重庆市黔江土家族苗族自治县';

$areaArr['432326']='湖南省益阳地区安化县';

$areaArr['452229']='广西壮族自治区柳州地区融水苗族自治县';

$areaArr['412828']='河南省驻马店地区新蔡县';

$areaArr['432301']='湖南省益阳地区益阳市';

$areaArr['152122']='内蒙古自治区呼伦贝尔盟阿荣旗';

$areaArr['350321']='福建省莆田市莆田县';

$areaArr['440125']='广东省广州市增城县';

$areaArr['452225']='广西壮族自治区柳州地区武宣县';

$areaArr['132423']='河北省保定地区徐水县';

$areaArr['422201']='湖北省孝感地区孝感市';

$areaArr['420622']='湖北省襄樊市枣阳县';

$areaArr['442827']='广东省云浮县';

$areaArr['412726']='河南省周口地区郸城县';

$areaArr['362131']='江西省赣州地区宁都县';

$areaArr['452201']='广西壮族自治区柳州地区合山市';

$areaArr['152101']='内蒙古自治区呼伦贝尔盟海拉尔市';

$areaArr['460102']='海南省海口市振东区';

$areaArr['522321']='贵州省黔西南布依族苗族自治州兴义县';

$areaArr['352123']='福建省南平地区建瓯县';

$areaArr['362322']='江西省上饶地区广丰县';

$areaArr['422702']='湖北省宜昌地区当阳市';

$areaArr['130228']='河北省唐山市遵化县';

$areaArr['372522']='山东省聊城市莘县';

$areaArr['429001']='湖北省省直辖行政单位随州市';

$areaArr['460004']='海南省海南省琼山市';

$areaArr['420983']='湖北省孝感市广水市';

$areaArr['422429']='湖北省荆州地区潜江县';

$areaArr['432425']='湖南省常德地区临澧县';

$areaArr['511023']='四川省内江市安岳县';

$areaArr['510222']='四川省重庆市巴县';

$areaArr['362223']='江西省宜春地区清江县';

$areaArr['210221']='辽宁省大连市金县';

$areaArr['362524']='江西省抚州地区南丰县';

$areaArr['452428']='广西壮族自治区贺州地区富川瑶族自治县';

$areaArr['362522']='江西省抚州地区南城县';

$areaArr['412825']='河南省驻马店地区上蔡县';

$areaArr['610321']='陕西省宝鸡市宝鸡县';

$areaArr['410426']='河南省平顶山市襄城县';

$areaArr['320586']='江苏省苏州市吴县市';

$areaArr['511127']='四川省乐山市洪雅县';

$areaArr['152123']='内蒙古自治区呼伦贝尔盟莫力达瓦达斡尔族自治旗';

$areaArr['412823']='河南省驻马店地区遂平县';

$areaArr['612323']='陕西省汉中地区洋县';

$areaArr['432401']='湖南省常德地区常德市';

$areaArr['342201']='安徽省宿县地区宿州市';

$areaArr['412328']='河南省商丘地区永城县';

$areaArr['510227']='四川省重庆市潼南县';

$areaArr['612427']='陕西省安康地区平利县';

$areaArr['422421']='湖北省荆州地区江陵县';

$areaArr['452224']='广西壮族自治区柳州地区象州县';

$areaArr['422326']='湖北省咸宁地区通山县';

$areaArr['372321']='山东省滨州地区惠民县';

$areaArr['432627']='湖南省邵阳地区城步苗族自治县';

$areaArr['362531']='江西省抚州地区东乡县';

$areaArr['412722']='河南省周口地区西华县';

$areaArr['412727']='河南省周口地区淮阳县';

$areaArr['452226']='广西壮族自治区柳州地区来宾县';

$areaArr['422723']='湖北省宜昌地区枝江县';

$areaArr['432801']='湖南省郴州地区郴州市';

$areaArr['372501']='山东省聊城市聊城市';

$areaArr['362329']='江西省上饶地区余干县';

$areaArr['362229']='江西省宜春地区宜丰县';

$areaArr['232101']='黑龙江省松花江地区双城市';

$areaArr['441522']='广东省汕尾市陆丰县';

$areaArr['440603']='广东省佛山市石湾区';

$areaArr['230121']='黑龙江省哈尔滨市呼兰县';

$areaArr['511227']='四川省万县市巫溪县';

$areaArr['370625']='山东省烟台市掖县';

$areaArr['362102']='江西省赣州地区瑞金市';

$areaArr['432501']='湖南省娄底地区娄底市';

$areaArr['430402']='湖南省衡阳市江东区';

$areaArr['142431']='山西省晋中地区平遥县';

$areaArr['532729']='云南省思茅地区澜沧拉祜族自治县';

$areaArr['362101']='江西省赣州地区赣州市';

$areaArr['332525']='浙江省丽水地区庆元县';

$areaArr['441230']='广东省肇庆市罗定县';

$areaArr['440510']='广东省汕头市河浦区';

$areaArr['440822']='广东省湛江市廉江县';

$areaArr['422431']='湖北省荆州地区钟祥县';

$areaArr['132529']='河北省张家口地区怀来县';

$areaArr['440721']='广东省江门市新会县';

$areaArr['513021']='四川省达川地区达县';

$areaArr['420603']='湖北省襄樊市樊东区';

$areaArr['422130']='湖北省黄冈地区黄梅县';

$areaArr['510215']='四川省重庆市北碚区';

$areaArr['362502']='江西省抚州地区临川市';

$areaArr['432502']='湖南省娄底地区冷水江市';

$areaArr['362330']='江西省上饶地区波阳县';

$areaArr['432426']='湖南省常德地区桃源县';

$areaArr['532124']='云南省昭通地区盐津县';

$areaArr['352228']='福建省宁德地区屏南县';

$areaArr['372926']='山东省菏泽地区巨野县';

$areaArr['452402']='广西壮族自治区贺州地区贺州市';

$areaArr['452427']='广西壮族自治区贺州地区钟山县';

$areaArr['432822']='湖南省郴州地区桂阳县';

$areaArr['513824']='四川省眉山地区洪雅县';

$areaArr['513030']='四川省达川地区渠县';

$areaArr['413027']='河南省信阳地区商城县';

$areaArr['362226']='江西省宜春地区奉新县';

$areaArr['622322']='甘肃省武威地区民勤县';

$areaArr['440223']='广东省韶关市南雄县';

$areaArr['513623']='四川省广安市武胜县';

$areaArr['412724']='河南省周口地区太康县';

$areaArr['440504']='广东省汕头市公园区';

$areaArr['452730']='广西壮族自治区河池地区都安瑶族自治县';

$areaArr['342723']='安徽省徽州地区歙县';

$areaArr['519004']='四川省峨眉山市';

$areaArr['332527']='浙江省丽水地区遂昌县';

$areaArr['440321']='广东省深圳市宝安县';

$areaArr['452701']='广西壮族自治区河池地区河池市';

$areaArr['513022']='四川省达川地区宣汉县';

$areaArr['420122']='湖北省武汉市江夏区';

$areaArr['500221']='重庆市长寿县';

$areaArr['652322']='新疆维吾尔自治区昌吉回族自治州米泉市';

$areaArr['510283']='四川省重庆市合川市';

$areaArr['412821']='河南省驻马店地区确山县';

$areaArr['321121']='江苏省镇江市丹徒县';

$areaArr['612326']='陕西省汉中地区宁强县';

$areaArr['120224']='天津市宝坻县';

$areaArr['320522']='江苏省苏州市太仓县';

$areaArr['440181']='广东省广州市番禺市';

$areaArr['612132']='陕西省渭南地区合阳县';

$areaArr['420604']='湖北省襄樊市樊西区';

$areaArr['142724']='山西省运城地区临猗县';

$areaArr['622223']='甘肃省张掖地区民乐县';

$areaArr['362324']='江西省上饶地区铅山县';

$areaArr['320625']='江苏省南通市海门县';

$areaArr['460104']='海南省海口市秀英区';

$areaArr['120222']='天津市武清县';

$areaArr['372923']='山东省菏泽地区定陶县';

$areaArr['452624']='广西壮族自治区百色地区平果县';

$areaArr['330321']='浙江省温州市瓯海县';

$areaArr['132329']='河北省石家庄市新乐县';

$areaArr['370911']='山东省泰安市郊区';

$areaArr['412929']='河南省南阳市唐河县';

$areaArr['372301']='山东省滨州地区滨州市';

$areaArr['211203']='辽宁省铁岭市铁法区';

$areaArr['622801']='甘肃省庆阳地区西峰市';

$areaArr['432923']='湖南省零陵地区道县';

$areaArr['362428']='江西省吉安地区万安县';

$areaArr['211022']='辽宁省辽阳市灯塔县';

$areaArr['432824']='湖南省郴州地区宜章县';

$areaArr['310227']='上海市松江县';

$areaArr['132130']='河北省邯郸地区磁县';

$areaArr['410321']='河南省洛阳市偃师县';

$areaArr['522502']='贵州省安顺地区清镇市';

$areaArr['512326']='四川省涪陵地区武隆县';

$areaArr['330722']='浙江省金华市永康县';

$areaArr['513821']='四川省眉山地区眉山县';

$areaArr['362325']='江西省上饶地区横峰县';

$areaArr['612401']='陕西省安康地区安康市';

$areaArr['452522']='广西壮族自治区玉林地区贵县';

$areaArr['430419']='湖南省衡阳市耒阳市';

$areaArr['372901']='山东省菏泽地区菏泽市';

$areaArr['510625']='四川省德阳市什邡县';

$areaArr['352224']='福建省宁德地区福鼎县';

$areaArr['332501']='浙江省丽水地区丽水市';

$areaArr['342422']='安徽省六安地区寿县';

$areaArr['142723']='山西省运城地区芮城县';

$areaArr['510221']='四川省重庆市长寿县';

$areaArr['612628']='陕西省延安地区富县';

$areaArr['372525']='山东省聊城市冠县';

$areaArr['321028']='江苏省扬州市泰县';

$areaArr['422427']='湖北省荆州地区沔阳县';

$areaArr['152125']='内蒙古自治区呼伦贝尔盟额尔古纳右旗';

$areaArr['512223']='四川省万县地区忠县';

$areaArr['510125']='四川省成都市新都县';

$areaArr['612301']='陕西省汉中地区汉中市';

$areaArr['352127']='福建省南平地区光泽县';

$areaArr['220123']='吉林省长春市九台县';

$areaArr['412723']='河南省周口地区商水县';

$areaArr['232103']='黑龙江省松花江地区五常市';

$areaArr['132823']='河北省廊坊地区香河县';

$areaArr['342101']='安徽省阜阳地区阜阳市';

$areaArr['511122']='四川省乐山市眉山县';

$areaArr['320926']='江苏省盐城市大丰县';

$areaArr['362421']='江西省吉安地区吉安县';

$areaArr['330125']='浙江省杭州市余杭县';

$areaArr['142601']='山西省临汾地区临汾市';

$areaArr['132129']='河北省邯郸地区临漳县';

$areaArr['320911']='江苏省盐城市郊区';

$areaArr['610123']='陕西省西安市临潼县';

$areaArr['511130']='四川省乐山市青神县';

$areaArr['511130']='四川省乐山市青神县';

$areaArr['440521']='广东省汕头市澄海县';

$areaArr['440521']='广东省汕头市澄海县';

$areaArr['422301']='湖北省咸宁地区咸宁市';

$areaArr['330224']='浙江省宁波市奉化县';

$areaArr['152321']='内蒙古自治区哲里木盟通辽县';

$areaArr['372924']='山东省菏泽地区成武县';

$areaArr['654125']='新疆维吾尔自治区伊犁哈萨克自治州新源县';

$areaArr['370633']='山东省烟台市荣城县';

$areaArr['372831']='山东省临沂地区费县';

$areaArr['142622']='山西省临汾地区翼城县';

$areaArr['433001']='湖南省怀化地区怀化市';

$areaArr['370224']='山东省青岛市胶县';

$areaArr['310229']='上海市青浦县';

$areaArr['410521']='河南省安阳市林县';

$areaArr['130222']='河北省唐山市丰南县';

$areaArr['132801']='河北省廊坊地区廊坊市';

$areaArr['342126']='安徽省阜阳地区亳县';

$areaArr['330721']='浙江省金华市金华县';

$areaArr['622323']='甘肃省武威地区古浪县';

$areaArr['342423']='安徽省六安地区霍邱县';

$areaArr['370822']='山东省济宁市兖州县';

$areaArr['342122']='安徽省阜阳地区临泉县';

$areaArr['513124']='四川省雅安地区汉源县';

$areaArr['510902']='四川省遂宁市市中区';

$areaArr['342224']='安徽省宿县地区灵璧县';

$areaArr['320223']='江苏省无锡市宜兴县';

$areaArr['452527']='广西壮族自治区玉林地区陆川县';

$areaArr['432930']='湖南省零陵地区双牌县';

$areaArr['440683']='广东省佛山市三水市';

$areaArr['612426']='陕西省安康地区岚皋县';

$areaArr['340821']='安徽省安庆市桐城县';

$areaArr['420803']='湖北省荆门市沙洋区';

$areaArr['152822']='内蒙古自治区巴彦淖尔盟五原县';

$areaArr['512531']='四川省宜宾地区高县';

$areaArr['372401']='山东省德州地区德州市';

$areaArr['232131']='黑龙江省松花江地区延寿县';

$areaArr['342425']='安徽省六安地区舒城县';

$areaArr['372801']='山东省临沂地区临沂市';

$areaArr['231023']='黑龙江省牡丹江市穆棱县';

$areaArr['412725']='河南省周口地区鹿邑县';

$areaArr['370123']='山东省济南市长清县';

$areaArr['372429']='山东省德州地区商河县';

$areaArr['360311']='江西省萍乡市上栗区';

$areaArr['460029']='海南省海南省儋县';

$areaArr['512222']='四川省万县地区开县';

$areaArr['342622']='安徽省巢湖地区庐江县';

$areaArr['342524']='安徽省宣城地区宁国县';

$areaArr['430404']='湖南省衡阳市城北区';

$areaArr['513125']='四川省雅安地区石棉县';

$areaArr['372323']='山东省滨州地区阳信县';

$areaArr['310102']='上海市南市区';

$areaArr['533126']='云南省德宏傣族景颇族自治州畹町镇';

$areaArr['452126']='广西壮族自治区南宁地区隆安县';

$areaArr['342829']='安徽省安庆地区东至县';

$areaArr['432802']='湖南省郴州地区资兴市';

$areaArr['410126']='河南省郑州市密县';

$areaArr['610121']='陕西省西安市长安县';

$areaArr['441222']='广东省肇庆市四会县';

$areaArr['432828']='湖南省郴州地区汝城县';

$areaArr['432321']='湖南省益阳地区益阳县';

$areaArr['370624']='山东省烟台市招远县';

$areaArr['513922']='四川省资阳地区乐至县';

$areaArr['512529']='四川省宜宾地区江安县';

$areaArr['522526']='贵州省安顺地区平坝县';

$areaArr['612129']='陕西省渭南地区澄城县';

$areaArr['513902']='四川省资阳地区简阳市';

$areaArr['510228']='四川省重庆市铜梁县';

$areaArr['612525']='陕西省商洛地区山阳县';

$areaArr['339005']='浙江省萧山市';

$areaArr['310225']='上海市南汇县';

$areaArr['342222']='安徽省宿县地区萧县';

$areaArr['362425']='江西省吉安地区永丰县';

$areaArr['452325']='广西壮族自治区桂林地区永福县';

$areaArr['362123']='江西省赣州地区信丰县';

$areaArr['370421']='山东省枣庄市滕县';

$areaArr['142222']='山西省忻州地区定襄县';

$areaArr['142323']='山西省吕梁地区交城县';

$areaArr['650300']='新疆维吾尔自治区';

$areaArr['320421']='江苏省常州市武进县';

$areaArr['430526']='湖南省邵阳市武冈县';

$areaArr['620202']='甘肃省嘉峪关市嘉峪关区';

$areaArr['512527']='四川省宜宾地区宜宾县';

$areaArr['342921']='安徽省池州地区东至县';

$areaArr['370825']='山东省济宁市邹县';

$areaArr['142629']='山西省临汾地区浮山县';


$areaArr['440527']='广东省汕头市普宁县';

$areaArr['440503']='广东省汕头市安平区';

$areaArr['142322']='山西省吕梁地区文水县';

$areaArr['510123']='四川省成都市温江县';

$areaArr['142630']='山西省临汾地区吉县';

$areaArr['512323']='四川省涪陵地区南川县';

$areaArr['433023']='湖南省怀化地区辰溪县';

$areaArr['372826']='山东省临沂地区莒县';

$areaArr['130221']='河北省唐山市丰润县';

$areaArr['372929']='山东省菏泽地区鄄城县';

$areaArr['340505']='安徽省马鞍山市向山区';

$areaArr['362204']='江西省宜春地区高安市';

$areaArr['342601']='安徽省巢湖地区巢湖市';

$areaArr['142625']='山西省临汾地区洪洞县';

$areaArr['232127']='黑龙江省松花江地区木兰县';

$areaArr['330823']='浙江省衢州市江山县';

$areaArr['142427']='山西省晋中地区寿阳县';

$areaArr['413001']='河南省信阳地区信阳市';

$areaArr['512301']='四川省涪陵地区涪陵市';

$areaArr['452123']='广西壮族自治区南宁地区宾阳县';

$areaArr['440522']='广东省汕头市饶平县';

$areaArr['142326']='山西省吕梁地区临县';

$areaArr['622427']='甘肃省定西地区临洮县';

$areaArr['622301']='甘肃省武威地区武威市';

$areaArr['352201']='福建省宁德地区宁德市';

$areaArr['362126']='江西省赣州地区崇义县';

$areaArr['339011']='浙江省诸暨市';

$areaArr['411022']='河南省许昌市长葛县';

$areaArr['442828']='广东省新兴县';

$areaArr['152325']='内蒙古自治区哲里木盟库伦旗';

$areaArr['612130']='陕西省渭南地区白水县';

$areaArr['452623']='广西壮族自治区百色地区田东县';

$areaArr['452127']='广西壮族自治区南宁地区马山县';

$areaArr['132628']='河北省承德地区隆化县';

$areaArr['450104']='广西壮族自治区南宁市城北区';

$areaArr['320624']='江苏省南通市南通县';


$areaArr['452725']='广西壮族自治区河池地区南丹县';

$areaArr['622821']='甘肃省庆阳地区庆阳县';

$areaArr['612321']='陕西省汉中地区南郑县';

$areaArr['422124']='湖北省黄冈地区麻城县';

$areaArr['372328']='山东省滨州地区博兴县';

$areaArr['132825']='河北省廊坊地区永清县';

$areaArr['341281']='安徽省阜阳市亳州市';

$areaArr['432924']='湖南省零陵地区宁远县';

$areaArr['330419']='浙江省嘉兴市海宁市';

$areaArr['440620']='广东省佛山市中山市';

$areaArr['342901']='安徽省池州地区贵池市';

$areaArr['342502']='安徽省宣城地区宁国市';

$areaArr['372324']='山东省滨州地区无棣县';

$areaArr['152322']='内蒙古自治区哲里木盟科尔沁左翼中旗';

$areaArr['622724']='甘肃省平凉地区崇信县';

$areaArr['320524']='江苏省苏州市吴县';

$areaArr['342427']='安徽省六安地区霍山县';

$areaArr['412702']='河南省周口地区项城市';

$areaArr['332522']='浙江省丽水地区青田县';

$areaArr['410511']='河南省安阳市郊区';

$areaArr['513822']='四川省眉山地区仁寿县';


$areaArr['419003']='河南省济源市';

$areaArr['232303']='黑龙江省绥化地区肇东市';



$areaArr['232324']='黑龙江省绥化地区望奎县';

$areaArr['440624']='广东省佛山市高明县';

$areaArr['452525']='广西壮族自治区玉林地区容县';

$areaArr['512923']='四川省南充地区岳池县';

$areaArr['133025']='河北省衡水地区深县';

$areaArr['362525']='江西省抚州地区崇仁县';

$areaArr['362525']='江西省抚州地区崇仁县';

$areaArr['132440']='河北省保定地区安国县';

$areaArr['132440']='河北省保定地区安国县';

$areaArr['321124']='江苏省镇江市扬中县';

$areaArr['452323']='广西壮族自治区桂林地区全州县';

$areaArr['341224']='安徽省阜阳市蒙城县';

$areaArr['642124']='宁夏回族自治区吴忠市中宁县';



$areaArr['341227']='安徽省阜阳市利辛县';

$areaArr['341227']='安徽省阜阳市利辛县';

$areaArr['362424']='江西省吉安地区新干县';

$areaArr['412922']='河南省南阳市方城县';

$areaArr['511081']='四川省内江市资阳市';

$areaArr['110223']='北京市通县';

$areaArr['420400']='湖北省沙市沙市';

$areaArr['432901']='湖南省零陵地区永州市';

$areaArr['410121']='河南省郑州市荥阳县';

$areaArr['142634']='山西省临汾地区永和县';

$areaArr['140511']='山西省晋城市郊区';

$areaArr['442801']='广东省';



$areaArr['622621']='甘肃省陇南地区武都县';



$areaArr['513029']='四川省达川地区大竹县';

$areaArr['452723']='广西壮族自治区河池地区罗城仫佬族自治县';

$areaArr['442530']='广东省陆丰县';

$areaArr['371021']='山东省威海市乳山县';



$areaArr['142727']='山西省运城地区稷山县';

$areaArr['513901']='四川省资阳地区资阳市';

$areaArr['622822']='甘肃省庆阳地区环县';

$areaArr['513122']='四川省雅安地区名山县';

$areaArr['440225']='广东省韶关市乐昌县';

$areaArr['654123']='新疆维吾尔自治区伊犁哈萨克自治州霍城县';

$areaArr['612524']='陕西省商洛地区商南县';

$areaArr['412829']='河南省驻马店地区正阳县';



$areaArr['350879']='福建省龙岩市';

$areaArr['230122']='黑龙江省哈尔滨市阿城县';

$areaArr['152301']='内蒙古自治区哲里木盟通辽市';


$areaArr['372423']='山东省德州地区夏津县';

$areaArr['152726']='内蒙古自治区伊克昭盟杭锦旗';

$areaArr['372421']='山东省德州地区陵县';

$areaArr['362321']='江西省上饶地区上饶县';

$areaArr['142333']='山西省吕梁地区交口县';

$areaArr['152130']='内蒙古自治区呼伦贝尔盟新巴尔虎左旗';

$areaArr['152725']='内蒙古自治区伊克昭盟鄂托克旗';

$areaArr['412327']='河南省商丘地区柘城县';

$areaArr['320283']='江苏省无锡市锡山市';

$areaArr['372526']='山东省聊城市高唐县';

$areaArr['152128']='内蒙古自治区呼伦贝尔盟鄂温克族自治旗';

$areaArr['432621']='湖南省邵阳地区邵阳县';

$areaArr['142623']='山西省临汾地区襄汾县';

$areaArr['410123']='河南省郑州市新郑县';

$areaArr['511027']='四川省内江市简阳县';

$areaArr['612101']='陕西省渭南地区渭南市';

$areaArr['142730']='山西省运城地区夏县';

$areaArr['511121']='四川省乐山市仁寿县';

$areaArr['452122']='广西壮族自治区南宁地区横县';

$areaArr['440922']='广东省茂名市高州县';

$areaArr['152104']='内蒙古自治区呼伦贝尔盟牙克石市';

$areaArr['342421']='安徽省六安地区六安县';

$areaArr['142303']='山西省吕梁地区汾阳市';

$areaArr['132439']='河北省保定地区定县';

$areaArr['510111']='四川省成都市金牛区';

$areaArr['230830']='黑龙江省佳木斯市萝北县';

$areaArr['532129']='云南省昭通地区彝良县';

$areaArr['654001']='新疆维吾尔自治区伊犁哈萨克自治州奎屯市';

$areaArr['142301']='山西省吕梁地区孝义市';

$areaArr['622425']='甘肃省定西地区陇西县';

$areaArr['142227']='山西省忻州地区宁武县';

$areaArr['513031']='四川省达川地区邻水县';

$areaArr['142223']='山西省忻州地区五台县';

$areaArr['622722']='甘肃省平凉地区泾川县';

$areaArr['142631']='山西省临汾地区乡宁县';

$areaArr['440202']='广东省韶关市北江区';

$areaArr['342426']='安徽省六安地区金寨县';

$areaArr['440221']='广东省韶关市曲江县';

$areaArr['232325']='黑龙江省绥化地区兰西县';

$areaArr['342221']='安徽省宿县地区砀山县';

$areaArr['342221']='安徽省宿县地区砀山县';

$areaArr['622630']='甘肃省陇南地区徽县';

$areaArr['132228']='河北省邢台地区南和县';

$areaArr['622726']='甘肃省平凉地区庄浪县';

$areaArr['612429']='陕西省安康地区旬阳县';

$areaArr['362529']='江西省抚州地区资溪县';

$areaArr['452729']='广西壮族自治区河池地区巴马瑶族自治县';

$areaArr['412826']='河南省驻马店地区汝南县';

$areaArr['130206']='河北省唐山市新区';

$areaArr['372824']='山东省临沂地区莒南县';

$areaArr['452324']='广西壮族自治区桂林地区兴安县';

$areaArr['432925']='湖南省零陵地区江永县';

$areaArr['533523']='云南省临沧地区云县';

$areaArr['612327']='陕西省汉中地区略阳县';

$areaArr['232326']='黑龙江省绥化地区青冈县';

$areaArr['142328']='山西省吕梁地区石楼县';

$areaArr['372930']='山东省菏泽地区东明县';

$areaArr['352227']='福建省宁德地区古田县';



$areaArr['152102']='内蒙古自治区呼伦贝尔盟满洲里市';

$areaArr['421004']='湖北省荆州市江陵区';

$areaArr['513723']='四川省巴中地区平昌县';


$areaArr['612526']='陕西省商洛地区镇安县';

$areaArr['460027']='海南省海南省澄迈县';

$areaArr['330325']='浙江省温州市瑞安县';

$areaArr['342301']='安徽省滁县地区滁州市';

$areaArr['320123']='江苏省南京市六合县';

$areaArr['512930']='四川省南充地区阆中县';

$areaArr['512930']='四川省南充地区阆中县';

$areaArr['211222']='辽宁省铁岭市开原县';


$areaArr['360212']='江西省景德镇市蛟潭区';

$areaArr['320483']='江苏省常州市武进市';

$areaArr['441221']='广东省肇庆市高要县';

$areaArr['232302']='黑龙江省绥化地区安达市';

$areaArr['640321']='宁夏回族自治区吴忠市中卫县';

$areaArr['442821']='广东省高要县';

$areaArr['442821']='广东省高要县';

$areaArr['132324']='河北省石家庄市无极县';

$areaArr['370728']='山东省潍坊市诸城县';

$areaArr['612127']='陕西省渭南地区大荔县';

$areaArr['510622']='四川省德阳市绵竹县';

$areaArr['152630']='内蒙古自治区乌兰察布盟察哈尔右翼前旗';

$areaArr['152106']='内蒙古自治区呼伦贝尔盟额尔古纳市';

$areaArr['532101']='云南省昭通地区昭通市';

$areaArr['532128']='云南省昭通地区镇雄县';



$areaArr['232724']='黑龙江省大兴安岭地区漠河县';

$areaArr['152126']='内蒙古自治区呼伦贝尔盟额尔古纳左旗';

$areaArr['460022']='海南省海南省文昌县';

$areaArr['342821']='安徽省安庆地区怀宁县';

$areaArr['152723']='内蒙古自治区伊克昭盟准格尔旗';

$areaArr['342501']='安徽省宣城地区宣州市';

$areaArr['132623']='河北省承德地区兴隆县';


$areaArr['342626']='安徽省巢湖地区和县';

$areaArr['612328']='陕西省汉中地区镇巴县';

$areaArr['513722']='四川省巴中地区南江县';

$areaArr['220319']='吉林省四平市公主岭市';

$areaArr['142702']='山西省运城地区永济市';

$areaArr['622723']='甘肃省平凉地区灵台县';

$areaArr['612629']='陕西省延安地区洛川县';

$areaArr['522127']='贵州省遵义地区凤冈县';

$areaArr['522122']='贵州省遵义地区桐梓县';

$areaArr['420521']='湖北省宜昌市宜昌县';

$areaArr['341127']='安徽省滁州市嘉山县';

$areaArr['142627']='山西省临汾地区古县';

$areaArr['321119']='江苏省镇江市丹阳市';

$areaArr['513721']='四川省巴中地区通江县';

$areaArr['132401']='河北省保定地区定州市';

$areaArr['132401']='河北省保定地区定州市';

$areaArr['422325']='湖北省咸宁地区崇阳县';

$areaArr['422325']='湖北省咸宁地区崇阳县';

$areaArr['513002']='四川省达川地区万源市';

$areaArr['320827']='江苏省淮安市泗洪县';

$areaArr['432325']='湖南省益阳地区桃江县';

$areaArr['342625']='安徽省巢湖地区含山县';

$areaArr['232332']='黑龙江省绥化地区绥棱县';

$areaArr['622126']='甘肃省酒泉地区安西县';

$areaArr['132624']='河北省承德地区平泉县';

$areaArr['452626']='广西壮族自治区百色地区靖西县';

$areaArr['452622']='广西壮族自治区百色地区田阳县';

$areaArr['452131']='广西壮族自治区南宁地区天等县';

$areaArr['320704']='江苏省连云港市云台区';

$areaArr['362302']='江西省上饶地区德兴市';

$areaArr['410125']='河南省郑州市登封县';



$areaArr['622102']='甘肃省酒泉地区酒泉市';

$areaArr['342923']='安徽省池州地区青阳县';

$areaArr['610221']='陕西省铜川市耀县';

$areaArr['460007']='海南省海南省东方市';

$areaArr['522121']='贵州省遵义地区遵义县';

$areaArr['412824']='河南省驻马店地区西平县';

$areaArr['512501']='四川省宜宾地区宜宾市';

$areaArr['342124']='安徽省阜阳地区涡阳县';

$areaArr['452502']='广西壮族自治区玉林地区贵港市';

$areaArr['513101']='四川省雅安地区雅安市';

$areaArr['342830']='安徽省安庆地区贵池县';

$areaArr['440583']='广东省汕头市澄海市';

$areaArr['142633']='山西省临汾地区大宁县';

$areaArr['142633']='山西省临汾地区大宁县';

$areaArr['512201']='四川省万县地区万县市';

$areaArr['440182']='广东省广州市花都市';

$areaArr['532122']='云南省昭通地区鲁甸县';

$areaArr['372330']='山东省滨州地区邹平县';

$areaArr['232622']='黑龙江省黑河地区嫩江县';

$areaArr['352124']='福建省南平地区浦城县';

$areaArr['410124']='河南省郑州市巩县';



$areaArr['420124']='湖北省武汉市新洲县';

$areaArr['522128']='贵州省遵义地区湄潭县';

$areaArr['342531']='安徽省宣城地区绩溪县';

$areaArr['512528']='四川省宜宾地区南溪县';

$areaArr['460026']='海南省海南省屯昌县';

$areaArr['232102']='黑龙江省松花江地区尚志市';

$areaArr['342325']='安徽省滁县地区定远县';

$areaArr['362526']='江西省抚州地区乐安县';



$areaArr['642224']='宁夏回族自治区固原地区隆德县';


$areaArr['460033']='海南省海南省乐东黎族自治县';

$areaArr['452223']='广西壮族自治区柳州地区鹿寨县';



$areaArr['342922']='安徽省池州地区石台县';

$areaArr['532127']='云南省昭通地区绥江县';

$areaArr['152601']='内蒙古自治区乌兰察布盟集宁市';

$areaArr['513823']='四川省眉山地区彭山县';

$areaArr['532425']='云南省玉溪地区华宁县';

$areaArr['412827']='河南省驻马店地区平舆县';

$areaArr['430622']='湖南省岳阳市临湘县';

$areaArr['522528']='贵州省安顺地区关岭布依族苗族自治县';

$areaArr['370628']='山东省烟台市栖霞县';

$areaArr['612724']='陕西省榆林地区横山县';

$areaArr['612722']='陕西省榆林地区神木县';

$areaArr['372928']='山东省菏泽地区郓城县';

$areaArr['511026']='四川省内江市资阳市';

$areaArr['152103']='内蒙古自治区呼伦贝尔盟扎兰屯市';

$areaArr['132127']='河北省邯郸地区广平县';

$areaArr['430219']='湖南省株洲市醴陵市';


$areaArr['533024']='云南省保山地区龙陵县';

$areaArr['612324']='陕西省汉中地区西乡县';

$areaArr['612324']='陕西省汉中地区西乡县';

$areaArr['370631']='山东省烟台市牟平县';

$areaArr['532123']='云南省昭通地区巧家县';

$areaArr['622727']='甘肃省平凉地区静宁县';

$areaArr['142202']='山西省忻州地区原平市';

$areaArr['460025']='海南省海南省定安县';


$areaArr['652524']='新疆维吾尔自治区塔城地区沙湾县';

$areaArr['152323']='内蒙古自治区哲里木盟科尔沁左翼后旗';

$areaArr['132521']='河北省张家口地区张北市';

$areaArr['432821']='湖南省郴州地区郴县';

$areaArr['654126']='新疆维吾尔自治区伊犁哈萨克自治州昭苏县';

$areaArr['320626']='江苏省南通市启东县';

$areaArr['132924']='河北省沧州地区献县';

$areaArr['370823']='山东省济宁市曲阜县';

$areaArr['430411']='湖南省衡阳市郊区';

$areaArr['432423']='湖南省常德地区汉寿县';

$areaArr['533023']='云南省保山地区腾冲县';

$areaArr['152326']='内蒙古自治区哲里木盟奈曼旗';

$areaArr['460006']='海南省海南省万宁市';

$areaArr['332523']='浙江省丽水地区云和县';

$areaArr['532428']='云南省玉溪地区新平彝族傣族自治县';



$areaArr['413024']='河南省信阳地区潢川县';

$areaArr['422101']='湖北省黄冈地区鄂州市';


$areaArr['210222']='辽宁省大连市新金县';



$areaArr['432922']='湖南省零陵地区东安县';

$areaArr['432427']='湖南省常德地区石门县';


$areaArr['642225']='宁夏回族自治区固原地区泾源县';

$areaArr['142603']='山西省临汾地区霍州市';

$areaArr['412728']='河南省周口地区沈丘县';

$areaArr['510624']='四川省德阳市广汉县';

$areaArr['612726']='陕西省榆林地区定边县';

$areaArr['511224']='四川省万县市云阳县';



$areaArr['320882']='江苏省淮安市淮安市';

$areaArr['460034']='海南省海南省陵水黎族自治县';

$areaArr['132201']='河北省邢台地区南宫市';


$areaArr['142302']='山西省吕梁地区离石市';

$areaArr['513825']='四川省眉山地区丹棱县';

$areaArr['142228']='山西省忻州地区静乐县';

$areaArr['612621']='陕西省延安地区延长县';

$areaArr['612621']='陕西省延安地区延长县';

$areaArr['622201']='甘肃省张掖地区张掖市';

$areaArr['512902']='四川省南充地区华蓥市';



$areaArr['320520']='江苏省苏州市常熟市';

$areaArr['510103']='四川省成都市西城区';

$areaArr['230827']='黑龙江省佳木斯市宝清县';

$areaArr['310111']='上海市吴凇区';

$areaArr['452227']='广西壮族自治区柳州地区融安县';

$areaArr['362334']='江西省上饶地区婺源县';

$areaArr['142423']='山西省晋中地区和顺县';

$areaArr['372925']='山东省菏泽地区单县';

$areaArr['342125']='安徽省阜阳地区蒙城县';

$areaArr['211323']='辽宁省朝阳市凌源县';

$areaArr['440602']='广东省佛山市城区';

$areaArr['432524']='湖南省娄底地区新化县';

$areaArr['232126']='黑龙江省松花江地区巴彦县';



$areaArr['142701']='山西省运城地区运城市';

$areaArr['622424']='甘肃省定西地区通渭县';

$areaArr['362222']='江西省宜春地区高安县';

$areaArr['412701']='河南省周口地区周口市';



$areaArr['370623']='山东省烟台市黄县';

$areaArr['372833']='山东省临沂地区临沭县';

$areaArr['440520']='广东省汕头市潮州市';

$areaArr['612527']='陕西省商洛地区柞水县';

$areaArr['513126']='四川省雅安地区天全县';

$areaArr['332625']='浙江省台州地区天台县';

$areaArr['440122']='广东省广州市从化县';

$areaArr['230823']='黑龙江省佳木斯市依兰县';

$areaArr['379002']='山东省龙口市';

$areaArr['612729']='陕西省榆林地区佳县';

$areaArr['442527']='广东省东莞县';



$areaArr['510702']='四川省绵阳市市中区';

$areaArr['452423']='广西壮族自治区贺州地区藤县';

$areaArr['442525']='广东省河源县';

$areaArr['532131']='云南省昭通地区水富县';

$areaArr['350204']='福建省厦门市开元区';

$areaArr['442528']='广东省惠东县';

$areaArr['332624']='浙江省台州地区仙居县';

$areaArr['533001']='云南省保山地区保山市';

$areaArr['152105']='内蒙古自治区呼伦贝尔盟根河市';

$areaArr['370122']='山东省济南市章丘县';

$areaArr['232321']='黑龙江省绥化地区海伦县';

$areaArr['332621']='浙江省台州地区临海县';

$areaArr['372422']='山东省德州地区平原县';

$areaArr['372524']='山东省聊城市东阿县';



$areaArr['452523']='广西壮族自治区玉林地区桂平县';

$areaArr['230119']='黑龙江省哈尔滨市阿城市';

$areaArr['452631']='广西壮族自治区百色地区隆林各族自治县';

$areaArr['370920']='山东省泰安市新泰市';



$areaArr['142234']='山西省忻州地区偏关县';

$areaArr['622827']='甘肃省庆阳地区镇原县';

$areaArr['370223']='山东省青岛市胶南县';

$areaArr['513622']='四川省广安市广安县';

$areaArr['412801']='河南省驻马店地区驻马店市';

$areaArr['510130']='四川省成都市邛崃县';

$areaArr['420620']='湖北省襄阳市老河口市';

$areaArr['512322']='四川省涪陵地区垫江县';

$areaArr['132132']='河北省邯郸地区涉县';

$areaArr['442829']='广东省郁南县';


$areaArr['412326']='河南省商丘地区夏邑县';

$areaArr['152327']='内蒙古自治区哲里木盟扎鲁特旗';

$areaArr['142602']='山西省临汾地区侯马市';

$areaArr['370922']='山东省泰安市肥城县';

$areaArr['452724']='广西壮族自治区河池地区环江毛南族自治县';

$areaArr['452724']='广西壮族自治区河池地区环江毛南族自治县';

$areaArr['320122']='江苏省南京市江浦县';

$areaArr['130106']='河北省石家庄市郊区';

$areaArr['522125']='贵州省遵义地区道真仡佬族苗族自治县';

$areaArr['412721']='河南省周口地区扶沟县';

$areaArr['513027']='四川省达川地区巴中县';

$areaArr['452331']='广西壮族自治区桂林地区荔蒲县';


$areaArr['522724']='贵州省黔南布依族苗族自治州福泉县';

$areaArr['533224']='云南省丽江地区宁蒗彝族自治县';



$areaArr['510229']='四川省重庆市永川县';

$areaArr['622701']='甘肃省平凉地区平凉市';

$areaArr['640382']='宁夏回族自治区吴忠市灵武市';



$areaArr['140112']='山西省太原市南郊区';



$areaArr['422403']='湖北省荆州地区洪湖市';

$areaArr['532130']='云南省昭通地区威信县';


$areaArr['512922']='四川省南充地区南部县';



$areaArr['452322']='广西壮族自治区桂林地区灵川县';

$areaArr['452231']='广西壮族自治区柳州地区忻城县';

$areaArr['452132']='广西壮族自治区南宁地区宁明县';

$areaArr['330724']='浙江省金华市东阳县';

$areaArr['110221']='北京市昌平县';

$areaArr['522130']='贵州省遵义地区仁怀县';

$areaArr['532427']='云南省玉溪地区峨山彝族自治县';


$areaArr['152626']='内蒙古自治区乌兰察布盟商都县';

$areaArr['532730']='云南省思茅地区西盟佤族自治县';

$areaArr['622627']='甘肃省陇南地区西和县';

$areaArr['420123']='湖北省武汉市黄陂区';

$areaArr['330121']='浙江省杭州市萧山县';

$areaArr['132301']='河北省石家庄市辛集市';

$areaArr['152801']='内蒙古自治区巴彦淖尔盟临河市';

$areaArr['612701']='陕西省榆林地区榆林市';

$areaArr['132629']='河北省承德地区围场满族蒙古族自治县';

$areaArr['232331']='黑龙江省绥化地区明水县';

$areaArr['232331']='黑龙江省绥化地区明水县';

$areaArr['132821']='河北省廊坊地区三河县';

$areaArr['422103']='湖北省黄冈地区黄州市';

$areaArr['342822']='安徽省安庆地区桐城县';



$areaArr['513921']='四川省资阳地区安岳县';

$areaArr['411219']='河南省三门峡市';

$areaArr['422127']='湖北省黄冈地区浠水县';

$areaArr['362429']='江西省吉安地区安福县';

$areaArr['612630']='陕西省延安地区宜川县';

$areaArr['142327']='山西省吕梁地区柳林县';

$areaArr['512926']='四川省南充地区蓬安县';

$areaArr['512926']='四川省南充地区蓬安县';


$areaArr['370620']='山东省烟台市威海市';

$areaArr['342523']='安徽省宣城地区广德县';

$areaArr['622428']='甘肃省定西地区漳县';



$areaArr['452329']='广西壮族自治区桂林地区资源县';


$areaArr['142732']='山西省运城地区平陆县';



$areaArr['612422']='陕西省安康地区汉阴县';

$areaArr['612522']='陕西省商洛地区洛南县';

$areaArr['460021']='海南省海南省琼山县';

$areaArr['372527']='山东省聊城市高唐县';

$areaArr['452601']='广西壮族自治区百色地区百色市';

$areaArr['330425']='浙江省嘉兴市桐乡县';

$areaArr['532125']='云南省昭通地区大关县';

$areaArr['532125']='云南省昭通地区大关县';


$areaArr['372425']='山东省德州地区齐河县';

$areaArr['372428']='山东省德州地区临邑县';

$areaArr['372428']='山东省德州地区临邑县';

$areaArr['452124']='广西壮族自治区南宁地区上林县';

$areaArr['511228']='四川省万县市城口县';

$areaArr['622426']='甘肃省定西地区渭源县';

$areaArr['512324']='四川省涪陵地区丰都县';

$areaArr['342724']='安徽省徽州地区休宁县';

$areaArr['320121']='江苏省南京市江宁县';

$areaArr['452330']='广西壮族自治区桂林地区平乐县';

$areaArr['320828']='江苏省淮安市淮安县';



$areaArr['379004']='山东省莱芜市';

$areaArr['410827']='河南省焦作市济源县';



$areaArr['412923']='河南省南阳市西峡县';

$areaArr['132930']='河北省沧州地区黄骅县';

$areaArr['362228']='江西省宜春地区上高县';

$areaArr['362228']='江西省宜春地区上高县';

$areaArr['622103']='甘肃省酒泉地区敦煌市';

$areaArr['370121']='山东省济南市历城县';

$areaArr['430403']='湖南省衡阳市城南区';

$areaArr['452128']='广西壮族自治区南宁地区扶绥县';

$areaArr['320919']='江苏省盐城市东台市';

$areaArr['612731']='陕西省榆林地区清涧县';

$areaArr['142628']='山西省临汾地区安泽县';

$areaArr['370919']='山东省泰安市莱芜市';

$areaArr['510127']='四川省成都市灌县';

$areaArr['520602']='贵州省铜仁市碧江区';

$areaArr['452824']='广西壮族自治区钦州地区灵山县';

$areaArr['370226']='山东省青岛市平度县';

$areaArr['412901']='河南省南阳市卧龙区';



$areaArr['432928']='湖南省零陵地区新田县';

$areaArr['342522']='安徽省宣城地区郎溪县';



$areaArr['342123']='安徽省阜阳地区太和县';

$areaArr['320219']='江苏省无锡市江阴县';

$areaArr['232623']='黑龙江省黑河地区德都县';

$areaArr['642101']='宁夏回族自治区吴忠市吴忠市';

$areaArr['231026']='黑龙江省牡丹江市密山县';

$areaArr['432302']='湖南省益阳地区沅江市';

$areaArr['452629']='广西壮族自治区百色地区乐业县';

$areaArr['130282']='河北省唐山市丰南市';


$areaArr['142733']='山西省运城地区垣曲县';

$areaArr['452332']='广西壮族自治区桂林地区恭城瑶族自治县';

$areaArr['239005']='黑龙江省铁力市';

$areaArr['232130']='黑龙江省松花江地区方正县';

$areaArr['441824']='广东省清远市连县';

$areaArr['232128']='黑龙江省松花江地区通河县';

$areaArr['232128']='黑龙江省松花江地区通河县';

$areaArr['232128']='黑龙江省松花江地区通河县';





$areaArr['522123']='贵州省遵义地区绥阳县';


$areaArr['450111']='广西壮族自治区南宁市郊区';

$areaArr['522530']='贵州省安顺地区紫云苗族布依族自治县';

$areaArr['362323']='江西省上饶地区玉山县';



$areaArr['612501']='陕西省商洛地区商州市';


$areaArr['342130']='安徽省阜阳地区利辛县';

$areaArr['422721']='湖北省宜昌地区宜昌县';

$areaArr['510202']='四川省重庆市市中区';

$areaArr['142726']='山西省运城地区新绛县';



$areaArr['652627']='新疆维吾尔自治区阿勒泰地区吉木乃县';


$areaArr['452628']='广西壮族自治区百色地区凌云县';


$areaArr['512533']='四川省宜宾地区珙县';

$areaArr['622623']='甘肃省陇南地区宕昌县';

$areaArr['413028']='河南省信阳地区罗山县';


$areaArr['422126']='湖北省黄冈地区英山县';

$areaArr['342128']='安徽省阜阳地区颍上县';

$areaArr['460103']='海南省海口市新华区';

$areaArr['452526']='广西壮族自治区玉林地区北流县';

$areaArr['510721']='四川省绵阳市江油县';

$areaArr['133022']='河北省衡水地区冀县';

$areaArr['420605']='湖北省襄阳市郊区';


$areaArr['640322']='宁夏回族自治区吴忠市中宁县';



$areaArr['330511']='浙江省湖州市郊区';

$areaArr['220223']='吉林省吉林市磐石县';

$areaArr['320422']='江苏省常州市金坛县';

$areaArr['642226']='宁夏回族自治区固原地区彭阳县';

$areaArr['510128']='四川省成都市崇庆县';

$areaArr['152827']='内蒙古自治区巴彦淖尔盟杭锦后旗';

$areaArr['520202']='贵州省六盘水市盘县特区';

$areaArr['612423']='陕西省安康地区石泉县';


$areaArr['362127']='江西省赣州地区安远县';



$areaArr['622429']='甘肃省定西地区岷县';

$areaArr['320423']='江苏省常州市溧阳县';

$areaArr['330814']='浙江省衢州市';

$areaArr['432902']='湖南省零陵地区冷水滩市';

$areaArr['522132']='贵州省遵义地区习水县';

$areaArr['412926']='河南省南阳市内乡县';

$areaArr['220604']='吉林省白山市临江区';

$areaArr['632125']='青海省海东地区湟源县';

$areaArr['142332']='山西省吕梁地区中阳县';

$areaArr['132229']='河北省邢台地区宁晋县';


$areaArr['511222']='四川省万县市忠县';

$areaArr['422722']='湖北省宜昌地区宜都县';

$areaArr['532401']='云南省玉溪地区玉溪市';

$areaArr['332627']='浙江省台州地区玉环县';

$areaArr['360312']='江西省萍乡市芦溪区';

$areaArr['452630']='广西壮族自治区百色地区田林县';

$areaArr['452630']='广西壮族自治区百色地区田林县';

$areaArr['440121']='广东省广州市花县';

$areaArr['622826']='甘肃省庆阳地区宁县';



$areaArr['232125']='黑龙江省松花江地区五常市';

$areaArr['132424']='河北省保定地区涞源县';

$areaArr['412325']='河南省商丘地区睢县';

$areaArr['512530']='四川省宜宾地区长宁县';

$areaArr['510224']='四川省重庆市江北县';

$areaArr['533527']='云南省临沧地区耿马傣族佤族自治县';

$areaArr['320881']='江苏省淮安市宿迁市';

$areaArr['533521']='云南省临沧地区临沧县';

$areaArr['321024']='江苏省扬州市靖江县';


$areaArr['342121']='安徽省阜阳地区阜阳县';

$areaArr['612732']='陕西省榆林地区子洲县';

$areaArr['152632']='内蒙古自治区乌兰察布盟察哈尔右翼后旗';

$areaArr['512224']='四川省万县地区梁平县';


$areaArr['622824']='甘肃省庆阳地区合水县';

$areaArr['320622']='江苏省南通市如皋县';

$areaArr['152701']='内蒙古自治区伊克昭盟东胜市';

$areaArr['412931']='河南省南阳市新野县';

$areaArr['412931']='河南省南阳市新野县';

$areaArr['142231']='山西省忻州地区岢岚县';

$areaArr['412928']='河南省南阳市社旗县';

$areaArr['370729']='山东省潍坊市五莲县';

$areaArr['642223']='宁夏回族自治区固原地区西吉县';

$areaArr['511021']='四川省内江市内江县';

$areaArr['342225']='安徽省宿县地区泗县';

$areaArr['510126']='四川省成都市彭县';


$areaArr['410412']='河南省平顶山市舞钢区';



$areaArr['432810']='湖南省郴州地区';

$areaArr['440622']='广东省佛山市南海县';

$areaArr['210219']='辽宁省大连市瓦房店市';

$areaArr['132627']='河北省承德地区丰宁满族自治县';

$areaArr['372823']='山东省临沂地区苍山县';



$areaArr['370722']='山东省潍坊市安丘县';

$areaArr['370727']='山东省潍坊市高密县';


$areaArr['210623']='辽宁省丹东市东沟县';

$areaArr['410107']='河南省郑州市新密区';

$areaArr['513127']='四川省雅安地区芦山县';

$areaArr['412321']='河南省商丘地区虞城县';



$areaArr['440924']='广东省茂名市化州县';

$areaArr['440924']='广东省茂名市化州县';

$areaArr['142325']='山西省吕梁地区兴县';

$areaArr['433031']='湖南省怀化地区通道侗族自治县';



$areaArr['222328']='吉林省白城地区乾安县';

$areaArr['533525']='云南省临沧地区彭水苗族土家族自治县';

$areaArr['320823']='江苏省淮安市沭阳县';


$areaArr['152627']='内蒙古自治区乌兰察布盟兴和县';

$areaArr['622225']='甘肃省张掖地区高台县';

$areaArr['522525']='贵州省安顺地区清镇县';



$areaArr['132332']='河北省石家庄市赞皇县';

$areaArr['352601']='福建省龙岩地区龙岩市';

$areaArr['222302']='吉林省白城地区洮南市';

$areaArr['642123']='宁夏回族自治区吴忠市中卫县';

$areaArr['432826']='湖南省郴州地区嘉禾县';

$areaArr['220121']='吉林省长春市榆树县';

$areaArr['452503']='广西壮族自治区玉林地区北流市';

$areaArr['370981']='山东省泰安市莱芜市';

$areaArr['320523']='江苏省苏州市昆山县';

$areaArr['362136']='江西省赣州地区寻乌县';


$areaArr['522129']='贵州省遵义地区余庆县';

$areaArr['152722']='内蒙古自治区伊克昭盟达拉特旗';


$areaArr['142128']='山西省雁北地区朔县';

$areaArr['142330']='山西省吕梁地区方山县';

$areaArr['452702']='广西壮族自治区河池地区宜州市';

$areaArr['452702']='广西壮族自治区河池地区宜州市';



$areaArr['442522']='广东省紫金县';

$areaArr['152129']='内蒙古自治区呼伦贝尔盟新巴尔虎右旗';

$areaArr['320822']='江苏省淮安市灌南县';

$areaArr['422128']='湖北省黄冈地区蕲春县';



$areaArr['413025']='河南省信阳地区光山县';

$areaArr['452627']='广西壮族自治区百色地区那坡县';

$areaArr['132829']='河北省廊坊地区大城县';

$areaArr['340224']='安徽省芜湖市青阳县';


$areaArr['152324']='内蒙古自治区哲里木盟开鲁县';

$areaArr['152324']='内蒙古自治区哲里木盟开鲁县';

$areaArr['142635']='山西省临汾地区隰县';

$areaArr['622725']='甘肃省平凉地区华亭县';

$areaArr['612430']='陕西省安康地区白河县';


$areaArr['362124']='江西省赣州地区大余县';

$areaArr['210821']='辽宁省营口市营口县';

$areaArr['222323']='吉林省白城地区长岭县';

$areaArr['513524']='四川省黔江地区酉阳土家族苗族自治县';

$areaArr['142225']='山西省忻州地区代县';

$areaArr['440726']='广东省江门市阳江县';

$areaArr['532422']='云南省玉溪地区江川县';

$areaArr['220111']='吉林省长春市郊区';

$areaArr['632124']='青海省海东地区湟中县';

$areaArr['133127']='河北省';

$areaArr['133127']='河北省';

$areaArr['363401']='江西省';

$areaArr['363401']='江西省';

$areaArr['363401']='江西省';

$areaArr['321123']='江苏省镇江市句容县';

$areaArr['320928']='江苏省盐城市盐都县';

$areaArr['370222']='山东省青岛市即墨县';

$areaArr['370222']='山东省青岛市即墨县';

$areaArr['140103']='山西省太原市北城区';

$areaArr['371711']='山东省菏泽市';

$areaArr['371711']='山东省菏泽市';

$areaArr['132929']='河北省沧州地区盐山县';

$areaArr['513624']='四川省广安市邻水县';

$areaArr['423225']='湖北省';

$areaArr['222301']='吉林省白城地区白城市';

$areaArr['123456']='天津市';

$areaArr['142401']='山西省晋中地区榆次市';

$areaArr['142636']='山西省临汾地区汾西县';

$areaArr['142636']='山西省临汾地区汾西县';

$areaArr['370627']='山东省烟台市莱阳县';

$areaArr['132123']='河北省邯郸地区曲周县';

$areaArr['518322']='四川省';

$areaArr['152628']='内蒙古自治区乌兰察布盟丰镇县';

$areaArr['532225']='云南省曲靖地区富源县';

$areaArr['140113']='山西省太原市北郊区';

$areaArr['133026']='河北省衡水地区武强县';

$areaArr['132232']='河北省邢台地区新河县';

$areaArr['654127']='新疆维吾尔自治区伊犁哈萨克自治州特克斯县';

$areaArr['440824']='广东省湛江市海康县';

$areaArr['440824']='广东省湛江市海康县';

$areaArr['440824']='广东省湛江市海康县';

$areaArr['510602']='四川省德阳市市中区';

$areaArr['460210']='海南省三亚市';

$areaArr['370204']='山东省青岛市台东区';

$areaArr['612725']='陕西省榆林地区靖边县';

$areaArr['330423']='浙江省嘉兴市海宁县';

$areaArr['142632']='山西省临汾地区蒲县';

$areaArr['142229']='山西省忻州地区神池县';

$areaArr['142229']='山西省忻州地区神池县';

$areaArr['410186']='河南省郑州市';

$areaArr['222324']='吉林省白城地区前郭尔罗斯蒙古族自治县';

$areaArr['222324']='吉林省白城地区前郭尔罗斯蒙古族自治县';

$areaArr['622226']='甘肃省张掖地区山丹县';

$areaArr['230105']='黑龙江省哈尔滨市太平区';

$areaArr['222303']='吉林省白城地区扶余市';

$areaArr['228284']='吉林省';

$areaArr['642222']='宁夏回族自治区固原地区海原县';

$areaArr['642222']='宁夏回族自治区固原地区海原县';

$areaArr['362501']='江西省抚州地区临川市';

$areaArr['642102']='宁夏回族自治区吴忠市利通区';

$areaArr['642102']='宁夏回族自治区吴忠市利通区';

$areaArr['522126']='贵州省遵义地区务川仡佬族苗族自治县';

$areaArr['238622']='黑龙江省';

$areaArr['221321']='吉林省';

$areaArr['460005']='海南省海南省文昌市';

$areaArr['460005']='海南省海南省文昌市';

$areaArr['532424']='云南省玉溪地区通海县';

$areaArr['372502']='山东省聊城市东昌府区';

$areaArr['110226']='北京市平谷县';

$areaArr['110226']='北京市平谷县';

$areaArr['110226']='北京市平谷县';

$areaArr['110226']='北京市平谷县';

$areaArr['452722']='广西壮族自治区河池地区宜山县';

$areaArr['620182']='甘肃省兰州市';

$areaArr['620182']='甘肃省兰州市';

$areaArr['612126']='陕西省渭南地区潼关县';

$areaArr['532126']='云南省昭通地区永善县';

$areaArr['142430']='山西省晋中地区祁县';

$areaArr['142430']='山西省晋中地区祁县';

$areaArr['362423']='江西省吉安地区峡江县';

$areaArr['210621']='辽宁省丹东市凤城满族自治县';

$areaArr['320320']='江苏省徐州市';

$areaArr['320320']='江苏省徐州市';

$areaArr['440528']='广东省汕头市惠来县';

$areaArr['440524']='广东省汕头市潮阳县';

$areaArr['512534']='四川省宜宾地区兴文县';

$areaArr['341291']='安徽省阜阳市';

$areaArr['341291']='安徽省阜阳市';

$areaArr['418782']='河南省';

$areaArr['452101']='广西壮族自治区南宁地区凭祥市';

$areaArr['513026']='四川省达川地区南江县';

$areaArr['513026']='四川省达川地区南江县';

$areaArr['330323']='浙江省温州市乐清县';

$areaArr['622101']='甘肃省酒泉地区玉门市';

$areaArr['412322']='河南省商丘地区商丘县';

$areaArr['132934']='河北省沧州地区海兴县';

$areaArr['239004']='黑龙江省富锦市';

$areaArr['612325']='陕西省汉中地区勉县';

$areaArr['612325']='陕西省汉中地区勉县';

$areaArr['612325']='陕西省汉中地区勉县';

$areaArr['654124']='新疆维吾尔自治区伊犁哈萨克自治州巩留县';

$areaArr['654124']='新疆维吾尔自治区伊犁哈萨克自治州巩留县';

$areaArr['654124']='新疆维吾尔自治区伊犁哈萨克自治州巩留县';

$areaArr['654124']='新疆维吾尔自治区伊犁哈萨克自治州巩留县';

$areaArr['654124']='新疆维吾尔自治区伊犁哈萨克自治州巩留县';

$areaArr['142422']='山西省晋中地区左权县';

$areaArr['142621']='山西省临汾地区曲沃县';

$areaArr['310224']='上海市川沙县';

$areaArr['620505']='甘肃省天水市';

$areaArr['142232']='山西省忻州地区河曲县';

$areaArr['132527']='河北省张家口地区怀安县';

$areaArr['622626']='甘肃省陇南地区文县';

$areaArr['311382']='上海市';

$areaArr['311382']='上海市';

$areaArr['311382']='上海市';

$areaArr['522522']='贵州省安顺地区开阳县';

$areaArr['440509']='广东省汕头市升平区';

$areaArr['422121']='湖北省黄冈地区黄冈县';

$areaArr['352229']='福建省宁德地区寿宁县';

$areaArr['133024']='河北省衡水地区武邑县';

$areaArr['350683']='福建省漳州市';

$areaArr['350683']='福建省漳州市';

$areaArr['350683']='福建省漳州市';

$areaArr['510230']='四川省重庆市大足县';

$areaArr['372900']='山东省菏泽地区菏泽地区';

$areaArr['372900']='山东省菏泽地区菏泽地区';

$areaArr['372900']='山东省菏泽地区菏泽地区';

$areaArr['372900']='山东省菏泽地区菏泽地区';

$areaArr['442830']='广东省罗定县';

$areaArr['142901']='山西省';

$areaArr['142901']='山西省';

$areaArr['422432']='湖北省荆州地区京山县';

$areaArr['612133']='陕西省渭南地区富平县';

$areaArr['612133']='陕西省渭南地区富平县';

$areaArr['612133']='陕西省渭南地区富平县';

$areaArr['612133']='陕西省渭南地区富平县';

$areaArr['152631']='内蒙古自治区乌兰察布盟察哈尔右翼中旗';

$areaArr['411127']='河南省漯河市';

$areaArr['618324']='陕西省';

$areaArr['618324']='陕西省';

$areaArr['210622']='辽宁省丹东市岫岩满族自治县';

$areaArr['418928']='河南省';

$areaArr['418928']='河南省';

$areaArr['418928']='河南省';

$areaArr['418928']='河南省';

$areaArr['350283']='福建省厦门市';

$areaArr['130709']='河北省张家口市';

$areaArr['130709']='河北省张家口市';

$areaArr['130709']='河北省张家口市';

$areaArr['130709']='河北省张家口市';

$areaArr['420686']='湖北省襄阳市';

$areaArr['420686']='湖北省襄阳市';

$areaArr['342327']='安徽省滁县地区嘉山县';

$areaArr['342327']='安徽省滁县地区嘉山县';

$areaArr['342327']='安徽省滁县地区嘉山县';

$areaArr['342327']='安徽省滁县地区嘉山县';

$areaArr['652625']='新疆维吾尔自治区阿勒泰地区哈巴河县';

$areaArr['652625']='新疆维吾尔自治区阿勒泰地区哈巴河县';

$areaArr['532201']='云南省曲靖地区麒麟区';

$areaArr['532201']='云南省曲靖地区麒麟区';

$areaArr['532201']='云南省曲靖地区麒麟区';

$areaArr['410717']='河南省新乡市';

$areaArr['371382']='山东省临沂市';

$areaArr['622123']='甘肃省酒泉地区金塔县';

$areaArr['142402']='山西省晋中地区介休市';

$areaArr['654128']='新疆维吾尔自治区伊犁哈萨克自治州尼勒克县';

$areaArr['622825']='甘肃省庆阳地区正宁县';

$areaArr['622825']='甘肃省庆阳地区正宁县';

$areaArr['142429']='山西省晋中地区太谷县';

$areaArr['220222']='吉林省吉林市舒兰县';

$areaArr['218604']='辽宁省';

$areaArr['640602']='宁夏回族自治区';

$areaArr['342324']='安徽省滁县地区全椒县';

$areaArr['422323']='湖北省咸宁地区蒲圻县';

$areaArr['220124']='吉林省长春市德惠县';

$areaArr['132326']='河北省石家庄市赵县';

$areaArr['330622']='浙江省绍兴市上虞县';

$areaArr['330622']='浙江省绍兴市上虞县';

$areaArr['448802']='广东省';

$areaArr['420687']='湖北省襄阳市';

$areaArr['420687']='湖北省襄阳市';

$areaArr['420687']='湖北省襄阳市';

$areaArr['511221']='四川省万县市开县';

$areaArr['620426']='甘肃省白银市';

$areaArr['612523']='陕西省商洛地区丹凤县';

$areaArr['328621']='江苏省';

$areaArr['232329']='黑龙江省绥化地区肇州县';

$areaArr['440525']='广东省汕头市揭阳县';

$areaArr['620305']='甘肃省金昌市';

$areaArr['533223']='云南省丽江地区华坪县';

$areaArr['132622']='河北省承德地区宽城满族自治县';

$areaArr['320825']='江苏省淮安市泗阳县';

$areaArr['320825']='江苏省淮安市泗阳县';

$areaArr['642103']='宁夏回族自治区吴忠市灵武市';

$areaArr['132222']='河北省邢台地区沙河县';

$areaArr['450525']='广西壮族自治区北海市';

$areaArr['142331']='山西省吕梁地区';

$areaArr['330184']='浙江省杭州市余杭市';

$areaArr['441122']='广东省';

$areaArr['441122']='广东省';

$areaArr['440127']='广东省广州市清远县';

$areaArr['460001']='海南省海南省通什市';

$areaArr['460001']='海南省海南省通什市';

$areaArr['460001']='海南省海南省通什市';

$areaArr['460001']='海南省海南省通什市';

$areaArr['460001']='海南省海南省通什市';

$areaArr['350192']='福建省福州市';

$areaArr['320326']='江苏省徐州市新沂县';

$areaArr['654121']='新疆维吾尔自治区伊犁哈萨克自治州伊宁县';

$areaArr['441745']='广东省阳江市';

$areaArr['640103']='宁夏回族自治区银川市新城区';

$areaArr['132442']='河北省保定地区蠡县';

$areaArr['370723']='山东省潍坊市寿光县';

$areaArr['320955']='江苏省盐城市';

$areaArr['142121']='山西省雁北地区阳高县';

$areaArr['142121']='山西省雁北地区阳高县';

$areaArr['131323']='河北省';

$areaArr['131323']='河北省';

$areaArr['131323']='河北省';

$areaArr['229005']='吉林省九台市';

$areaArr['452133']='广西壮族自治区南宁地区龙州县';

$areaArr['328722']='江苏省';

$areaArr['312801']='上海市';

$areaArr['452129']='广西壮族自治区南宁地区崇左县';

$areaArr['320525']='江苏省苏州市吴江县';

$areaArr['422726']='湖北省宜昌地区兴山县';

$areaArr['632825']='青海省海西蒙古族藏族自治州冷湖行委';

$areaArr['132336']='河北省石家庄市灵寿县';

$areaArr['434002']='湖南省';

$areaArr['422724']='湖北省宜昌地区当阳县';

$areaArr['142424']='山西省晋中地区昔阳县';

$areaArr['132430']='河北省保定地区涿县';

$areaArr['370622']='山东省烟台市蓬莱县';

$areaArr['421825']='湖北省';

$areaArr['421825']='湖北省';

$areaArr['133030']='河北省衡水地区景县';

$areaArr['120016']='天津市天津市';

$areaArr['612428']='陕西省安康地区镇坪县';

$areaArr['352625']='福建省龙岩地区武平县';

$areaArr['645223']='宁夏回族自治区';

$areaArr['441227']='广东省肇庆市云浮县';

$areaArr['320325']='江苏省徐州市邳县';

$areaArr['518781']='四川省';

$areaArr['130226']='河北省唐山市迁安县';

$areaArr['433021']='湖南省怀化地区黔阳县';

$areaArr['533522']='云南省临沧地区凤庆县';

$areaArr['130332']='河北省秦皇岛市';

$areaArr['321085']='江苏省扬州市泰兴市';

$areaArr['445328']='广东省云浮市';

$areaArr['513521']='四川省黔江地区石柱土家族自治县';

$areaArr['622224']='甘肃省张掖地区临泽县';

$areaArr['511202']='四川省万县市龙宝区';

$areaArr['654222']='新疆维吾尔自治区塔城地区乌苏市';

$areaArr['532223']='云南省曲靖地区马龙县';

$areaArr['610421']='陕西省咸阳市兴平县';

$areaArr['326422']='江苏省';

$areaArr['232382']='黑龙江省绥化地区';

$areaArr['320511']='江苏省苏州市郊区';

$areaArr['149001']='山西省古交市';

$areaArr['511211']='四川省万县市';

$areaArr['620506']='甘肃省天水市';

$areaArr['432927']='湖南省零陵地区蓝山县';

$areaArr['362137']='江西省赣州地区石城县';

$areaArr['378602']='山东省';

$areaArr['510214']='四川省重庆市南岸区';

$areaArr['132223']='河北省邢台地区临城县';

$areaArr['511315']='四川省南充市';

$areaArr['430322']='湖南省湘潭市湘乡县';

$areaArr['320620']='江苏省南通市';

$areaArr['133023']='河北省衡水地区枣强县';

$areaArr['452524']='广西壮族自治区玉林地区平南县';

$areaArr['142230']='山西省忻州地区五寨县';

$areaArr['132133']='河北省邯郸地区永年县';

$areaArr['522221']='贵州省铜仁地区铜仁县';

$areaArr['360211']='江西省景德镇市鹅湖区';

$areaArr['362432']='江西省吉安地区宁冈县';

$areaArr['612601']='陕西省延安地区延安市';

$areaArr['310228']='上海市金山县';

$areaArr['511022']='四川省内江市乐至县';

$areaArr['441722']='广东省阳江市阳春县';

$areaArr['130160']='河北省石家庄市';

$areaArr['130160']='河北省石家庄市';

$areaArr['510219']='四川省重庆市巴南区';

$areaArr['232602']='黑龙江省黑河地区北安市';

$areaArr['430123']='湖南省长沙市浏阳县';

$areaArr['652421']='新疆维吾尔自治区伊犁哈萨克自治州伊宁县';

$areaArr['430705']='湖南省常德市';

$areaArr['430705']='湖南省常德市';

$areaArr['430705']='湖南省常德市';

$areaArr['372432']='山东省德州地区庆云县';

$areaArr['422400']='湖北省荆州地区荆州地区';

$areaArr['433024']='湖南省怀化地区溆浦县';

$areaArr['352623']='福建省龙岩地区永定县';

$areaArr['229004']='吉林省桦甸市';

$areaArr['513028']='四川省达川地区平昌县';

$areaArr['420424']='湖北省沙市';

$areaArr['372523']='山东省聊城市茌平县';

$areaArr['442529']='广东省龙川县';

$areaArr['342223']='安徽省宿县地区宿县';

$areaArr['612622']='陕西省延安地区延川县';

$areaArr['330227']='浙江省宁波市鄞县';

$areaArr['352226']='福建省宁德地区福安县';

$areaArr['612730']='陕西省榆林地区吴堡县';

$areaArr['332626']='浙江省台州地区三门县';

$areaArr['132425']='河北省保定地区定兴县';

$areaArr['132321']='河北省石家庄市束鹿县';

$areaArr['132927']='河北省沧州地区东光县';

$areaArr['460300']='海南省三沙市三沙市';

$areaArr['370314']='山东省淄博市';

$areaArr['152825']='内蒙古自治区巴彦淖尔盟乌拉特中旗';

$areaArr['372832']='山东省临沂地区沂南县';

$areaArr['411223']='河南省三门峡市灵宝县';

$areaArr['433026']='湖南省怀化地区新晃侗族自治县';

$areaArr['370632']='山东省烟台市文登县';

$areaArr['132124']='河北省邯郸地区丘县';

$areaArr['132124']='河北省邯郸地区丘县';

$areaArr['612728']='陕西省榆林地区米脂县';

$areaArr['532725']='云南省思茅地区景谷傣族彝族自治县';

$areaArr['433029']='湖南省怀化地区会同县';

$areaArr['350126']='福建省福州市长乐县';

$areaArr['230831']='黑龙江省佳木斯市同江县';

$areaArr['618427']='陕西省';

$areaArr['618427']='陕西省';

$areaArr['618427']='陕西省';

$areaArr['132626']='河北省承德地区滦平县';

$areaArr['640111']='宁夏回族自治区银川市郊区';

$areaArr['640204']='宁夏回族自治区石嘴山市石炭井区';

$areaArr['640204']='宁夏回族自治区石嘴山市石炭井区';

$areaArr['320212']='江苏省无锡市马山区';

$areaArr['512901']='四川省南充地区南充市';

$areaArr['612128']='陕西省渭南地区蒲城县';

$areaArr['350420']='福建省三明市永安市';

$areaArr['370221']='山东省青岛市崂山县';

$areaArr['130422']='河北省邯郸市武安县';

$areaArr['370721']='山东省潍坊市益都县';

$areaArr['413222']='河南省';

$areaArr['412925']='河南省南阳市镇平县';

$areaArr['379008']='山东省莱阳市';

$areaArr['132984']='河北省沧州地区';

$areaArr['131088']='河北省廊坊市';

$areaArr['522524']='贵州省安顺地区修文县';

$areaArr['332603']='浙江省台州地区黄岩市';

$areaArr['510232']='四川省重庆市璧山县';

$areaArr['372431']='山东省德州地区宁津县';

$areaArr['370183']='山东省济南市';

$areaArr['370183']='山东省济南市';

$areaArr['522124']='贵州省遵义地区正安县';

$areaArr['320222']='江苏省无锡市无锡县';

$areaArr['510225']='四川省重庆市江津县';

$areaArr['362125']='江西省赣州地区上犹县';

$areaArr['352103']='福建省南平地区武夷山市';

$areaArr['621799']='甘肃省';

$areaArr['508238']='重庆市';

$areaArr['508238']='重庆市';

$areaArr['612727']='陕西省榆林地区绥德县';

$areaArr['232330']='黑龙江省绥化地区庆安县';

$areaArr['433102']='湖南省湘西土家族苗族自治州';

$areaArr['512228']='四川省万县地区巫溪县';

$areaArr['452228']='广西壮族自治区柳州地区三江侗族自治县';

$areaArr['433030']='湖南省怀化地区靖县';

$areaArr['342826']='安徽省安庆地区宿松县';

$areaArr['362121']='江西省赣州地区赣县';

$areaArr['652721']='新疆维吾尔自治区博尔塔拉蒙古自治州博乐县';

$areaArr['452625']='广西壮族自治区百色地区德保县';

$areaArr['452625']='广西壮族自治区百色地区德保县';

$areaArr['453625']='广西壮族自治区';

$areaArr['453625']='广西壮族自治区';

$areaArr['142233']='山西省忻州地区保德县';

$areaArr['152724']='内蒙古自治区伊克昭盟鄂托克前旗';

$areaArr['512925']='四川省南充地区广安县';

$areaArr['370225']='山东省青岛市莱西县';

$areaArr['110224']='北京市大兴县';

$areaArr['422204']='湖北省孝感地区广水市';

$areaArr['422424']='湖北省荆州地区石首县';

$areaArr['379102']='山东省';

$areaArr['379012']='山东省荣城市';

$areaArr['412323']='河南省商丘地区民权县';

$areaArr['620404']='甘肃省白银市';

$areaArr['132432']='河北省保定地区高阳县';

$areaArr['510281']='四川省重庆市永川市';

$areaArr['440684']='广东省佛山市高明市';

$areaArr['440684']='广东省佛山市高明市';

$areaArr['350221']='福建省厦门市';

$areaArr['422322']='湖北省咸宁地区嘉鱼县';

$areaArr['452731']='广西壮族自治区河池地区大化瑶族自治县';

$areaArr['510223']='四川省重庆市綦江县';

$areaArr['422425']='湖北省荆州地区监利县';

$areaArr['350621']='福建省漳州市龙海县';

$areaArr['332502']='浙江省丽水地区龙泉市';

$areaArr['350127']='福建省福州市福清县';

$areaArr['413728']='河南省';

$areaArr['612124']='陕西省渭南地区华县';

$areaArr['512225']='四川省万县地区云阳县';

$areaArr['512227']='四川省万县地区巫山县';

$areaArr['520124']='贵州省贵阳市';

$areaArr['450211']='广西壮族自治区柳州市市郊区';

$areaArr['312632']='上海市';

$areaArr['312632']='上海市';

$areaArr['231103']='黑龙江省黑河市';

$areaArr['612329']='陕西省汉中地区留坝县';

$areaArr['612329']='陕西省汉中地区留坝县';

$areaArr['432623']='湖南省邵阳地区武冈县';

$areaArr['522421']='贵州省毕节地区毕节县';

$areaArr['332601']='浙江省台州地区椒江市';

$areaArr['220603']='吉林省白山市三岔子区';

$areaArr['442531']='广东省海丰县';

$areaArr['132427']='河北省保定地区唐县';

$areaArr['452230']='广西壮族自治区柳州地区金秀瑶族自治县';

$areaArr['113196']='北京市';

$areaArr['352622']='福建省龙岩地区长汀县';

$areaArr['413029']='河南省信阳地区新县';

$areaArr['142321']='山西省吕梁地区汾阳县';

$areaArr['510216']='四川省重庆市万盛区';

$areaArr['132402']='河北省保定地区涿州市';

$areaArr['321020']='江苏省扬州市泰州市';

$areaArr['431135']='湖南省永州市';

$areaArr['152728']='内蒙古自治区伊克昭盟伊金霍洛旗';

$areaArr['512929']='四川省南充地区西充县';

$areaArr['352101']='福建省南平地区南平市';

$areaArr['510226']='四川省重庆市合川县';

$areaArr['622222']='甘肃省张掖地区肃南裕固族自治县';

$areaArr['330625']='浙江省绍兴市诸暨县';

$areaArr['332528']='浙江省丽水地区松阳县';

$areaArr['513525']='四川省黔江地区';

$areaArr['513525']='四川省黔江地区';

$areaArr['372830']='山东省临沂地区平邑县';

$areaArr['612102']='陕西省渭南地区韩城市';

$areaArr['422224']='湖北省孝感地区应山县';

$areaArr['460023']='海南省海南省琼海县';

$areaArr['210724']='辽宁省锦州市锦县';

$areaArr['433022']='湖南省怀化地区沅陵县';

$areaArr['469022']='海南省屯昌县';

$areaArr['522131']='贵州省遵义地区赤水县';

$areaArr['132532']='河北省张家口地区赤城县';

$areaArr['652601']='新疆维吾尔自治区阿勒泰地区阿勒泰县';

$areaArr['414024']='河南省';

$areaArr['522529']='贵州省安顺地区镇宁布依族苗族自治县';

$areaArr['452727']='广西壮族自治区河池地区凤山县';

$areaArr['352230']='福建省宁德地区周宁县';

$areaArr['132322']='河北省石家庄市晋县';

$areaArr['412927']='河南省南阳市淅川县';

$areaArr['431827']='湖南省';

$areaArr['431827']='湖南省';

$areaArr['359001']='福建省永安市';

$areaArr['452728']='广西壮族自治区河池地区东兰县';

$areaArr['432827']='湖南省郴州地区临武县';

$areaArr['130122']='河北省石家庄市获鹿县';

$areaArr['432421']='湖南省常德地区常德县';

$areaArr['210719']='辽宁省锦州市锦西市';

$areaArr['512928']='四川省南充地区武胜县';

$areaArr['512928']='四川省南充地区武胜县';

$areaArr['132335']='河北省石家庄市平山县';

$areaArr['132302']='河北省石家庄市藁城市';

$areaArr['132331']='河北省石家庄市元氏县';

$areaArr['132429']='河北省保定地区涞水县';

$areaArr['211111']='辽宁省盘锦市郊区';

$areaArr['132226']='河北省邢台地区隆尧县';

$areaArr['532724']='云南省思茅地区景东彝族自治县';

$areaArr['320315']='江苏省徐州市';

$areaArr['142421']='山西省晋中地区榆社县';

$areaArr['440702']='广东省江门市城区';

$areaArr['362523']='江西省抚州地区黎川县';

$areaArr['460036']='海南省海南省琼中黎族苗族自治县';

$areaArr['412902']='河南省南阳市邓州市';

$areaArr['362528']='江西省抚州地区金溪县';

$areaArr['138521']='河北省';

$areaArr['310223']='上海市宝山县';

$areaArr['432622']='湖南省邵阳地区隆回县';

$areaArr['330422']='浙江省嘉兴市平湖县';

$areaArr['210319']='辽宁省鞍山市开发区';

$areaArr['511203']='四川省万县市天成区';

$areaArr['412930']='河南省南阳市邓县';

$areaArr['140111']='山西省太原市古交工矿区';

$areaArr['340113']='安徽省合肥市';

$areaArr['152824']='内蒙古自治区巴彦淖尔盟乌拉特前旗';

$areaArr['512532']='四川省宜宾地区筠连县';

$areaArr['110222']='北京市顺义县';

$areaArr['510523']='四川省泸州市纳溪县';

$areaArr['332526']='浙江省丽水地区缙云县';

$areaArr['362129']='江西省赣州地区定南县';

$areaArr['622823']='甘肃省庆阳地区华池县';

$areaArr['330124']='浙江省杭州市临安县';

$areaArr['450411']='广西壮族自治区梧州市市郊区';

$areaArr['452426']='广西壮族自治区贺州地区贺县';
